Autodesk.AutoCAD.EditorInput.JigPromptOptions
This is the base class for containers of input arguments that may be passed to the Jig sampling prompt.

Autodesk.AutoCAD.EditorInput.JigPromptOptions.Cursor
Gets or sets the cursor to be associated with the prompt.

Autodesk.AutoCAD.EditorInput.JigPromptOptions.UserInputControls
Returns the bitwise OR'd value of all user input control settings in effect at the present time for this particular jig.