Autodesk.AutoCAD.EditorInput.PromptEntityOptionsEventArgs
This class provides data for the PromptingForEntity> event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptEntityOptionsEventArgs.Options
Gets the input parameters of the prompt.