Autodesk.AutoCAD.ApplicationServices.DocumentCollectionEventArgs
This class provides data for various events of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentCollectionEventArgs.Document
Wraps the AcApDocManager.document() function.