Autodesk.AutoCAD.EditorInput.PromptPointResult
This class holds the result of a prompt that returns a point as its primary result.

Autodesk.AutoCAD.EditorInput.PromptPointResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptPointResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptPointResult.Value
Gets the point that the user entered.