Autodesk.AutoCAD.ApplicationServices.DocumentCollection
This .NET class wraps the AcApDocManager ObjectARX class.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.CopyTo(Autodesk.AutoCAD.ApplicationServices.Document[],System.Int32)
Copies the DocumentCollection to a one-dimensional array.
array:  Input the one-dimensional array that is the destination of the elements copied from DocumentCollection. The array must have zero-based indexing.
index:  Input the zero-based index in array at which copying begins.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.AppContextNewDocument(System.String)
This function allows synchronous access to the NEW drawing operation.
templateFileName:  Input path/filename or URL of template file to use

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.AppContextOpenDocument(System.String)
This function allows synchronous access to the OPEN drawing operation.
fileName:  Input path/filenam

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.AppContextRecoverDocument(System.String)
This is AppContextRecoverDocument, a member of class DocumentCollection.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.ExecuteInApplicationContext(Autodesk.AutoCAD.ApplicationServices.ExecuteInApplicationContextCallback,System.Object)
Allows a void function to be called from the application context.
callback:  Input Autodesk.AutoCAD.ApplicationServices.ExecuteInApplicationContextCallback object.
data:  Input any data that should be used for the function call.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.GetDocument(Autodesk.AutoCAD.DatabaseServices.Database)
Returns the Document.
db:  Input database to obtain from.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.GetPendingDocumentForSwitch
This is GetPendingDocumentForSwitch, a member of class DocumentCollection.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentCreateStarted
Wraps the AcApDocManagerReactor.documentCreateStarted() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentCreated
Wraps the AcApDocManagerReactor.documentCreated() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentToBeDestroyed
Wraps the AcApDocManagerReactor.documentToBeDestroyed() ObjectARX function.
This notification is sent at the beginning of document destruction.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentDestroyed
Wraps the AcApDocManagerReactor.documentDestroyed() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentCreationCanceled
Wraps the AcApDocManagerReactor.documentCreationCanceled() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentBecameCurrent
Wraps the AcApDocManagerReactor.documentBecameCurrent() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentToBeActivated
Wraps the AcApDocManagerReactor.documentToBeActivated() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentToBeDeactivated
Wraps the AcApDocManagerReactor.documentToBeDeactivated() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentActivationChanged
Wraps the AcApDocManagerReactor.documentActivationChanged() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentActivated
Wraps the AcApDocManagerReactor.documentActivated() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentLockModeWillChange
Wraps the AcApDocManagerReactor.documentLockModeWillChange() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentLockModeChangeVetoed
Wraps the AcApDocManagerReactor.documentLockModeChangeVetoed() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentLockModeChanged
Wraps the AcApDocManagerReactor.documentLockModeChanged() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.Count
Accesses the number of documents.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.MdiActiveDocument
Accesses the MDI active document.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.CurrentDocument
This is CurrentDocument, a member of class DocumentCollection.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DocumentActivationEnabled
Accesses the status of document activation.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.IsApplicationContext
Assesses if a function is executing in the application context.

Autodesk.AutoCAD.ApplicationServices.DocumentCollection.DefaultFormatForSave
Gets or sets the default DocumentSaveFormat for AutoCAD.