Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs
This class provides data for UnknownInput and KeywordInput events of a PromptSelectionOptions object.

Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs.SetErrorMessage(System.String)
Sets the error message that the selection prompt should display to the user.
errorMessage:  Input the error message text.

Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs.AddObjects(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Adds objects to the selection set.
ids:  Input an array of object IDs to be added to the selection set.

Autodesk.AutoCAD.EditorInput.SelectionTextInputEventArgs.Input
Gets the input that the user entered in the form of string.