Autodesk.AutoCAD.ApplicationServices.WhoHasInfo
This value class containing information returned from Application.GetWhoHasInfo().

Autodesk.AutoCAD.ApplicationServices.WhoHasInfo.IsFileLocked
Assesses if the file is currently locked for editing by this or another AutoCAD session.

Autodesk.AutoCAD.ApplicationServices.WhoHasInfo.UserName
Accesses the user name (login name) of the user editing the drawing if the file is opened for editing.

Autodesk.AutoCAD.ApplicationServices.WhoHasInfo.ComputerName
Accesses the computer name of the system being used to edit the drawing if the file is opened for editing.

Autodesk.AutoCAD.ApplicationServices.WhoHasInfo.OpenTime
Accesses a string detailing the date and time the drawing file was opened if the file is opened for editing.