Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs
This class provides data for the DocumentLockModeChanged event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.Veto
This function can be called during a DocumentLockModeChanged callback if it is a callback for a lock request.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.Document
Wraps the AcApDocManager::document() ObjectARX function, which returns the document that the input database belongs to.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.MyPreviousMode
Accesses the previous locks of this fiber.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.MyCurrentMode
Accesses the current locks that this fiber has on the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.CurrentMode
Accesses the current lock mode of the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangedEventArgs.GlobalCommandName
Accesses the name of the command that is requesting the change.