Autodesk.AutoCAD.EditorInput.KeywordCollection
This class holds a collection of Keyword objects.

Autodesk.AutoCAD.EditorInput.KeywordCollection.#ctor
Constructor.

Autodesk.AutoCAD.EditorInput.KeywordCollection.GetEnumerator
Returns an IEnumerator for the KeywordCollection.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String)
Calls Add(globalName,globalName).
globalName:  Input the global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String,System.String)
Calls Add(globalName,localName,localName).
globalName:  Input the global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.
localName:  Input the local name of the keyword; the user enters the local name to specify the keyword.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String,System.String,System.String)
Calls Add(globalName, localName,displayName, true, true).
globalName:  Input global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.
localName:  Input local name of the keyword; the user enters the local name to specify the keyword.
displayName:  Input display name of the keyword; this is shown on the command line and is usually the same as local name.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Add(System.String,System.String,System.String,System.Boolean,System.Boolean)
Adds a keyword to the KeywordCollection class. visible indicates whether the keyword should be shown to the user.
globalName:  Input global name of the keyword; this is never displayed, but can be used by programs to access keywords when the local translation is not known.
localName:  Input local name of the keyword; the user enters the local name to specify the keyword.
displayName:  Input display name of the keyword; this is shown on the command line and is usually the same as local name.
visible:  Input indicates whether the keyword should be shows to the user.
enabled:  Input indicates whether the keyword is currently enabled; a disabled keyword is disabled is not accepted as user input.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Clear
Removes all elements from the KeywordCollection class.

Autodesk.AutoCAD.EditorInput.KeywordCollection.CopyTo(Autodesk.AutoCAD.EditorInput.Keyword[],System.Int32)
Copies the KeywordCollection class or a portion of it to a one-dimensional array.
array:  Input the one-dimensional Array that is the destination of the elements copied from KeywordCollection. The array must have zero-based indexing.
index:  Input the zero-based index in array at which copying begins.

Autodesk.AutoCAD.EditorInput.KeywordCollection.GetDisplayString(System.Boolean)
Gets a string that represent the keywords in this collection as they should be displayed to the user.
showNoDefault:  Input true if the default values ought not be shown

Autodesk.AutoCAD.EditorInput.KeywordCollection.Count
Gets the number of elements actually contained in the KeywordCollection.

Autodesk.AutoCAD.EditorInput.KeywordCollection.IsReadOnly
Gets a value indicating whether the KeywordCollection is read-only.

Autodesk.AutoCAD.EditorInput.KeywordCollection.Default
The default keyword to be used when the user presses ENTER without any other input.