Autodesk.AutoCAD.PlottingServices.PlotConfigManager
This .NET class wraps the AcPlPlotConfigManager ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.SetCurrentConfig(System.String)
Attempts to load the specified device or device configuration file and make it the current device.
deviceName:  Input name of the device for which plotter configuration is requested.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.Devices
Returns a list of plot devices installed on the system.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.NamedPlotStyles
.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.ColorDependentPlotStyles
Accesses the ColorDependentPlotStyles property value.

Autodesk.AutoCAD.PlottingServices.PlotConfigManager.CurrentConfig
Returns the currently loaded plotting device through PlotConfig , or null if no device is currently loaded.