Autodesk.AutoCAD.Publishing.EPlotAttribute
This class is a container for EPlot attributes.

Autodesk.AutoCAD.Publishing.EPlotAttribute.#ctor
Default constructor.

Autodesk.AutoCAD.Publishing.EPlotAttribute.Ns
Returns the Ns property value.

Autodesk.AutoCAD.Publishing.EPlotAttribute.NsUrl
Returns the NsUrl property value.

Autodesk.AutoCAD.Publishing.EPlotAttribute.Name
Returns the Name property value.

Autodesk.AutoCAD.Publishing.EPlotAttribute.Value
Returns the Value property value.