Autodesk.AutoCAD.Runtime.CommandClassAttribute
This custom attribute class is used to mark a type as the application's command class.

Autodesk.AutoCAD.Runtime.CommandClassAttribute.Type
Returns the Type property value.