Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNodeCollection
This class contains a collection of Dwf3dNavigationTreeNode objects.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNodeCollection.Add(Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode)
Adds a node to this collection.
node:  Input node to be added to this collection

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNodeCollection.Remove(Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode)
Removes the object represented by value from this collection.
node:  Input node to be removed from this collection.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNodeCollection.Count
Returns the number of objects in this collection.