Autodesk.AutoCAD.PlottingServices.PlotProgress
This .NET class wraps the AcPlPlotProgress ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotProgress.Heartbeat
Called periodically by the plotting framework during PlotEngine.BeginGenerateGraphics() and PlotEngine.EndGenerateGraphics() to allow the plot progress dialog implementation to be responsive to user input messages while regenerating the drawing for the plot.

Autodesk.AutoCAD.PlottingServices.PlotProgress.IsPlotCancelled
Clients of the plot progress dialog (like the plot engine) call this function to decide whether to continue or stop the plot job.

Autodesk.AutoCAD.PlottingServices.PlotProgress.PlotCancelStatus
Clients of the plot progress dialog use this function to identify the cancel status of a plot job in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.LowerPlotProgressRange
Sets the lower limit of the plot progress range in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.UpperPlotProgressRange
Sets the upper limit of the plot progress range in a multi-sheet scenario.

Autodesk.AutoCAD.PlottingServices.PlotProgress.PlotProgressPos
Returns the current plot progress position, which typically falls within the plot progress range.

Autodesk.AutoCAD.PlottingServices.PlotProgress.IsSheetCancelled
Clients of the plot progress dialog (like the plot engine) call this function to decide whether to continue or stop plotting the current sheet.

Autodesk.AutoCAD.PlottingServices.PlotProgress.SheetCancelStatus
Clients of the plot progress dialog use this function to identify the cancel status of the sheet plot operation.

Autodesk.AutoCAD.PlottingServices.PlotProgress.LowerSheetProgressRange
Accesses the lower limit of the sheet progress range for a sheet to be plotted.

Autodesk.AutoCAD.PlottingServices.PlotProgress.UpperSheetProgressRange
Sets the upper limit of the sheet progress range for a sheet to be plotted.

Autodesk.AutoCAD.PlottingServices.PlotProgress.SheetProgressPos
Returns the current sheet progress position, which typically falls within the sheet progress range.

Autodesk.AutoCAD.PlottingServices.PlotProgress.IsVisible
Returns true if the plot progress dialog is visible; otherwise, returns false.

Autodesk.AutoCAD.PlottingServices.PlotProgress.StatusMsgString
The plotting pipeline uses this method to return the status string of the sheet currently being plotted.