Autodesk.AutoCAD.Runtime.Converter
This class converts angular and distance numerical values to string values, and vice versa.

Autodesk.AutoCAD.Runtime.Converter.DistanceToString(System.Double,Autodesk.AutoCAD.Runtime.DistanceUnitFormat,System.Int32)
Converts a distance to a string value using the given units and precision.
value:  Input value to convert
units:  Input units to convert in
precision:  Input precision

Autodesk.AutoCAD.Runtime.Converter.DistanceToString(System.Double)
Calls the Converter.DistanceToString(Double value, DistanceUnitFormat units, Int32 precision) method using the current value of the LUPREC system variable, with a precision of -1.
value:  Input value to convert

Autodesk.AutoCAD.Runtime.Converter.StringToDistance(System.String,Autodesk.AutoCAD.Runtime.DistanceUnitFormat)
Converts a string to a distance value.
value:  Input value to convert
units:  Input conversion units

Autodesk.AutoCAD.Runtime.Converter.StringToDistance(System.String)
Calls the Converter.StringToDistance(String value, DistanceUnitFormat units) method using the current DistanceUnitFormat for units.
value:  Input value to convert

Autodesk.AutoCAD.Runtime.Converter.AngleToString(System.Double,Autodesk.AutoCAD.Runtime.AngularUnitFormat,System.Int32)
Converts an angle to a string using the given units and precision.
value:  Input value to convert
units:  Input units to convert in
precision:  Input precision

Autodesk.AutoCAD.Runtime.Converter.AngleToString(System.Double)
Calls the Converter.AngleToString(Double value, AngularUnitFormat units, Int32 precision) method using the current angular units format for units and the current value of the AUPREC system variable for precision.
value:  Input value to convert

Autodesk.AutoCAD.Runtime.Converter.StringToAngle(System.String,Autodesk.AutoCAD.Runtime.AngularUnitFormat)
Converts a string to an angle using the current units.
value:  Input value to convert
units:  Input units to convert in

Autodesk.AutoCAD.Runtime.Converter.StringToAngle(System.String)
Calls the Converter.StringToAngle(String value, AngularUnitFormat units) using the current angular units format for units.
value:  Input value to convert

Autodesk.AutoCAD.Runtime.Converter.RawAngleToString(System.Double,Autodesk.AutoCAD.Runtime.AngularUnitFormat,System.Int32)
Converts a raw angle to a string using the given units and precision.
value:  Input value to convert
units:  Input units to convert in
precision:  Input precision

Autodesk.AutoCAD.Runtime.Converter.RawAngleToString(System.Double)
Calls the Converter.RawAngleToString(Double value, AngularUnitFormat units, Int32 precision) method using the current angular units format for units.
value:  Input value to convert

Autodesk.AutoCAD.Runtime.Converter.StringToRawAngle(System.String,Autodesk.AutoCAD.Runtime.AngularUnitFormat)
Converts a string to a raw angle using the current units.
value:  Input value to convert
units:  Input units to convert in

Autodesk.AutoCAD.Runtime.Converter.StringToRawAngle(System.String)
Calls the Converter.StringToRawAngle(String value, AngularUnitFormat units) using the current angular units format for units.
value:  Input value to convert