Autodesk.AutoCAD.ApplicationServices.IConfigurationSection
This interface can be implemented to create, store, and manage application configuration data in whatever format the application requires.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.CreateSubsection(System.String)
Creates a configuration subsection named name.
name:  Input new subsection name.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.OpenSubsection(System.String)
This method should be implemented to open the configuration subsection named name.
name:  Input the subsection name to open.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.ContainsSubsection(System.String)
This method should be implemented to verify whether the configuration section contains a subsection named name.
name:  Input subsection to search for.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.DeleteSubsection(System.String)
This method should be implemented to delete the configuration subsection named name.
name:  Input the name of the subsection to delete.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.ReadProperty(System.String,System.Object)
This method should be implemented to return the value of a property named name.
name:  Input the name to read
defaultValue:  Input default value to return

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.WriteProperty(System.String,System.Object)
This method should be implemented to assign the value value to the property named name.
name:  Input the name to read
value:  Input default value to return

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.Contains(System.String)
Returns a value indicating whether the collection contains an object that matches name.
name:  Input name to search for.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.Delete(System.String)
This method should be implemented to delete the value named name in the configuration section.
name:  Input name of item to delete.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.Close
This method should be implemented to close the configuration section.

Autodesk.AutoCAD.ApplicationServices.IConfigurationSection.IsReadOnly
Assesses whether the object is read-only.