Autodesk.AutoCAD.EditorInput.PromptSelectionOptions
This class provides optional parameters to a selection set prompt.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.#ctor
Constructor.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SetKeywords(System.String,System.String)
This method sets the display keywords to keywords and the global keywords to globalKeywords.
keywords:  Input keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.AddKeywordsToMinimalList(Autodesk.AutoCAD.EditorInput.AddedKeywords)
This function adds the keywords specified by kwds to the base keyword list of "Add/Remove/Undo/Single".
kwds:  bitwise combination of AddedKeywords enum values

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.RemoveKeywordsFromFullList(Autodesk.AutoCAD.EditorInput.SubtractedKeywords)
This function removes the keywords specified by kwds from the full keyword list of "Window/Last/Crossing/BOX/ALL/Fence/WPolygon/CPolygon/Group/Add/Remove/Multiple/Previous/Undo/AUto/Single".
kwds:  bitwise combination of SubtractedKeywords enum values

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.UnknownInput
Occurs when the user types arbitrary input in response to a selection prompt.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.KeywordInput
Occurs when the user types a keyword in response to a selection prompt.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.MessageForAdding
Sets the :$ mode of acedSSGet.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.MessageForRemoval
Sets the :$ mode.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SinglePickInSpace
Sets the :A mode of acedSSGet.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.AllowDuplicates
Sets the :D mode of acedSSGet.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SelectEverythingInAperture
Sets the :E mode of acedSSGet.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.Keywords
Sets the :K mode of acedSSGet.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.PrepareOptionalDetails
Sets the :N mode of acedSSGet.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.SingleOnly
Sets the :S mode of acedSSGet.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.AllowSubSelections
Returns true of subselections are allowed in prompt.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.ForceSubSelections
True if subselection is forced to occur when selecting prompt options.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.RejectObjectsOnLockedLayers
Returns the RejectObjectsOnLockedLayers property value.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.RejectObjectsFromNonCurrentSpace
Returns the RejectObjectsFromNonCurrentSpace property value.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptions.RejectPaperspaceViewport
Returns the RejectPaperspaceViewport property value.