Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs
This class encapsulates the plot-specific information required by the BeginDocument event.

Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.PlotInfo
Returns the PlotInfo property value.

Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.DocumentName
Returns the DocumentName property value.

Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.PlotToFile
Returns the PlotToFile property value.

Autodesk.AutoCAD.PlottingServices.BeginDocumentEventArgs.FileName
Returns the FileName property value.