Autodesk.AutoCAD.EditorInput.PromptKeywordOptionsEventArgs
This class provides data for the PromptingForKeyword> event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptKeywordOptionsEventArgs.Options
Gets the input parameters of the prompt.