Autodesk.AutoCAD.EditorInput.Editor
This .NET class wraps the AcEditor ObjectARX class.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForEntity
This function provides notification for the start of an AutoCAD entity selection operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForEntity
This function provides notification for the end of an AutoCAD entity selection operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForNestedEntity
This function provides notification for the start of an AutoCAD nentsel acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForNestedEntity
This function provides notification for the end of an AutoCAD nentsel acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.EnteringQuiescentState
Occurs when the user enters a quiescent state.

Autodesk.AutoCAD.EditorInput.Editor.LeavingQuiescentState
This event provides notification for the end of an AutoCAD quiescent state.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForSelection
This function provides notification for the start of an AutoCAD selection set acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.SelectionAdded
This callback provides notification of a subselection.

Autodesk.AutoCAD.EditorInput.Editor.Rollover
This function provides notification for rollovers.

Autodesk.AutoCAD.EditorInput.Editor.SelectionRemoved
This callback provides notification of the removal of some entities from the selection set.

Autodesk.AutoCAD.EditorInput.Editor.PromptForSelectionEnding
This function provides notification for the end of an AutoCAD selection set acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForSelection
This function provides notification for the end of an AutoCAD selection set acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptForEntityEnding
This function provides notification for the end of an AutoCAD entity selection operation.

Autodesk.AutoCAD.EditorInput.Editor.Dragging
Occurs when a dragging operation is performed in a drawing.

Autodesk.AutoCAD.EditorInput.Editor.DraggingEnded
Occurs when the user ends the dragging operation.

Autodesk.AutoCAD.EditorInput.Editor.PointToScreen(Autodesk.AutoCAD.Geometry.Point3d,System.Int32)
Returns the 3D point pt on the screen with the viewport number.
pt:  Input point to grab
viewportNumber:  Input the point's viewport number

Autodesk.AutoCAD.EditorInput.Editor.WriteMessage(System.String)
Displays a message on the AutoCAD text screen.
message:  Input messsage

Autodesk.AutoCAD.EditorInput.Editor.GetSelection(Autodesk.AutoCAD.EditorInput.PromptSelectionOptions,Autodesk.AutoCAD.EditorInput.SelectionFilter)
This method gets a selection set using the supplied prompt selection options and the supplied filter.
options:  Input selection options
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.GetSelection(Autodesk.AutoCAD.EditorInput.PromptSelectionOptions)
This method gets a selection set using the supplied prompt selection options and no filter.
options:  Input selection options

Autodesk.AutoCAD.EditorInput.Editor.GetSelection(Autodesk.AutoCAD.EditorInput.SelectionFilter)
Returns the selection set obtained using the filter.
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.GetSelection
Returns the selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectAll(Autodesk.AutoCAD.EditorInput.SelectionFilter)
Returns the selection set obtained using the filter.
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.SelectAll
Returns the selection set obtained.

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Returns the selection set obtained using the filter.
pt1:  Input first corner of selection window
pt2:  Input opposite corner of selection window
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns the selection set obtained.
pt1:  Input first corner of selection window
pt2:  Input opposite corner of selection window

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Returns the selection set obtained using the filter.
polygon:  Input collection of points that represent vertices of the polygon.
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.SelectCrossingPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
Returns the selection set obtained.
polygon:  Input collection of points that represent vertices of the polygon.

Autodesk.AutoCAD.EditorInput.Editor.SelectFence(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Returns the selection set obtained using the filter.
fence:  Input collection of points that represent vertices of the fence.
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.SelectFence(Autodesk.AutoCAD.Geometry.Point3dCollection)
Returns the selection set obtained.
fence:  Input collection of points that represent vertices of the fence.

Autodesk.AutoCAD.EditorInput.Editor.SelectWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Returns the selection set obtained using the filter.
pt1:  Input first corner of selection window
pt2:  Input opposite corner of selection window
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.SelectWindow(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns the selection set obtained.
pt1:  Input first corner of selection window.
pt2:  Input opposite corner of selection window.

Autodesk.AutoCAD.EditorInput.Editor.SelectWindowPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection,Autodesk.AutoCAD.EditorInput.SelectionFilter)
Returns the selection set obtained using the filter.
polygon:  Input collection of points that represent vertices of the polygon.
filter:  Input selection filter

Autodesk.AutoCAD.EditorInput.Editor.SelectWindowPolygon(Autodesk.AutoCAD.Geometry.Point3dCollection)
Returns the selection set obtained.
polygon:  Input collection of points that represent vertices of the polygon.

Autodesk.AutoCAD.EditorInput.Editor.SelectLast
Selects last result from the prompt.

Autodesk.AutoCAD.EditorInput.Editor.SelectPrevious
Selects previous result from the prompt.

Autodesk.AutoCAD.EditorInput.Editor.InitCommandVersion(System.Int32)
This function sets a variable in the current document establishing the version requested for the next command to be run.
nVersion:  The new version variable to set

Autodesk.AutoCAD.EditorInput.Editor.GetCommandVersion
This function is used to query the requested version of the command in progress in the current document.

Autodesk.AutoCAD.EditorInput.Editor.DoPrompt(Autodesk.AutoCAD.EditorInput.PromptOptions)
Carries out a prompt with the specified options.
opt:  Input options for the prompt

Autodesk.AutoCAD.EditorInput.Editor.GetInteger(Autodesk.AutoCAD.EditorInput.PromptIntegerOptions)
Gets user input for an integer.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetInteger(System.String)
Gets user input for an integer.
message:  Input message to be displayed to the user during the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetDouble(Autodesk.AutoCAD.EditorInput.PromptDoubleOptions)
Gets user input for a real value.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetDouble(System.String)
Returns a PromptDoubleResult object representing the result of the prompt operation.
message:  Input message to be displayed to the user during the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetDistance(Autodesk.AutoCAD.EditorInput.PromptDistanceOptions)
Gets user input for a linear distance.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetDistance(System.String)
Returns a PromptDoubleResult object representing the result of the prompt operation.
message:  Input message to be displayed to the user during the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetAngle(Autodesk.AutoCAD.EditorInput.PromptAngleOptions)
Gets user input for an angle, taking into account the current value of the ANGBASE system variable.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetAngle(System.String)
Gets user input for an angle, taking into account the current value of the ANGBASE system variable.
message:  Input message to be displayed to the user during the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetPoint(Autodesk.AutoCAD.EditorInput.PromptPointOptions)
Gets user input for a point.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetPoint(System.String)
Gets user input for a point.
message:  Input message to be displayed to the user during the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetCorner(Autodesk.AutoCAD.EditorInput.PromptCornerOptions)
Gets user input for the corner of a rectangle.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetCorner(System.String,Autodesk.AutoCAD.Geometry.Point3d)
Returns a PromptPointResult object representing the result of the prompt operation.
message:  Input message to be displayed to the user during the prompt.
basePoint:  Input the first corner of the rectangle being selected.

Autodesk.AutoCAD.EditorInput.Editor.GetKeywords(Autodesk.AutoCAD.EditorInput.PromptKeywordOptions)
Wraps the acedGetKword() ObjectARX function.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetString(Autodesk.AutoCAD.EditorInput.PromptStringOptions)
Gets user input for a string.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetString(System.String)
Returns the PromptResult object representing the result of the prompt operation.
message:  Input message to be displayed to the user during the prompt

Autodesk.AutoCAD.EditorInput.Editor.GetEntity(Autodesk.AutoCAD.EditorInput.PromptEntityOptions)
Prompts the user to select an entity by specifying a point.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetEntity(System.String)
Prompts the user to select an entity by specifying a point.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.Editor.GetNestedEntity(Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions)
Gets the name of an entity selected by the user and the point used to select the entity.
options:  Input optional parameters of the prompt.

Autodesk.AutoCAD.EditorInput.Editor.GetNestedEntity(System.String)
Gets the name of an entity selected by the user and the point used to select the entity.
message:  Input message to be displayed to the user during the prompt

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForOpen(Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions)
This method emulates the subtleties of AutoCAD file prompting.
options:  Input file opening options

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForOpen(System.String)
This method emulates the subtleties of AutoCAD file prompting.
message:  Input prompt string

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForSave(Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions)
This method emulates the subtleties of AutoCAD file prompting.
options:  Input file saving options

Autodesk.AutoCAD.EditorInput.Editor.GetFileNameForSave(System.String)
This method emulates the subtleties of AutoCAD file prompting.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.Editor.Drag(Autodesk.AutoCAD.EditorInput.PromptDragOptions)
Prompts the user to modify a selection set by graphically dragging its entities.
options:  Input dragging options

Autodesk.AutoCAD.EditorInput.Editor.Drag(Autodesk.AutoCAD.EditorInput.SelectionSet,System.String,Autodesk.AutoCAD.EditorInput.DragCallback)
Prompts the user to modify a selection set by graphically dragging its entities.
selection:  Input the selection set
message:  Input the prompt message
callback:  Input any drag callbacks

Autodesk.AutoCAD.EditorInput.Editor.Drag(Autodesk.AutoCAD.EditorInput.Jig)
Starts a Jig operation.
jig:  Input the jig to drag

Autodesk.AutoCAD.EditorInput.Editor.UpdateScreen
Refreshes the screen.

Autodesk.AutoCAD.EditorInput.Editor.PostCommandPrompt
This function causes AutoCAD to repost the last command prompt message.

Autodesk.AutoCAD.EditorInput.Editor.UpdateTiledViewportsInDatabase
Updates the tiled viewports in the database.

Autodesk.AutoCAD.EditorInput.Editor.UpdateTiledViewportsFromDatabase
Updates the tiled viewports from the database.

Autodesk.AutoCAD.EditorInput.Editor.StartUserInteraction(System.IntPtr)
Returns a new EditorUserInteraction object.
modalForm:  Input control form

Autodesk.AutoCAD.EditorInput.Editor.TurnForcedPickOn
This function will cause the AutoCAD input event mechanism to do a pick under the prevailing pick aperture on all digitizer events, regardless of whether a point is being acquired or whether any OSNAP modes are currently active.

Autodesk.AutoCAD.EditorInput.Editor.TurnForcedPickOff
This function decrements the forced pick counter, and if the counter hits 0, disables forced picking, which means entity picking occurs under normal AutoCAD conditions, such as when input points are being acquired and an OSNAP mode is active, or normal entity selection operations.

Autodesk.AutoCAD.EditorInput.Editor.TurnSubentityWindowSelectionOn
Using this function increments a reference counter which, when non-zero, causes any form of a window selection (such as _W and _WP in acedSSGet()), coupled with a request of nested entity information (such as using the ":n" mode in acedSSGet()), to select the main entity if one or more of the main entity's subentities is fully contained within the window.

Autodesk.AutoCAD.EditorInput.Editor.TurnSubentityWindowSelectionOff
Using this function decrements a reference counter which, when zero, turns off subentity window selection.When subentity window selection is enabled, any form of a window selection (such as _W and _WP in acedSSGet()), coupled with a request of nested entity information (such as the ":n" mode in acedSSGet()), selects the main entity if one or more of the main entity's subentities is fully contained within the window.

Autodesk.AutoCAD.EditorInput.Editor.SwitchToModelSpace
Switches the current view to model space.

Autodesk.AutoCAD.EditorInput.Editor.SwitchToPaperSpace
Switches the current view to paper space.

Autodesk.AutoCAD.EditorInput.Editor.GetCurrentView
Gets the current view from ViewTableRecord.

Autodesk.AutoCAD.EditorInput.Editor.SetCurrentView(Autodesk.AutoCAD.DatabaseServices.ViewTableRecord)
Sets the current view of ViewTableRecord.
value:  Input new view table record value

Autodesk.AutoCAD.EditorInput.Editor.DrawVectors(Autodesk.AutoCAD.DatabaseServices.ResultBuffer,Autodesk.AutoCAD.Geometry.Matrix3d)
Draws a set of vectors that are transformed by the given matrix.
rb:  Input result buffer containing vectors
transform:  Input transformation matrix

Autodesk.AutoCAD.EditorInput.Editor.DrawVector(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d,System.Int32,System.Boolean)
Draws a vector from a specified beginning and ending points. Its color and highlight values may also be chosen.
from:  Input beginning point
to:  Input ending point
color:  Input color of vector
drawHighlighted:  Input Boolean value indicated of the vector ought to be highlighted

Autodesk.AutoCAD.EditorInput.Editor.Regen
Regenerates the drawing.

Autodesk.AutoCAD.EditorInput.Editor.Snap(System.String,Autodesk.AutoCAD.Geometry.Point3d)
Changes the snap mode for the point at input.
snapMode:  Input new snap mode
input:  Input point to place snap mode

Autodesk.AutoCAD.EditorInput.Editor.ViewportIdFromNumber(System.Int32)
Returns the object ID of the viewport from its number.
viewportNumber:  Input viewport number

Autodesk.AutoCAD.EditorInput.Editor.TraceBoundary(Autodesk.AutoCAD.Geometry.Point3d,System.Boolean)
Returns the resulting boundary set in a DBObjectCollection.
seedPoint:  The seed point, in UCS, for the boundary trace.
detectIslands:  A boolean indicating whether or not to detect islands.

Autodesk.AutoCAD.EditorInput.Editor.ApplyCurDwgLayerTableChanges
Updates the cached layer data for the current document in the editor.

Autodesk.AutoCAD.EditorInput.Editor.PointFilter
Occurs when the mouse is moved within the AutoCAD editor window.

Autodesk.AutoCAD.EditorInput.Editor.PointMonitor
Occurs when the mouse is moved within the AutoCAD editor window.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForPoint
This function provides notification for the start of an AutoCAD point acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForPoint
This function provides notification for the end of an AutoCAD point acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForAngle
This function provides notification for the start of an AutoCAD angle acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForAngle
This function provides notification for the end of an AutoCAD angle acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForDistance
This function provides notification for the start of an AutoCAD distance acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForDistance
This function provides notification for the end of an AutoCAD distance acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForCorner
This function provides notification for the start of an AutoCAD corner acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForCorner
This function provides notification for the end of an AutoCAD corner acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForString
This function provides notification for the start of an AutoCAD string acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForString
This function provides notification for the end of an AutoCAD string acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForKeyword
This function provides notification for the start of an AutoCAD keyword acquisition.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForKeyword
This function provides notification for the end of an AutoCAD key word acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForInteger
This function provides notification for the start of an AutoCAD integer acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptedForInteger
This function provides notification for the end of an AutoCAD integer acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.PromptingForDouble
This function provides notification for the start of an AutoCAD floating point acquisition operation.

Autodesk.AutoCAD.EditorInput.Editor.Document
The document that this editor belongs to.

Autodesk.AutoCAD.EditorInput.Editor.ActiveViewportId
Accesses the active viewport ID.

Autodesk.AutoCAD.EditorInput.Editor.CurrentViewportObjectId
Returns the object id of current viewport.

Autodesk.AutoCAD.EditorInput.Editor.IsQuiescent
Returns the isQuiescent property value.

Autodesk.AutoCAD.EditorInput.Editor.IsQuiescentForTransparentCommand
Assesses if the editor is ready for transparent commands.

Autodesk.AutoCAD.EditorInput.Editor.IsDragging
Assesses if the screen is dragging.

Autodesk.AutoCAD.EditorInput.Editor.UseCommandLineInterface
Returns UseCommandLineInterface property value.

Autodesk.AutoCAD.EditorInput.Editor.CurrentUserCoordinateSystem
Returns the current user coordinate system points.

Autodesk.AutoCAD.EditorInput.Editor.MouseHasMoved
This property provides a way for input point monitors and filters to check for mouse movement and be able to return as quickly as possible from the callbacks without doing any time-consuming calculations.