Autodesk.AutoCAD.EditorInput.PromptPointOptions
This class represents optional parameters for a prompt for point.

Autodesk.AutoCAD.EditorInput.PromptPointOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptPointOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptPointOptions.UseBasePoint
Gets or sets whether the base point is to be used.