Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions
This class contains file dialog configuration options that are passed to the Editor.GetFileNameForSave() method.

Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions.DeriveInitialFilenameFromDrawingName
Accesses if the derivation of the initial filename is is from the drawing name.

Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions.ForceOverwriteWarningForScriptsAndLisp
Accesses if the overwrite warning prompt ought to be displayed, even when the command is run from LISP or a script.

Autodesk.AutoCAD.EditorInput.PromptSaveFileOptions.DisplaySaveOptionsMenuItem
Assesses if the save options ought to be displayed from a menu item.