Autodesk.AutoCAD.PlottingServices.BeginPlotEventArgs
This class encapsulates the plot-specific information required by the BeginPlot event.

Autodesk.AutoCAD.PlottingServices.BeginPlotEventArgs.PlotProgress
Returns the PlotProgress property value.

Autodesk.AutoCAD.PlottingServices.BeginPlotEventArgs.PlotType
Returns the PlotType property value.