Autodesk.AutoCAD.ApplicationServices.LayoutSwitchingEventArgs
This is class Autodesk.AutoCAD.ApplicationServices.LayoutSwitchingEventArgs.

Autodesk.AutoCAD.ApplicationServices.LayoutSwitchingEventArgs.OldLayout
This is OldLayout, a member of class LayoutSwitchingEventArgs.

Autodesk.AutoCAD.ApplicationServices.LayoutSwitchingEventArgs.NewLayout
This is NewLayout, a member of class LayoutSwitchingEventArgs.