Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs
This class provides data for the AboutToBeginBackgroundPublishing event.

Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs.ReadPrivateSection(System.String)
Reads the private section.
sectionName:  Input name to read

Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs.DsdData
Returns the DsdData property value.

Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs.JobWillPublishInBackground
Returns the JobWillPublishInBackground property value.