Autodesk.AutoCAD.EditorInput.Keyword
This class represents a keyword in a prompt.

Autodesk.AutoCAD.EditorInput.Keyword.IsReadOnly
Gets a value indicating whether the Keyword is read-only.

Autodesk.AutoCAD.EditorInput.Keyword.LocalName
Gets or sets the global name of the keyword.

Autodesk.AutoCAD.EditorInput.Keyword.GlobalName
Gets or sets the global name of the keyword.

Autodesk.AutoCAD.EditorInput.Keyword.DisplayName
Gets or sets the display name of the keyword.

Autodesk.AutoCAD.EditorInput.Keyword.Visible
Gets or sets whether the keyword should be shown to the user.

Autodesk.AutoCAD.EditorInput.Keyword.Enabled
Gets or sets whether the keyword is currently enabled.