Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities
This is class Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities, which provides utility functions to manipulate cursor badges.

Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities.AddSupplementalCursorImage(Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32,System.Int32)
Adds a supplemental cursor image.
cursorImage:  Input image
priority:  Stacking order badge should appear in. Higher numbers win.

Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities.RemoveSupplementalCursorImage(Autodesk.AutoCAD.GraphicsInterface.ImageBGRA32)
Removes a previously added supplemental cursor badge.
cursorImage:  Input image

Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities.HasSupplementalCursorImage
Checks if the current supplemental cursor badge is set.

Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities.SetSupplementalCursorOffset(System.Int32,System.Int32)
Sets x, y to be the cursor offset to the top right corner of the pickbox.
y:  Input Y offset

Autodesk.AutoCAD.EditorInput.CursorBadgeUtilities.GetSupplementalCursorOffset(System.Int32&,System.Int32&)
Gets the cursor offset x, y, which is to the top right corner of the pickbox.