Autodesk.AutoCAD.PlottingServices.PreviewEndPlotInfo
This .NET class wraps the ACPL_PREVIEWENDPLOT ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotInfo.#ctor
Description
Default constructor.

Autodesk.AutoCAD.PlottingServices.PreviewEndPlotInfo.Status
Returns the Status property value.