Autodesk.AutoCAD.ApplicationServices.Core.Application
This is class Autodesk.AutoCAD.ApplicationServices.Core.Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.Quit
Quits the application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.SetSystemVariable(System.String,System.Object)
Sets the system variable.
name:  Input the name of the variable to set
value:  Input the new value

Autodesk.AutoCAD.ApplicationServices.Core.Application.GetSystemVariable(System.String)
Returns the system variable.
name:  Input the name of the system variable to get.

Autodesk.AutoCAD.ApplicationServices.Core.Application.TryGetSystemVariable(System.String)
This is TryGetSystemVariable, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.EvaluateDiesel(System.String)
This is EvaluateDiesel, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowAlertDialog(System.String)
Shows the alert dialog with the specified message.
message:  Input string object.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModalWindow(System.Windows.Window)
This is ShowModalWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModalWindow(System.Windows.Window,System.Windows.Window)
This is ShowModalWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModalWindow(System.IntPtr,System.Windows.Window)
This is ShowModalWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModalWindow(System.Windows.Window,System.Windows.Window,System.Boolean)
This is ShowModalWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModalWindow(System.IntPtr,System.Windows.Window,System.Boolean)
This is ShowModalWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModelessWindow(System.Windows.Window)
This is ShowModelessWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModelessWindow(System.Windows.Window,System.Windows.Window)
This is ShowModelessWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModelessWindow(System.IntPtr,System.Windows.Window)
This is ShowModelessWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModelessWindow(System.Windows.Window,System.Windows.Window,System.Boolean)
This is ShowModelessWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.ShowModelessWindow(System.IntPtr,System.Windows.Window,System.Boolean)
This is ShowModelessWindow, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.LoadJSScript(System.Uri)
Use this function to load and execute JavaScript without a palette.
urlJSFile:  URI of the JavaScript file to be loaded and executed

Autodesk.AutoCAD.ApplicationServices.Core.Application.UpdateScreen
Refreshes the screen.

Autodesk.AutoCAD.ApplicationServices.Core.Application.IsFileLocked(System.String)
This is IsFileLocked, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.GetWhoHasInfo(System.String)
Obtains information on who has a file open for editing by AutoCAD.
pathname:  Input a fully qualified path and file name to a drawing file

Autodesk.AutoCAD.ApplicationServices.Core.Application.Invoke(Autodesk.AutoCAD.DatabaseServices.ResultBuffer)
This .NET method wraps the ObjectARX function acedInvoke().

Autodesk.AutoCAD.ApplicationServices.Core.Application.BeginCloseAll
Wraps the AcEditorReactor::beginCloseAll() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.BeginQuit
Wraps the AcEditorReactor::beginQuit() ObjectARX function, which is called when AutoCAD starts to shutdown.

Autodesk.AutoCAD.ApplicationServices.Core.Application.QuitAborted
Wraps the AcEditorReactor.quitAborted() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.QuitWillStart
Wraps the AcEditorReactor.quitWillStart() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.SystemVariableChanging
Wraps the AcEditorReactor.sysVarWillChange() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.SystemVariableChanged
Wraps the AcEditorReactor.sysVarChanged() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.BeginDoubleClick
Wraps the AcEditorReactor::beginDoubleClick() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Core.Application.Idle
This event is fired when the application goes idle.

Autodesk.AutoCAD.ApplicationServices.Core.Application.PreTranslateMessage
Occurs before a message is translated.

Autodesk.AutoCAD.ApplicationServices.Core.Application.DocumentManager
Accesses the DocumentManager object.

Autodesk.AutoCAD.ApplicationServices.Core.Application.MainWindow
Accesses the main window.

Autodesk.AutoCAD.ApplicationServices.Core.Application.IsQuiescent
Assesses if there is a command, LISP script, or ARX command active.

Autodesk.AutoCAD.ApplicationServices.Core.Application.HasPickFirst
This is HasPickFirst, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Core.Application.IsInPlaceServer
Accesses the IsInPlaceServer property.

Autodesk.AutoCAD.ApplicationServices.Core.Application.IsInBackgroundMode
Accesses the IsInBackgroundMode property.

Autodesk.AutoCAD.ApplicationServices.Core.Application.Version
Accesses the version of the currently running instance.

Autodesk.AutoCAD.ApplicationServices.Core.Application.UserConfigurationManager
Accesses the user configuration manager.

Autodesk.AutoCAD.ApplicationServices.Core.Application.Publisher
Accesses the publisher.

Autodesk.AutoCAD.ApplicationServices.Core.Application.LongTransactionManager
Accesses the LongTransactionManager object.