Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions
This class contains file dialog configuration options that are passed to the Editor.GetFileNameForOpen()> method.

Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions.SearchPath
Gets or sets whether the prompt allows search path.

Autodesk.AutoCAD.EditorInput.PromptOpenFileOptions.TransferRemoteFiles
Gets or sets whether the prompt allows transfer of remote files.