Autodesk.AutoCAD.EditorInput.PromptDoubleResultEventArgs
This class provides data for the PromptedForDouble> event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptDoubleResultEventArgs.Result
Gets the result of the selection.