Autodesk.AutoCAD.EditorInput.PromptPointOptionsEventArgs
This class provides data for the PromptingForPoint event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptPointOptionsEventArgs.Options
Gets the input parameters of the prompt.