Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs
This class provides data for the SelectionRemoved event of the Editor class.

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.Remove(System.Int32)
Removes the object at the specified index from the selection.
index:  Input index of object to remove

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.RemoveSubentity(System.Int32,System.Int32)
Removes the subentity at subentityIndex, in the entity at the specified index, from this selection.
index:  Input index of object to remove
subentityIndex:  Input subentity index

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.Flags
Gets the flags that provide further details about the selection in progress.

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.Selection
Gets the objects currently selected.

Autodesk.AutoCAD.EditorInput.SelectionRemovedEventArgs.RemovedObjects
The objects removed from the selection set.