Autodesk.AutoCAD.PlottingServices.DsdEntry
This .NET class wraps the AcPlDSDEntry ObjectARX class.

Autodesk.AutoCAD.PlottingServices.DsdEntry.#ctor
Default constructor.

Autodesk.AutoCAD.PlottingServices.DsdEntry.Copy
Description.

Autodesk.AutoCAD.PlottingServices.DsdEntry.DwgName
Returns the name of the DWG file that holds the sheet to be published.

Autodesk.AutoCAD.PlottingServices.DsdEntry.Layout
Returns the name of the layout in the DWG file returned by a call to dwgName().

Autodesk.AutoCAD.PlottingServices.DsdEntry.Title
Returns the title of the DSD entry.

Autodesk.AutoCAD.PlottingServices.DsdEntry.Nps
Returns the named page setup string.

Autodesk.AutoCAD.PlottingServices.DsdEntry.NpsSourceDwg
Returns the path for the drawing file that contains the named page setup, which is identified by what the NPS() method Returns.

Autodesk.AutoCAD.PlottingServices.DsdEntry.OriginalSheetPath
Path of the original sheet to be published.