Autodesk.AutoCAD.ApplicationServices.DocumentActivationChangedEventArgs
This class provides data for the DocumentActivationChanged event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentActivationChangedEventArgs.NewValue
Assesses if the document is activated.