Autodesk.AutoCAD.EditorInput.PromptEntityResultEventArgs
This class provides data for the PromptedForEntity event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptEntityResultEventArgs.Result
Gets the result of the selection.