Autodesk.AutoCAD.PlottingServices.EndPageEventArgs
This class encapsulates the plot-specific information required by the EndPage event.

Autodesk.AutoCAD.PlottingServices.EndPageEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.SheetCancelStatus)
Constructs a new object with the given status.
status:  Input status of document

Autodesk.AutoCAD.PlottingServices.EndPageEventArgs.Status
Accesses the Status property value.