Autodesk.AutoCAD.EditorInput.PromptOptions
This is the base class for types that represent optional parameters for prompts.

Autodesk.AutoCAD.EditorInput.PromptOptions.SetMessageAndKeywords(System.String,System.String)
This method sets the prompt message to the first part of the messageAndKeywords string and sets the display keywords to the latter part of the same string.
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptOptions.IsReadOnly
Gets whether the PromptOptions is read-only.

Autodesk.AutoCAD.EditorInput.PromptOptions.Message
Gets or sets the prompt message to be displayed by the prompt.

Autodesk.AutoCAD.EditorInput.PromptOptions.AppendKeywordsToMessage
Returns the AppendKeywordsToMessage property value.

Autodesk.AutoCAD.EditorInput.PromptOptions.Keywords
Gets the collection of keywords that the prompt understands and displays.