Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs
This class provides data for the BeginAggregation event.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.AddGlobalPropertyRange(Autodesk.AutoCAD.Publishing.EPlotProperty[])
Adds a global property range.
properties:  Input property to add

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.AddGlobalResourceRange(Autodesk.AutoCAD.Publishing.EPlotResource[])
Adds a global resource range.
resources:  Input resource to add

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.PlotLogger
Returns the PlotLogger property value.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.DwfFileName
Returns the DwfFileName property value.

Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs.DwfPassword
Returns the DwfPassword property value.