Autodesk.AutoCAD.Runtime.FileExistsConditionAttribute
This class defines a custom attribute that marks an assembly if the file exists.

Autodesk.AutoCAD.Runtime.FileExistsConditionAttribute.#ctor(System.String)
Constructs an object associated with the given file.
fileName:  Input file name.

Autodesk.AutoCAD.Runtime.FileExistsConditionAttribute.Evaluate
Implement this function to evaluate file exist condition.