Autodesk.AutoCAD.EditorInput.SelectedSubObject
This is the base for classes that describe subobjects selected through various techniques.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr)
Constructor.
path:  Input object path
method:  Input selection method
gsMarker:  Input GS marker

Autodesk.AutoCAD.EditorInput.SelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64)
Obsolete - Use the constructor overload taking IntPtr instead.
path:  Input object path
method:  Input selection method
gsMarker:  Input GS marker

Autodesk.AutoCAD.EditorInput.SelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.SelectedSubObject.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.FullSubentityPath
Returns the full subentity path of the selected sub object.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.SelectionMethod
Returns the selection method to select the sub object.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.OptionalDetails
Returns the optional details of the selected sub object.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.GraphicsSystemMarker
Obsolete - Use the GraphicsSystemMarkerPtr property instead.

Autodesk.AutoCAD.EditorInput.SelectedSubObject.GraphicsSystemMarkerPtr
Returns the GS Marker of the selected sub object.