Autodesk.AutoCAD.EditorInput.PointFilterResult
This class provides output data for the PointFilter event.

Autodesk.AutoCAD.EditorInput.PointFilterResult.Retry
Returns a Boolean indicating whether to force the user to try again.

Autodesk.AutoCAD.EditorInput.PointFilterResult.NewPoint
Returns the new point if changedPoint is true.

Autodesk.AutoCAD.EditorInput.PointFilterResult.DisplayObjectSnapGlyph
If true, AutoCAD will display the osnap glyph, even in the case the computed point has been changed by the application.

Autodesk.AutoCAD.EditorInput.PointFilterResult.ToolTipText
Returns the tool tip string.