Autodesk.AutoCAD.EditorInput.PromptStringResultEventArgs
This class provides data for the PromptedForString event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptStringResultEventArgs.Result
Gets the result of the selection.