Autodesk.AutoCAD.EditorInput.JigPromptStringOptions
This class provides a container for command line options that can be passed to the JigPrompts.AcquireString()> method.

Autodesk.AutoCAD.EditorInput.JigPromptStringOptions.#ctor(System.String,System.String)
Constructor.

Autodesk.AutoCAD.EditorInput.JigPromptStringOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPromptStringOptions.#ctor
Constructor.

Autodesk.AutoCAD.EditorInput.JigPromptStringOptions.DefaultValue
Returns the default value to be used for string option prompt.