Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs
This class provides data for the AboutToBeginPublishing event.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.ReadPrivateSection(System.String)
Reads the private section.
sectionName:  Input name to read

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.DsdData
Assesses the DsdData property value.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.JobWillPublishInBackground
Returns the JobWillPublishInBackground property value.

Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs.PlotLogger
Assesses the PlotLogger property value.