Autodesk.AutoCAD.PlottingServices.PlotInfoValidator
This .NET class wraps the AcPlPlotInfoValidator ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.#ctor
Default constructor.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.Validate(Autodesk.AutoCAD.PlottingServices.PlotInfo)
The validator performs validation of the layout, plot settings overrides, and plot device overrides on an PlotInfo object.
info:  Input object to validate.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaMatchingPolicy
Returns the new media matching policy used by the validator for validating media sizes.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaGroupWeight
Returns the current media group weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.SheetMediaGroupWeight
Returns the current sheet media group weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaBoundsWeight
Returns the current media bounds weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.PrintableBoundsWeight
Returns the current printable bounds weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.DimensionalWeight
Returns the current dimensional weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.SheetDimensionalWeight
Returns the current sheet dimensional weight.

Autodesk.AutoCAD.PlottingServices.PlotInfoValidator.MediaMatchingThreshold
Returns the current media matching threshold, which is the maximum total of error values allowed when matching media sizes.