Autodesk.AutoCAD.ApplicationServices.UnknownCommandEventArgs
Provides data for the UnknownCommand event of the Document.

Autodesk.AutoCAD.ApplicationServices.UnknownCommandEventArgs.GlobalCommandName
Accesses the name of the command that raised this event.