Autodesk.AutoCAD.PlottingServices.PlotInfo
This .NET class wraps the AcPlPlotInfo ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotInfo.#ctor
Default constructor.

Autodesk.AutoCAD.PlottingServices.PlotInfo.IsCompatibleDocument(Autodesk.AutoCAD.PlottingServices.PlotInfo)
Returns true if the other plot info object is document compatible with this plot info object.
info:  Input object to be compared to this object for document compatibility.

Autodesk.AutoCAD.PlottingServices.PlotInfo.Layout
Returns the ObjectId of the layout represented by the plot info object.

Autodesk.AutoCAD.PlottingServices.PlotInfo.OverrideSettings
Returns the current plot settings override stored in the object; may be null if no overrides have been provided.

Autodesk.AutoCAD.PlottingServices.PlotInfo.DeviceOverride
Provides an PlotConfig object to use in place of other settings.

Autodesk.AutoCAD.PlottingServices.PlotInfo.ValidatedSettings
.

Autodesk.AutoCAD.PlottingServices.PlotInfo.ValidatedConfig
Accesses the PlotConfig that will be used if the info object is plotted.

Autodesk.AutoCAD.PlottingServices.PlotInfo.IsValidated
Returns true if the device has been validated.