Autodesk.AutoCAD.PlottingServices.DsdData
This .NET class wraps the AcPlDSDData ObjectARX class.

Autodesk.AutoCAD.PlottingServices.DsdData.#ctor
Default constructor.

Autodesk.AutoCAD.PlottingServices.DsdData.GetDsdEntryCollection
Gets the array of sheets configured for publishing, which is stored in the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.SetDsdEntryCollection(Autodesk.AutoCAD.PlottingServices.DsdEntryCollection)
Sets the array of sheets configured for publishing, which is stored in the DSD file.
entries:  Input array of sheet entries.

Autodesk.AutoCAD.PlottingServices.DsdData.SetUnrecognizedData(System.String,System.String)
When a DSD file is read, sections that are not understood are collected as "unrecognized" data.
sectionName:  Input customized section name.
sectionData:  Input customized section data.

Autodesk.AutoCAD.PlottingServices.DsdData.ReadDsd(System.String)
Reads a DSD file.
fileName:  Input path and file name of DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.WriteDsd(System.String)
Writes information to a DSD file.
fileName:  Input path and file name of DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.Copy
Copies sheet data from the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdData.ProjectPath
Returns the output folder name.

Autodesk.AutoCAD.PlottingServices.DsdData.DestinationName
Gives the output DWF file path.

Autodesk.AutoCAD.PlottingServices.DsdData.SheetType
Returns the sheet type field, which is stored in the DSD file and indicates whether the publish operation is configured for multi-sheet DWF plotting, for individual (per-sheet) DWF plotting, or for plotting to the original device configured in the sheet.

Autodesk.AutoCAD.PlottingServices.DsdData.Password
Returns the password or phrase used to protect the contents of the output DWF file.

Autodesk.AutoCAD.PlottingServices.DsdData.UnrecognizedDataSectionNames
Allows users of Data objects to store a collection of customized DSD sections and data.

Autodesk.AutoCAD.PlottingServices.DsdData.UnrecognizedDataSections
Allows users of Data objects to store a collection of customized DSD sections and data.

Autodesk.AutoCAD.PlottingServices.DsdData.MajorVersion
Returns the major version number of the DSD file (if one was already read using the readDSD() method).

Autodesk.AutoCAD.PlottingServices.DsdData.MinorVersion
Returns the minor version number of the DSD file (if one was already read using the readDSD() method).

Autodesk.AutoCAD.PlottingServices.DsdData.SheetSetName
Returns the sheet set name, which will be valid only if a sheet set is being published.

Autodesk.AutoCAD.PlottingServices.DsdData.NoOfCopies
Returns the quantity of each sheet or layout to be plotted.

Autodesk.AutoCAD.PlottingServices.DsdData.IsSheetSet
Returns a Boolean indicating whether the DSD data is sheet set information.

Autodesk.AutoCAD.PlottingServices.DsdData.IsHomogeneous
Returns a Boolean indicating whether all the sheets in the sheet set are homogenous (in other words, are plotting to similar devices).

Autodesk.AutoCAD.PlottingServices.DsdData.PlotStampOn
Returns a Boolean indicating whether plot stamping is on.

Autodesk.AutoCAD.PlottingServices.DsdData.SelectionSetName
Returns the name of a named selection set.

Autodesk.AutoCAD.PlottingServices.DsdData.CategoryName
Allows to group a publish job into individual categories.

Autodesk.AutoCAD.PlottingServices.DsdData.LogFilePath
Returns the path to the file to which the publish operation logs errors.

Autodesk.AutoCAD.PlottingServices.DsdData.Dwf3dOptions
Returns the 3D DWF options object.