Autodesk.AutoCAD.Runtime.IJavaScriptCallable
This is class Autodesk.AutoCAD.Runtime.IJavaScriptCallable.

Autodesk.AutoCAD.Runtime.IJavaScriptCallable.EntryPoint
This is EntryPoint, a member of class IJavaScriptCallable.