Autodesk.AutoCAD.GraphicsSystem.Manager
This .NET class wraps the AcGsManager ObjectARX class.

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADViewport(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord)
Similar to CreateAutoCADView() except that the Drawable added to the View corresponds to the specified ViewportTableRecord.
vp:  Input ViewportTableRecord

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADView(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,Autodesk.AutoCAD.GraphicsInterface.Drawable)
This function creates an View object.
drawable:  Input Drawable
kernel:  Graphics Kernel used to create the resource

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateAutoCADDevice(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,System.IntPtr)
Creates an Device object.
hwnd:  Input window handle.
kernel:  Graphics Kernel used to create the resource

Autodesk.AutoCAD.GraphicsSystem.Manager.SetViewportFromView(System.Int32,Autodesk.AutoCAD.GraphicsSystem.View,System.Boolean,System.Boolean,System.Boolean)
Sets the view parameters for the indicated viewport. Pass in true for regenRequired if the new view requires a 2D regen for proper synchronization; otherwise, pass in true for rescaleRequired if a simple 2D rescale is required for proper 2D-3D synchronization. If neither is required, pass in false for both.syncRequired is used to update the underlying 2D view parameters with the new parameters, without causing either a rescale or a regen. It is useful in 3D viewports, after a view change, where a regen is no longer required, but the 2D view must be kept in sync.
viewportNumber:  Input viewport number to set
view:  Input view to set from
regenRequired:  Input true if regen is required for the viewport
rescaleRequired:  Input true if rescale is required for the viewport
syncRequired:  Input true if synching is required for the viewport

Autodesk.AutoCAD.GraphicsSystem.Manager.SetViewportFromView(System.Int32,Autodesk.AutoCAD.GraphicsSystem.View)
Sets the view parameters for the indicated viewport.
viewportNumber:  Input viewport number to set
view:  Input view to set from

Autodesk.AutoCAD.GraphicsSystem.Manager.SetViewFromViewport(Autodesk.AutoCAD.GraphicsSystem.View,System.Int32)
Sets the view parameters for the indicated viewport.
view:  Input view to set
viewportNumber:  Input viewport

Autodesk.AutoCAD.GraphicsSystem.Manager.GetCurrentAcGsView(System.Int32)
This is GetCurrentAcGsView, a member of class Manager.

Autodesk.AutoCAD.GraphicsSystem.Manager.GetCurrent3dAcGsView(System.Int32)
This is GetCurrent3dAcGsView, a member of class Manager.

Autodesk.AutoCAD.GraphicsSystem.Manager.ObtainAcGsView(System.Int32,Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor)
Returns the Graphics System view.
viewportNumber:  Input viewport number
createIfNone:  Input true if the graphics system associated with the viewport ought to be created if it does not exist

Autodesk.AutoCAD.GraphicsSystem.Manager.GetGsModel(Autodesk.AutoCAD.GraphicsInterface.TransientDrawingMode,System.Int32,System.Int32)
Gets corresponding Model according to mode, subDrawingMode and viewportNumber.
mode:  Input drawing mode
subDrawingMode:  Input the sub drawing mode of specified drawing mode
viewportNumber:  Input viewport identification number (this is the same type of number returned by the CVPORT system variable)

Autodesk.AutoCAD.GraphicsSystem.Manager.GetOffScreenDevice(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel)
Gets an offscreen device for the specified kernel.

Autodesk.AutoCAD.GraphicsSystem.Manager.GetOffScreenView(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel,Autodesk.AutoCAD.GraphicsSystem.ClientViewInfo)
Gets an offscreen view for the specified kernel.

Autodesk.AutoCAD.GraphicsSystem.Manager.AcquireGraphicsKernel(Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor)
The Graphics Kernel is a descriptor of the underlying graphics system.
desc:  A descriptor defining the required capabilities of the kernel.

Autodesk.AutoCAD.GraphicsSystem.Manager.ReleaseGraphicsKernel(Autodesk.AutoCAD.GraphicsSystem.GraphicsKernel)
Removes a reference to the specified graphics kernel.
kernel:  Graphics Kernel to release<

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateViewport(Autodesk.AutoCAD.GraphicsSystem.Device,Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord)
This is CreateViewport, a member of class Manager.

Autodesk.AutoCAD.GraphicsSystem.Manager.CreateView(Autodesk.AutoCAD.GraphicsSystem.Device)
This is CreateView, a member of class Manager.

Autodesk.AutoCAD.GraphicsSystem.Manager.DestroyView(Autodesk.AutoCAD.GraphicsSystem.View,Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord)
Corresponds to CreateAutoCADView() method.

Autodesk.AutoCAD.GraphicsSystem.Manager.ViewWasCreated
This notification informs the reactor that the specified view has just been created.

Autodesk.AutoCAD.GraphicsSystem.Manager.ViewToBeDestroyed
This notification informs the reactor that the specified view is about to be destroyed.

Autodesk.AutoCAD.GraphicsSystem.Manager.ViewToBeUpdated
This notification informs the reactor that the View is just about to be updated.

Autodesk.AutoCAD.GraphicsSystem.Manager.ViewWasUpdated
This notification informs the reactor that the View has been updated.

Autodesk.AutoCAD.GraphicsSystem.Manager.GsToBeUnloaded
This notification informs the reactor that the GS is about to be unloaded.

Autodesk.AutoCAD.GraphicsSystem.Manager.ConfigWasModified
Reserved for future use.

Autodesk.AutoCAD.GraphicsSystem.Manager.DeviceIndependentDisplaySize
This is DeviceIndependentDisplaySize, a member of class Manager.