Autodesk.AutoCAD.EditorInput.PromptKeywordOptions
This class represents optional parameters for a prompt for a keyword.

Autodesk.AutoCAD.EditorInput.PromptKeywordOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptKeywordOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptKeywordOptions.AllowNone
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptKeywordOptions.AllowArbitraryInput
Gets or sets whether the prompts accepts arbitrary input.