Autodesk.AutoCAD.PlottingServices.MediaBounds
This class provides properties that describe the boundaries of the media in terms of page size, lower left printable area, and upper right printable area.

Autodesk.AutoCAD.PlottingServices.MediaBounds.#ctor(Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d,Autodesk.AutoCAD.Geometry.Point2d)
Constructs the media bounds with given corner points.
pageSize:  Input size of page
lowerLeftPrintableArea:  Input lower left printable area
upperRightPrintableArea:  Input upper right printable area

Autodesk.AutoCAD.PlottingServices.MediaBounds.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.PlottingServices.MediaBounds.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.PlottingServices.MediaBounds.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare against

Autodesk.AutoCAD.PlottingServices.MediaBounds.IsEqualTo(Autodesk.AutoCAD.PlottingServices.MediaBounds)
This method calls MediaBounds.IsEqualTo(MediaBounds a, Tolerance tolerance) with tolerance set to Global.
a:  Input object to compare against

Autodesk.AutoCAD.PlottingServices.MediaBounds.IsEqualTo(Autodesk.AutoCAD.PlottingServices.MediaBounds,Autodesk.AutoCAD.Geometry.Tolerance)
This method tests a for equality to this object by comparing LowerLeftPrintableArea, PageSize, and UpperRightPrintableArea properties.
a:  Input object to compare against
tolerance:  Input tolerance value

Autodesk.AutoCAD.PlottingServices.MediaBounds.op_Inequality(Autodesk.AutoCAD.PlottingServices.MediaBounds,Autodesk.AutoCAD.PlottingServices.MediaBounds)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.PlottingServices.MediaBounds.op_Equality(Autodesk.AutoCAD.PlottingServices.MediaBounds,Autodesk.AutoCAD.PlottingServices.MediaBounds)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.PlottingServices.MediaBounds.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.PlottingServices.MediaBounds.PageSize
Returns the PageSize property value.

Autodesk.AutoCAD.PlottingServices.MediaBounds.LowerLeftPrintableArea
.

Autodesk.AutoCAD.PlottingServices.MediaBounds.UpperRightPrintableArea
Returns the UpperRightPrintableArea property value.