Autodesk.AutoCAD.ApplicationServices.DocumentBeginCloseEventArgs
This class provides data for the BeginDocumentClose event of a Document.

Autodesk.AutoCAD.ApplicationServices.DocumentBeginCloseEventArgs.Veto
Vetoes the close process.