Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptionsEventArgs
This class provides data for the PromptingForNestedEntity> event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptionsEventArgs.Options
Gets the input parameters of the prompt.