Autodesk.AutoCAD.EditorInput.PointFilterEventArgs
This class provides data for the PointFilter event.

Autodesk.AutoCAD.EditorInput.PointFilterEventArgs.Context
Gets an object that provides input data for this event.

Autodesk.AutoCAD.EditorInput.PointFilterEventArgs.Result
Gets an object whose properties and methods can be used to set the result of this event.

Autodesk.AutoCAD.EditorInput.PointFilterEventArgs.CallNext
Gets or sets a value that determines whether the next point filter is called to do further filtering.