Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs
This class provides data for the BeginPublishingSheet event.

Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs.DsdEntry
Returns the DsdEntry property value.

Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs.UniqueId
Returns the UniqueId property value.

Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs.PlotLogger
Returns the PlotLogger property value.