Autodesk.AutoCAD.PlottingServices.PlotConfigInfoCollection
This .NET class wraps the AcArray<AcPlPlotConfigInfo, AcArrayObjectCopyReallocator > ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfoCollection.CopyTo(Autodesk.AutoCAD.PlottingServices.PlotConfigInfo[],System.Int32)
Copies objects in array to this collection.
array:  Input target array.
index:  Input zero-based index from which the array is copied.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfoCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfoCollection.Count
Returns the number of objects in this collection.