Autodesk.AutoCAD.PlottingServices.EndPlotEventArgs
This class encapsulates the plot-specific information required by the EndPlot event.

Autodesk.AutoCAD.PlottingServices.EndPlotEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.PlotCancelStatus)
Constructs a new object with the given status.
status:  Input status of document

Autodesk.AutoCAD.PlottingServices.EndPlotEventArgs.Status
Accesses the Status property value.