Autodesk.AutoCAD.EditorInput.JigPromptPointOptions
This class provides a container for command line options that can be passed to the JigPrompts.AcquirePoint() method.

Autodesk.AutoCAD.EditorInput.JigPromptPointOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input prompt message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.JigPromptPointOptions.#ctor(System.String)
Constructor.
message:  Input prompt string

Autodesk.AutoCAD.EditorInput.JigPromptPointOptions.#ctor
Constructor.

Autodesk.AutoCAD.EditorInput.JigPromptPointOptions.DefaultValue
Returns the default value to be used for point option prompt.