Autodesk.AutoCAD.ApplicationServices.DocumentPinStateChangedEventArgs
This is class Autodesk.AutoCAD.ApplicationServices.DocumentPinStateChangedEventArgs.

Autodesk.AutoCAD.ApplicationServices.DocumentPinStateChangedEventArgs.RecentDocument
This is RecentDocument, a member of class DocumentPinStateChangedEventArgs.