Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs
This class encapsulates the plot-specific information required by the BeginPage event.

Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs.PlotInfo
Returns the PlotInfo property value.

Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs.PlotPageInfo
Returns the PlotPageInfo property value.

Autodesk.AutoCAD.PlottingServices.BeginPageEventArgs.LastPage
Returns the LastPage property value.