Autodesk.AutoCAD.Publishing.DwfNode
This class is similar to the AcDMMNode ObjectARX class.

Autodesk.AutoCAD.Publishing.DwfNode.#ctor
Default constructor.

Autodesk.AutoCAD.Publishing.DwfNode.NodeId
Returns the NodeId property.

Autodesk.AutoCAD.Publishing.DwfNode.NodeName
Returns the NodeName property value.