Autodesk.AutoCAD.ApplicationServices.BeginQuitEventArgs
This is class Autodesk.AutoCAD.ApplicationServices.BeginQuitEventArgs.

Autodesk.AutoCAD.ApplicationServices.BeginQuitEventArgs.IsVetoed
This is IsVetoed, a member of class BeginQuitEventArgs.