Autodesk.AutoCAD.EditorInput.InputPointContext
This class provides input parameters for the PointFilter and PointMonitor events.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetCustomObjectSnapModes
Returns the custom OSNAP modes in effect, if pointComputed is true, and history has the Osnaped bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetCustomObjectSnapOverrides
Returns the custom osnap overrides currently active (even if they didn't participate in the calculation of the computedPoint).

Autodesk.AutoCAD.EditorInput.InputPointContext.GetPickedEntities
Returns the picked entity array.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetKeyPointEntities
Returns the entities that were responsible for the calculation of the osnappedPoint.

Autodesk.AutoCAD.EditorInput.InputPointContext.GetAlignmentPaths
Input array that contains geometry of type Line3d (ortho and polar snap lines), LineSeg3d (extension lines), or EllipArc3d (extension arcs).

Autodesk.AutoCAD.EditorInput.InputPointContext.Document
Returns the document object that this callback emanates from; this makes it easier to plant one instance on all input point managers, and determine which one is making the callback.

Autodesk.AutoCAD.EditorInput.InputPointContext.DrawContext
Returns view transform, pixel sizes, and other context information; returns whatever visible graphics you want to display.

Autodesk.AutoCAD.EditorInput.InputPointContext.PointComputed
Returns true if the all the required points are valid, or false if they are not.

Autodesk.AutoCAD.EditorInput.InputPointContext.History
Returns the integer with bit fields as defined by the PointHistory enum.

Autodesk.AutoCAD.EditorInput.InputPointContext.LastPoint
Returns the last point if history has the LastPoint bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.RawPoint
Returns the point as tracked by the cursor position before subsequent filtering, or as entered via alternate means, which is subject to far less filtering.

Autodesk.AutoCAD.EditorInput.InputPointContext.GrippedPoint
Returns the gripped point if history has the Gripped bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.CartesianSnappedPoint
Returns the old-style snap if history has the CartSnapped bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.ObjectSnappedPoint
Returns the current OSNAP point, if pointComputed is true, and history has the Osnapped bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.ObjectSnapMask
Returns the current OSNAP modes in effect, if pointComputed is true, and history has the Osnapped bit set.

Autodesk.AutoCAD.EditorInput.InputPointContext.ObjectSnapOverrides
Returns the osnap overrides currently active (even if they didn't participate in the calculation of the computedPoint).

Autodesk.AutoCAD.EditorInput.InputPointContext.ComputedPoint
Returns the point as it ends up for AutoCAD if pointComputed is true.

Autodesk.AutoCAD.EditorInput.InputPointContext.ToolTipText
Returns the final tool tip string, as determined by AutoCAD; can be altered by returning a new string.