Autodesk.AutoCAD.EditorInput.PromptAngleOptions
This class represents optional parameters for a prompt for an angle.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.#ctor(System.String,System.String)
Constructor.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.AllowNone
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.AllowArbitraryInput
Gets or sets whether the prompts accepts arbitrary input.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.AllowZero
Gets or sets whether the prompt accepts zero valued input.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.BasePoint
Gets or sets the base point to be used by the prompt.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.UseBasePoint
Gets or sets whether the base point is to be used.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.UseDashedLine
Gets or sets whether a dashed "rubber band" line is to be drawn between the base point and the cursor's current location while prompting.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.DefaultValue
The default value to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.UseDefaultValue
Gets or sets whether the prompt should use the default value when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptAngleOptions.UseAngleBase
Gets or sets whether the base angle value is used.