Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs
This class provides data for the SelectionAdded event of the Editor class.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Add(Autodesk.AutoCAD.EditorInput.SelectedObject)
To add entities to the sub SelectionSet and final SelectionSet array.
value:  Input value to add

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.AddSubEntity(Autodesk.AutoCAD.EditorInput.SelectedSubObject)
Adds the sub entity to the selected subobject.
value:  Input subentity to add

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Remove(System.Int32)
Removes the object from the index value specified.
index:  Input index of object to remove

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.RemoveSubEntity(System.Int32,System.Int32)
Removes the sub entity based on the specified entityIndex and subEntityIndex.
entityIndex:  Input entity index
subEntityIndex:  Input subentity index

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Highlight(System.Int32,Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Highlights the selection based on the subSelectionIndex value and the full sub entity path.
subSelectionIndex:  Input subselection index
path:  Input path to highlight

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Flags
Gets the flags that provide further details about the selection in progress.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.Selection
Gets the objects currently selected.

Autodesk.AutoCAD.EditorInput.SelectionAddedEventArgs.AddedObjects
The objects added to the selection set.