Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs
This class provides data for the PromptForSelectionEnding event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.Add(Autodesk.AutoCAD.EditorInput.SelectedObject)
Adds entities to the subSelection array.
value:  Input object to be added.

Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.AddSubEntity(Autodesk.AutoCAD.EditorInput.SelectedSubObject)
Adds sub entity to the selected subobject.
value:  Input object to be added.

Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.Remove(System.Int32)
Removes the object from the point specified by index.
index:  Input index of item to removes

Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.RemoveSubEntity(System.Int32,System.Int32)
Removes subentity from the point specified by entityIndex and subEntityIndex.
entityIndex:  Input entity index of item to remove
subEntityIndex:  Input subEntity index of item to removes

Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.Flags
Gets extra information about the selection in progress.

Autodesk.AutoCAD.EditorInput.PromptForSelectionEndingEventArgs.Selection
Gets the SelectionSet that this prompt has obtained.