Autodesk.AutoCAD.ApplicationServices.DocumentDestroyedEventArgs
This class provides data for the DocumentDestroyed event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentDestroyedEventArgs.FileName
Accesses the name of the document that was destroyed.