Autodesk.AutoCAD.EditorInput.SelectionSet
This class is a collection of objects typically selected by the user.

Autodesk.AutoCAD.EditorInput.SelectionSet.CopyTo(Autodesk.AutoCAD.EditorInput.SelectedObject[],System.Int32)
Copies the SelectionSet or a portion of it to a one-dimensional array.
array:  Input the one-dimensional array that is the destination of the elements copied from SelectionSet. The array must have zero-based indexing
index:  Input the zero-based index in array at which copying begins.

Autodesk.AutoCAD.EditorInput.SelectionSet.FromObjectIds(Autodesk.AutoCAD.DatabaseServices.ObjectId[])
Creates a new selection set using the object IDs in ids.
ids:  Input array of IDs to copy

Autodesk.AutoCAD.EditorInput.SelectionSet.GetObjectIds
Gets an array of object IDs representing the selected objects.

Autodesk.AutoCAD.EditorInput.SelectionSet.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.SelectionSet.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectionSet.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.EditorInput.SelectionSet.Count
Gets the number of elements actually contained in the SelectionSet.

Autodesk.AutoCAD.EditorInput.SelectionSet.SyncRoot
Accesses the synchronized root.

Autodesk.AutoCAD.EditorInput.SelectionSet.IsSynchronized
Assesses if the selection set is synchronized.