Autodesk.AutoCAD.PlottingServices.PlotFactory
This .NET class wraps the AcPlPlotFactory ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotFactory.CreatePublishEngine
Creates and returns an engine for plotting to a device (or to a file).

Autodesk.AutoCAD.PlottingServices.PlotFactory.ProcessPlotState
.