Autodesk.AutoCAD.EditorInput.PromptFileNameResult
This class contains the result returned from prompts that request a file name, such as the Editor.GetFileNameForSave() and Editor.GetFileNameForOpen() methods.

Autodesk.AutoCAD.EditorInput.PromptFileNameResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptFileNameResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptFileNameResult.ReadOnly
Returns Boolean indicating whether filename result prompt is read-only.