Autodesk.AutoCAD.Publishing.OptionsDialogResult
This class represents the return value of the Publisher.ShowDwfOptionsDialog method.

Autodesk.AutoCAD.Publishing.OptionsDialogResult.Status
Returns the Status property value.

Autodesk.AutoCAD.Publishing.OptionsDialogResult.DsdData
Accesses the DsdData property value.

Autodesk.AutoCAD.Publishing.OptionsDialogResult.PlotConfig
Accesses the PlotConfig property value.