Autodesk.AutoCAD.EditorInput.PromptResult
This is the base class for classes that hold the result of a prompt operation.

Autodesk.AutoCAD.EditorInput.PromptResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptResult.Status
Gets the status result of the prompt operation.

Autodesk.AutoCAD.EditorInput.PromptResult.StringResult
Gets the optional string result of the prompt operation.