Autodesk.AutoCAD.EditorInput.PromptSelectionResultEventArgs
This class provides data for the PromptedForSelection> event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptSelectionResultEventArgs.Result
Gets the result of the selection.