Autodesk.AutoCAD.EditorInput.PromptDistanceOptions
This class represents optional parameters for a distance prompt.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.#ctor(System.String,System.String)
Constructor.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.BasePoint
Gets or sets the base point to be used by the prompt.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.UseBasePoint
Gets or sets whether tthe base point is to be used.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.UseDashedLine
Gets or sets whether a dashed "rubber band" line is to be drawn between the base point and the cursor's current location while prompting.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.Only2d
Gets or sets whether the distance returned should be measured as a 2D projection to the UCS.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptions.DefaultValue
The default value to be used when the user presses ENTER without any other input.