Autodesk.AutoCAD.Runtime.JavaScriptCallbackAttribute
This is class Autodesk.AutoCAD.Runtime.JavaScriptCallbackAttribute.

Autodesk.AutoCAD.Runtime.JavaScriptCallbackAttribute.#ctor(System.String)
This is JavaScriptCallbackAttribute, a member of class JavaScriptCallbackAttribute.

Autodesk.AutoCAD.Runtime.JavaScriptCallbackAttribute.EntryPoint
This is EntryPoint, a member of class JavaScriptCallbackAttribute.