Autodesk.AutoCAD.Runtime.SynchronizationContext
This is class Autodesk.AutoCAD.Runtime.SynchronizationContext.

Autodesk.AutoCAD.Runtime.SynchronizationContext.CreateCopy
This is CreateCopy, a member of class SynchronizationContext.

Autodesk.AutoCAD.Runtime.SynchronizationContext.OperationCompleted
This is OperationCompleted, a member of class SynchronizationContext.

Autodesk.AutoCAD.Runtime.SynchronizationContext.OperationStarted
This is OperationStarted, a member of class SynchronizationContext.

Autodesk.AutoCAD.Runtime.SynchronizationContext.Wait(System.IntPtr[],System.Boolean,System.Int32)
This is Wait, a member of class SynchronizationContext.