Autodesk.AutoCAD.Publishing.PublishSheetEventArgs
This class provides data for the PublishSheet event.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AddPagePropertyRange(Autodesk.AutoCAD.Publishing.EPlotProperty[])
Adds a page property range.
properties:  Input page properties range

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AddPageResourceRange(Autodesk.AutoCAD.Publishing.EPlotResource[])
Adds a page resource range.
resources:  Input page resource range

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotLogger
Accesses the PlotLogger property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.Database
Accesses the Database property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.IsPlotJobCancelled
Returns the IsPlotJobcanceled property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.UniqueLayoutId
Returns the UniqueLayoutId property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotLayoutId
Accesses the PlotLayoutId property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.IsModelLayout
Returns the IsModelLayout property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotType
Returns the PlotType property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotRotation
Returns the PlotRotation property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotPaperUnit
Returns the PlotPaperUnit property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PaperScale
Returns the PaperScale property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DrawingScale
Returns the DrawingScale property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.OriginX
Returns the OriginX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.OriginY
Returns the OriginY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMinX
Returns the PlotWindowMinX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMinY
Returns the PlotWindowMinY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMaxX
Returns the PlotWindowMaxX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotWindowMaxY
Returns the PlotWindowMaxY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.ViewPlotted
Returns the ViewPlotted property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.IsScaleSpecified
Returns the IsScaleSpecified property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AreLinesHidden
Returns the AreLinesHidden property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.ArePlottingLineWeights
Returns the ArePlottingLineWeights property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.AreScalingLineWeights
Returns the AreScalingLineWeights property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMinX
Returns the DisplayMinX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMinY
Returns the DisplayMinY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMaxX
Returns the DisplayMaxX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.DisplayMaxY
Returns the DisplayMaxY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMinX
Returns the LayoutMarginMinX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMinY
Returns the LayoutMarginMinY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMaxX
Returns the LayoutMarginMaxX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutMarginMaxY
Returns the LayoutMarginMaxY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PrintableBoundsX
Returns the PrintableBoundsX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PrintableBoundsY
Returns the PrintableBoundsY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.MaxBoundsX
Returns the MaxBoundsX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.MaxBoundsY
Returns the MaxBoundsY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.StepsPerInch
Returns the StepsPerInch property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.Configuration
Returns the Configuration property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotToFilePath
Returns the PlotToFilePath property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotToFileName
Returns the PlotToFileName property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.CanonicalMediaName
Returns the CanonicalMediaName property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMinX
Returns the PlotBoundsMinX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMinY
Returns the PlotBoundsMinY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMaxX
Returns the PlotBoundsMaxX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PlotBoundsMaxY
Returns the PlotBoundsMaxY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMinX
Returns the LayoutBoundsMinX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMinY
Returns the LayoutBoundsMinY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMaxX
Returns the LayoutBoundsMaxX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.LayoutBoundsMaxY
Returns the LayoutBoundsMaxY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetX
Returns the EffectivePlotOffsetX property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetY
Returns the EffectivePlotOffsetY property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetXDevice
Returns the EffectivePlotOffsetXDevice property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.EffectivePlotOffsetYDevice
Returns the EffectivePlotOffsetYDevice property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.PublishingTo3DDwf
Returns the PublishingTo3DDwf property value.

Autodesk.AutoCAD.Publishing.PublishSheetEventArgs.Dwf3dNavigationTreeNode
Accesses the DwfFileName property value.