Autodesk.AutoCAD.EditorInput.PromptPointResultEventArgs
This class provides data for the PromptedForPoint event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptPointResultEventArgs.Result
Gets the result of the selection.