Autodesk.AutoCAD.EditorInput.PromptDragOptions
This class lets applications define custom options to be displayed at the command line before a dragging operation.

Autodesk.AutoCAD.EditorInput.PromptDragOptions.#ctor(Autodesk.AutoCAD.EditorInput.SelectionSet,System.String,System.String,Autodesk.AutoCAD.EditorInput.DragCallback)
Constructor.
selection:  Input selection set
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords
callback:  Input drag callback

Autodesk.AutoCAD.EditorInput.PromptDragOptions.#ctor(Autodesk.AutoCAD.EditorInput.SelectionSet,System.String,Autodesk.AutoCAD.EditorInput.DragCallback)
Constructor.
selection:  Input selection set
message:  Input prompt message
callback:  Input drag callback

Autodesk.AutoCAD.EditorInput.PromptDragOptions.AllowNone
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptDragOptions.AllowArbitraryInput
Gets or sets whether the prompts accepts arbitrary input.

Autodesk.AutoCAD.EditorInput.PromptDragOptions.Selection
Returns the selection from the SelectionSet selected by the user.

Autodesk.AutoCAD.EditorInput.PromptDragOptions.Callback
Returns the callback property for the prompt option.

Autodesk.AutoCAD.EditorInput.PromptDragOptions.Cursor
Returns the cursor type used while dragging.