Autodesk.AutoCAD.EditorInput.PromptEntityResult
This class holds the result of a prompt that returns an entity as its primary result.

Autodesk.AutoCAD.EditorInput.PromptEntityResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptEntityResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptEntityResult.ObjectId
Gets the entity that the user picked.

Autodesk.AutoCAD.EditorInput.PromptEntityResult.PickedPoint
Gets the point that was used to pick the entity.