Autodesk.AutoCAD.EditorInput.PromptDistanceOptionsEventArgs
This class provides data for the PromptingForDistance event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptDistanceOptionsEventArgs.Options
Gets the input parameters of the prompt.