Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject
This class describes an object that was selected by a window or window polygon selection.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr)
Constructor.
id:  Input ID of crossing object
method:  Input method to select object
gsMarker:  Input any GS markers

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64)
Obsolete - Use the constructor overload taking IntPtr instead.
id:  Input ID of crossing object
method:  Input method to select object
gsMarker:  Input any GS markers

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.GetPickPoints
Gets an array of pick points used to select the object.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture specific format

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedObject.ToString
Returns an equivalent string representation of this object.