Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions
This class represents optional parameters for a prompt for a nested entity.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.AllowNone
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.NonInteractivePickPoint
Gets or sets the value for a non-interactive pick point.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityOptions.UseNonInteractivePickPoint
Gets or sets whether the prompt should attempt a non-interactive pick.