Autodesk.AutoCAD.PlottingServices.PlotProgressDialog
This .NET class wraps the AcPlPlotProgressDialog ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.#ctor(System.Boolean,System.Int32,System.Boolean)
Constructs a plot progress dialog with the AutoCAD frame window as the parent.
isPreview:  Input true if the dialog is a preview
sheetCount:  Input the sheet count
showCancelSheetButton:  Input true to show the cancel sheet button

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnBeginPlot
Indicates whether the begin plot notification was successful.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnEndPlot
Indicates whether the end plot notification was successful.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnBeginSheet
Indicates whether the begin sheet notification was successful.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.OnEndSheet
Indicates whether the end sheet notification was successful.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.Destroy
Destroys the dialog.

Autodesk.AutoCAD.PlottingServices.PlotProgressDialog.IsSingleSheetPlot
Returns true if the plot progress dialog was created to handle single-sheet plots and previews.