Autodesk.AutoCAD.PlottingServices.EndDocumentEventArgs
This class encapsulates the plot-specific information required by the EndDocument event.

Autodesk.AutoCAD.PlottingServices.EndDocumentEventArgs.#ctor(Autodesk.AutoCAD.PlottingServices.PlotCancelStatus)
Constructs a new object with the given status.
status:  Input status of document

Autodesk.AutoCAD.PlottingServices.EndDocumentEventArgs.Status
Accesses the Status property value.