Autodesk.AutoCAD.Publishing.Publisher
This .NET class implements events defined by the AcDMMReactor, AcPublishReactor, and AcPublishUiReactor ObjectARX classes.

Autodesk.AutoCAD.Publishing.Publisher.AboutToBeginBackgroundPublishing
Occurs when the plot operation is about to start.

Autodesk.AutoCAD.Publishing.Publisher.AboutToBeginPublishing
Occurs when the plot operation is about to start.

Autodesk.AutoCAD.Publishing.Publisher.BeginPublishingSheet
Occurs at the start of the plot operation.

Autodesk.AutoCAD.Publishing.Publisher.BeginAggregation
Occurs after all of the temporary DWF files for the job have been plotted and aggregation into a single multisheet DWF is about to begin.

Autodesk.AutoCAD.Publishing.Publisher.AboutToEndPublishing
Occurs when the publish job is about to end.

Autodesk.AutoCAD.Publishing.Publisher.AboutToMoveFile
Occurs after a multipage DWF has been aggregated, but before the temporary DWF file has been moved to its final destination.

Autodesk.AutoCAD.Publishing.Publisher.EndPublish
Occurs at the end of the publish job.

Autodesk.AutoCAD.Publishing.Publisher.CancelledOrFailedPublishing
Occurs if the job is being canceled or aborted due to user input or due to an error.

Autodesk.AutoCAD.Publishing.Publisher.InitPublishOptionsDialog
Occurs when the Publish Options dialog is about to be displayed.

Autodesk.AutoCAD.Publishing.Publisher.BeginSheet
Occurs before any entities are plotted, to let clients know about the sheet that is about to be plotted.

Autodesk.AutoCAD.Publishing.Publisher.BeginEntity
Occurs before each entity on the sheet is plotted.

Autodesk.AutoCAD.Publishing.Publisher.EndEntity
Occurs after each entity on the sheet is plotted.

Autodesk.AutoCAD.Publishing.Publisher.EndSheet
Indicates that all entities on the sheet have been plotted, to notify clients that plotting of the sheet is complete.

Autodesk.AutoCAD.Publishing.Publisher.PublishDsd(System.String,Autodesk.AutoCAD.PlottingServices.PlotProgressDialog)
Publishes dsdfile with the status indicated in plotProgressDialog.
A DSD file is an INI file used when publishing multiple sheets with the PUBLISH command.
dsdFile:  Input file to publish
plotProgressDialog:  Input plot progress dialog

Autodesk.AutoCAD.Publishing.Publisher.PublishExecute(Autodesk.AutoCAD.PlottingServices.DsdData,Autodesk.AutoCAD.PlottingServices.PlotConfig)
Publishes dsdData with the status indicated in plotConfig.
dsdData:  Input data to execute
plotConfig:  Input plot progress dialog

Autodesk.AutoCAD.Publishing.Publisher.PublishSelectedLayouts(System.Boolean)
Publishes the selected layouts.
bOverride:  Input true if there are overrides.

Autodesk.AutoCAD.Publishing.Publisher.ShowDwfOptionsDialog(Autodesk.AutoCAD.PlottingServices.DsdData,Autodesk.AutoCAD.PlottingServices.PlotConfig,System.String)
Returns the DWF options dialog result.
dsdData:  Input data to execute
plotConfig:  Input plot progress dialog
optionsDialogTitle:  Input title of options

Autodesk.AutoCAD.Publishing.Publisher.FireAboutToBeginBackgroundPublishing(Autodesk.AutoCAD.Publishing.AboutToBeginBackgroundPublishingEventArgs)
AboutToBeginBackgroundPublishingEventArgs event fired before the background publishing begins.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireAboutToBeginPublishing(Autodesk.AutoCAD.Publishing.AboutToBeginPublishingEventArgs)
AboutToBeginBackgroundPublishingEventArgs event fired before publishing begins.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireBeginPublishingSheet(Autodesk.AutoCAD.Publishing.BeginPublishingSheetEventArgs)
See BeginPublishingSheet event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireBeginAggregation(Autodesk.AutoCAD.Publishing.BeginAggregationEventArgs)
See BeginAggregation event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireAboutToEndPublishing(Autodesk.AutoCAD.Publishing.PublishEventArgs)
See AboutToEndPublishing event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireAboutToMoveFile(Autodesk.AutoCAD.Publishing.PublishEventArgs)
See AboutToMoveFile event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireEndPublish(Autodesk.AutoCAD.Publishing.PublishEventArgs)
See EndPublish event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireCancelledOrFailedPublishing(Autodesk.AutoCAD.Publishing.PublishEventArgs)
See CancelledOrFailedPublishing event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireInitPublishOptionsDialog(Autodesk.AutoCAD.Publishing.PublishUIEventArgs)
See InitPublishOptionsDialog event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireBeginSheet(Autodesk.AutoCAD.Publishing.PublishSheetEventArgs)
See BeginSheet event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireBeginEntity(Autodesk.AutoCAD.Publishing.PublishEntityEventArgs)
See BeginEntity event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireEndEntity(Autodesk.AutoCAD.Publishing.PublishEntityEventArgs)
See EndEntity event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.FireEndSheet(Autodesk.AutoCAD.Publishing.PublishSheetEventArgs)
See EndSheet event.
e:  Input event argument to launch

Autodesk.AutoCAD.Publishing.Publisher.CurrentPublishedSheetSetPath
.