Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangeVetoedEventArgs
This class provides data for the DocumentLockModeChangeVetoed event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangeVetoedEventArgs.Document
Wraps the AcApDocManager::document() ObjectARX function, which returns the document that the input database belongs to.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeChangeVetoedEventArgs.GlobalCommandName
Accesses the name of the command that was requesting the change.