Autodesk.AutoCAD.EditorInput.EditorUserInteraction
This class allows users to interact with AutoCAD from within an application-defined modal dialog box.

Autodesk.AutoCAD.EditorInput.EditorUserInteraction.End
Calls Dispose() to end this user interaction.