Autodesk.AutoCAD.GraphicsSystem.ViewUpdateEventArgs
Event args class to support Manager.ViewToBeUpdated and Manager.ViewWasUpdated events.

Autodesk.AutoCAD.GraphicsSystem.ViewUpdateEventArgs.#ctor
This is ViewUpdateEventArgs, a member of class ViewUpdateEventArgs.

Autodesk.AutoCAD.GraphicsSystem.ViewUpdateEventArgs.View
This is View, a member of class ViewUpdateEventArgs.

Autodesk.AutoCAD.GraphicsSystem.ViewUpdateEventArgs.viewUpdateFlags
Flags containing additional information about the view update event.