Autodesk.AutoCAD.EditorInput.PromptStringOptionsEventArgs
This class provides data for the PromptingForString event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptStringOptionsEventArgs.Options
Gets the input parameters of the prompt.