Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject
This class encapsulates a subobject that is selected by the pick point selection method.

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Constructor.
path:  Input subentity path
method:  Input method of selection
gsMarker:  Input GS markers
descriptor:  Input pick point descriptor

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Obsolete - Use the constructor overload taking IntPtr instead.
path:  Input subentity path
method:  Input method of selection
gsMarker:  Input GS markers
descriptor:  Input pick point descriptor

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PickPointSelectedSubObject.PickPoint
Gets the pick point that was used to select the subobject.