Autodesk.AutoCAD.EditorInput.PromptIntegerResultEventArgs
This class provides data for the PromptingForInteger event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptIntegerResultEventArgs.Result
Gets the result of the selection.