Autodesk.AutoCAD.EditorInput.PromptIntegerResult
This class holds the result of a prompt that returns an integer as its primary result.

Autodesk.AutoCAD.EditorInput.PromptIntegerResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptIntegerResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptIntegerResult.Value
Gets the integer that the user entered.