Autodesk.AutoCAD.EditorInput.PickPointDescriptor
This class describes the shape of a pick point.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.#ctor(Autodesk.AutoCAD.EditorInput.PickPointKind,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
Constructor.
kind:  Input the type of pick point
pointOnLine:  Input the point on the line to pick
direction:  Input the direction of the pick

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.Equals(System.Object)
Returns true if this object is identical to the argument object.
obj:  Input object to compare

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.IsEqualTo(Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
This method compares the PointOnLine and Direction properties of a to those of this object, using Global tolerance.
a:  Input object to compare

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.IsEqualTo(Autodesk.AutoCAD.EditorInput.PickPointDescriptor,Autodesk.AutoCAD.Geometry.Tolerance)
This method compares the PointOnLine and Direction properties of a to those of this object, using the tolerance specified by tolerance.
a:  Input object to compare
tolerance:  Input tolerance value

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.op_Inequality(Autodesk.AutoCAD.EditorInput.PickPointDescriptor,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Returns true if a does not equal b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.op_Equality(Autodesk.AutoCAD.EditorInput.PickPointDescriptor,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Returns true if a equals b.
a:  Left operand
b:  Right operand

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.Kind
Gets the general "shape" of the pick point.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.PointOnLine
Gets a point on the line, ray or line segment that represents the pick point.

Autodesk.AutoCAD.EditorInput.PickPointDescriptor.Direction
Gets a vector that describes the direction of the infinite line or the direction and length for ray and line segment "shapes".