Autodesk.AutoCAD.EditorInput.FenceSelectedObject
This class describes an object that is selected by fence selection.

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr,Autodesk.AutoCAD.EditorInput.PickPointDescriptor[])
Constructor.
id:  Input object to fence
method:  Input selection method
gsMarker:  Input GS markers
descriptors:  Input pick point descriptors

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64,Autodesk.AutoCAD.EditorInput.PickPointDescriptor[])
Obsolete - Use the constructor overload taking IntPtr instead.
id:  Input object to fence
method:  Input selection method
gsMarker:  Input GS markers
descriptors:  Input pick point descriptors

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.GetIntersectionPoints
Gets an array of pick points used to select the object.

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.EditorInput.FenceSelectedObject.ToString
Returns an equivalent string representation of this object.