Autodesk.AutoCAD.EditorInput.PromptIntegerOptions
This class represents optional parameters for a prompt for an integer.

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.#ctor(System.String,System.String,System.Int32,System.Int32)
Constructor.
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords
lowerLimit:  Input lower limit
upperLimit:  Input upper limit

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.DefaultValue
The default value to be used when the user presses ENTER without any other input.

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.LowerLimit
Returns the lower limit integer value.

Autodesk.AutoCAD.EditorInput.PromptIntegerOptions.UpperLimit
Returns the lower limit integer value.