Autodesk.AutoCAD.EditorInput.PromptCornerOptions
This class represents optional parameters for a corner prompt.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.#ctor(System.String,System.String,Autodesk.AutoCAD.Geometry.Point3d)
Constructor.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.#ctor(System.String,Autodesk.AutoCAD.Geometry.Point3d)
Constructor.
message:  Input prompt message
basePoint:  Input base point

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.AllowNone
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.AllowArbitraryInput
Gets or sets whether the prompts accepts arbitrary input.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.BasePoint
Gets or sets the base point to be used by the prompt.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.UseDashedLine
Gets or sets whether a dashed "rubber band" line is to be drawn between the base point and the cursor's current location while prompting.

Autodesk.AutoCAD.EditorInput.PromptCornerOptions.LimitsChecked
Gets or sets whether limits checks are carried out on the input value.