Autodesk.AutoCAD.EditorInput.SelectedObject
This is the base class for a selected object.

Autodesk.AutoCAD.EditorInput.SelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr)
Constructor.
method:  Input selection method
gsMarker:  Input GS marker
path:  Input object path

Autodesk.AutoCAD.EditorInput.SelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64)
Obsolete - Use the constructor overload taking IntPtr instead.
id:  Input object path
method:  Input selection method
gsMarker:  Input GS marker

Autodesk.AutoCAD.EditorInput.SelectedObject.GetSubentities
Returns the subentities of the selected object in a SelectedSubObject array.

Autodesk.AutoCAD.EditorInput.SelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.SelectedObject.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectedObject.ObjectId
Gets the object ID of this selected object.

Autodesk.AutoCAD.EditorInput.SelectedObject.SelectionMethod
Gets a value that describes how the object was selected.

Autodesk.AutoCAD.EditorInput.SelectedObject.GraphicsSystemMarker
Obsolete - Use the GraphicsSystemMarkerPtr property instead.

Autodesk.AutoCAD.EditorInput.SelectedObject.GraphicsSystemMarkerPtr
Returns the GS Marker of the selected sub object.

Autodesk.AutoCAD.EditorInput.SelectedObject.OptionalDetails
Gets an object describing the selection details useful for nested objects.