Autodesk.AutoCAD.Publishing.EPlotPropertyCollection
This class contains a collection of EPlotPropertyobjects.

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.CopyTo(System.Array,System.Int32)
Copies objects in array to this collection.
array:  Input target array.
index:  Input zero-based index from which the copying begins.

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.Add(Autodesk.AutoCAD.Publishing.EPlotProperty)
Adds an EPlotProperty object to this collection.
value:  Input object to add

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.IsSynchronized
Assesses if the object is synchronized.

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.SyncRoot
Accesses the synchronized root.

Autodesk.AutoCAD.Publishing.EPlotPropertyCollection.Count
Returns the number of objects in this collection.