Autodesk.AutoCAD.ApplicationServices.BeginCloseAllEventArgs
This is class Autodesk.AutoCAD.ApplicationServices.BeginCloseAllEventArgs.

Autodesk.AutoCAD.ApplicationServices.BeginCloseAllEventArgs.IsVetoed
This is IsVetoed, a member of class BeginCloseAllEventArgs.