Autodesk.AutoCAD.PlottingServices.DsdEntryCollection
This .NET class wraps the AcPlDSDEntries ObjectARX class.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.#ctor
Copies sheet entries from the DSD file.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.CopyTo(Autodesk.AutoCAD.PlottingServices.DsdEntry[],System.Int32)
Copies objects in array to this collection.
array:  Input target array.
index:  Input zero-based index from where the copy begins.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Add(Autodesk.AutoCAD.PlottingServices.DsdEntry)
Adds the object represented by value to this collection.
value:  Input object to be added.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Insert(System.Int32,Autodesk.AutoCAD.PlottingServices.DsdEntry)
Inserts value at position index in the collection.
index:  Input location to where the value will be inserted.
value:  Input object to be inserted.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Input. Index of entry to remove.

Autodesk.AutoCAD.PlottingServices.DsdEntryCollection.Count
Returns the number of objects in this collection.