Autodesk.AutoCAD.EditorInput.PromptNestedEntityResultEventArgs
This class provides data for the PromptedForNestedEntity event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResultEventArgs.Result
Gets the result of the selection.