Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions
This class provides a container for command line options that can be passed to the JigPrompts.AcquireAngle() method.

Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input prompt message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.#ctor
Constructor.

Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions.DefaultValue
Returns the default jig prompt angle options value.