Autodesk.AutoCAD.EditorInput.EditorVisualStyle
Description to come.

Autodesk.AutoCAD.EditorInput.EditorVisualStyle.setCvpVS2d
Description to come.

Autodesk.AutoCAD.EditorInput.EditorVisualStyle.IsVS2dType
Returns true if visual style is a 2D type.

Autodesk.AutoCAD.EditorInput.EditorVisualStyle.IsVS3dType
Returns true if visual style is a 3D type.