Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions
This class provides a container for command line options that can be passed to the JigPrompts.AcquireDistance() method.

Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input prompt message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.#ctor
Constructor.

Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions.DefaultValue
Returns the default jig prompt distance options value.