Autodesk.AutoCAD.Runtime.LispFunctionAttribute
This class extends the Attribute and ICommandLine interfaces.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String,System.String,System.String)
Constructs an object of the given name, localized ID, and help topic.
globalName:  Input global name of the Lisp function.
localizedNameId:  Input the localized name of the Lisp function.
helpTopic:  Input help topic string for this function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String,System.String,System.String,System.String)
Constructor.
globalName:  Input global name of the Lisp function.
localizedNameId:  Input the localized name of the Lisp function.
helpFileName:  Input specifies the full path and file name of your Help file.
helpTopic:  Input help topic string for this function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String,System.String)
Constructs an object of the given name and localized ID.
globalName:  Input global name of the Lisp function.
localizedNameId:  Input the localized name of the Lisp function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.#ctor(System.String)
Constructs an object of the given name.
globalName:  Input global name of the Lisp function.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.GlobalName
Returns the GlobalName property value.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.LocalizedNameId
Returns the LocalizedNameId property value.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.HelpFileName
Returns the HelpFileName property value.

Autodesk.AutoCAD.Runtime.LispFunctionAttribute.HelpTopic
Returns the HelpTopic property value.