Autodesk.AutoCAD.EditorInput.PromptNumericalOptions
This is the base class for types that represent optional parameters for numerical prompts.

Autodesk.AutoCAD.EditorInput.PromptNumericalOptions.AllowNone
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptNumericalOptions.AllowArbitraryInput
Gets or sets whether the prompts accepts arbitrary input.

Autodesk.AutoCAD.EditorInput.PromptNumericalOptions.AllowNegative
Gets or sets whether the prompt accepts negative valued input.

Autodesk.AutoCAD.EditorInput.PromptNumericalOptions.AllowZero
Gets or sets whether the prompt accepts zero valued input.

Autodesk.AutoCAD.EditorInput.PromptNumericalOptions.UseDefaultValue
Gets or sets whether the prompt should use the default value when the user presses ENTER without any other input.