Autodesk.AutoCAD.Runtime.EnvVarExistsConditionAttribute
This is class Autodesk.AutoCAD.Runtime.EnvVarExistsConditionAttribute.

Autodesk.AutoCAD.Runtime.EnvVarExistsConditionAttribute.#ctor(System.String,System.String)
This is EnvVarExistsConditionAttribute, a member of class EnvVarExistsConditionAttribute.

Autodesk.AutoCAD.Runtime.EnvVarExistsConditionAttribute.Evaluate
Implement this function to evaluate a condition.