Autodesk.AutoCAD.ApplicationServices.SystemVariableChangedEventArgs
Contains parameters related to system variable events.

Autodesk.AutoCAD.ApplicationServices.SystemVariableChangedEventArgs.Name
Accesses the system variable name being changed.

Autodesk.AutoCAD.ApplicationServices.SystemVariableChangedEventArgs.Changed
Assesses if the system variable has been changed successfully.