Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode
This .NET class wraps the Ac3dDwfNavTreeNode ObjectARX class.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.#ctor
Default constructor.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.GetKeys
Returns the graphic identifiers included in this tree node.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.SetKeys(System.Int32[])
Sets the graphic identifiers included in this tree node.
keys:  Input array of keys

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.DisplayName
Returns the name of the tree node.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.IsGroup
Returns true if the tree node is a group.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.Children
Returns an array of all the children in the tree node.

Autodesk.AutoCAD.Publishing.Dwf3dNavigationTreeNode.IsBlock
Returns true if the node is grouped by block.