Autodesk.AutoCAD.PlottingServices.PlotLogger
This .NET class wraps the AcPlPlotLogger ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotLogger.StartJob
Indicates to the PlotLogger that the plot job has started.

Autodesk.AutoCAD.PlottingServices.PlotLogger.EndJob
Indicates to the PlotLogger that the entire job has been completed.

Autodesk.AutoCAD.PlottingServices.PlotLogger.StartSheet
Indicates to the PlotLogger that an individual sheet within a job has started.

Autodesk.AutoCAD.PlottingServices.PlotLogger.EndSheet
Indicates to the PlotLogger that an individual sheet within a job has been completed.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogTerminalError(System.String)
This method typically is called by the PlotLoggingErrorHandler.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogAbortRetryIgnoreError(System.String)
This method typically is called by the PlotLoggingErrorHandler.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogSevereError(System.String)
This method typically is called by the PlotLoggingErrorHandler.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogError(System.String)
This method may be called directly by the application or by some part of the plot engine through error handlers.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogWarning(System.String)
This method may be called directly by the application or by some part of the plot engine through error handlers.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogMessage(System.String)
This method may be called directly by the application or by some part of the plot engine through error handlers.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.LogInformation(System.String)
This method typically is called directly by the application.
message:  Input formatted error string to be recorded in the log.

Autodesk.AutoCAD.PlottingServices.PlotLogger.ErrorHasHappenedInSheet
Indicates that an error occurred between the call to StartSheet() and the call to EndSheet().

Autodesk.AutoCAD.PlottingServices.PlotLogger.WarningHasHappenedInSheet
Indicates that a warning occurred between the call to startSheet() and the call to endSheet().

Autodesk.AutoCAD.PlottingServices.PlotLogger.ErrorHasHappenedInJob
Indicates that an error occurred between the call to StartJob() and the call to EndJob().

Autodesk.AutoCAD.PlottingServices.PlotLogger.WarningHasHappenedInJob
Indicates that a warning occurred between the call to StartJob() and the call to EndJob().