Autodesk.AutoCAD.EditorInput.PromptIntegerOptionsEventArgs
This class provides data for the PromptingForInteger event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptIntegerOptionsEventArgs.Options
Gets the input parameters of the prompt.