Autodesk.AutoCAD.ApplicationServices.XrefFileLock
This .NET class is a wrapper for the ObjectARX AcEdXrefFileLock class.

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.LockFile(Autodesk.AutoCAD.DatabaseServices.ObjectId)
The Xref file referenced by the selected BTR Id is exclusively write locked.
selectedBlockId:  Block Table Record object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ReleaseFile
Releases, saves, and reloads the xref file with the new (edited) changes.

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ConsistencyCheck(Autodesk.AutoCAD.DatabaseServices.ObjectId)
By providing a selected Xref block table record (BTR) ID, this method determines if its Xref file is still in sync with what was used at load drawing time.
selectedBlockId:  Selected BTR object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ConsistencyCheck
By providing a selected Xref block table record (BTR) ID, this method determines if its Xref file is still in sync with what was used at load drawing time.

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ReloadFile
Reloads the corresponding Xref file(s) from the list of Xref BTR Ids (out of sync) to the current drawing.

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ReloadFile(System.Int32)
Reloads the corresponding Xref file(s) from the list of Xref BTR Ids (out of sync) to the current drawing.
xldCtlType:  XLOADCTL mode to reload with

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.ConsistencyCheckLocal(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method is basically the same as the ConsistencyCheck() method, with one exception.
selectedBlockId:  Selected BTR object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.GetXloadCtlType(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This method returns the XLOADCTL system variable value of the currently locked object.
selectedBlockId:  Selected BTR object ID to operate on

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.XloadCtlType
Accesses the XLOADCTL system variable type/mode of the Xref file referenced by the current BTR Id (XLOADCTL type at the time the Xref file was loaded for the BTR).

Autodesk.AutoCAD.ApplicationServices.XrefFileLock.OutOfSyncBlockIds
Accesses the internal out of sync BTR Ids that the object may be maintaining.