Autodesk.AutoCAD.EditorInput.JigPrompts
This class provides a collection of sampling functions for Jig data acquisition.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString(System.String,System.String)
Returns a string based on the keyword entered by the user from DragStatus enumerated type.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString(System.String)
Returns the string based on the options selected from the prompt.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString(Autodesk.AutoCAD.EditorInput.JigPromptStringOptions)
Returns the prompt results based on the options selected by the user.
options:  Input prompt string options

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireString
Prompts the user to enter a string.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle(System.String,System.String)
Returns an angle with the associated strings.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle(System.String)
Returns a system message based on the option selected by the user.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle(Autodesk.AutoCAD.EditorInput.JigPromptAngleOptions)
Sets the angle based on the options selected by the user.
options:  Input prompt angle options

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireAngle
Returns the Jig angle.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance(System.String,System.String)
Returns a string based on the keyword entered by the user from DragStatus enumerated type.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance(System.String)
Returns the string based on the prompt option selected by the user.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance(Autodesk.AutoCAD.EditorInput.JigPromptDistanceOptions)
Obtains a distance based on the current cursor position and the prompt option selected by the user.
options:  Input prompt distance options

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquireDistance
Obtains a distance based on the current cursor position.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint(System.String,System.String)
Returns a string based on the keyword entered by the user from AcEdJig.DragStatus> enumerated type.

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint(System.String)
Returns a message based on the options selected from the prompt.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint(Autodesk.AutoCAD.EditorInput.JigPromptPointOptions)
Obtains the point based on the options selected.
options:  Input prompt point options

Autodesk.AutoCAD.EditorInput.JigPrompts.AcquirePoint
Obtains a point based on the current cursor position.