Autodesk.AutoCAD.ApplicationServices.DocumentClosedEventArgs
This is class Autodesk.AutoCAD.ApplicationServices.DocumentClosedEventArgs.

Autodesk.AutoCAD.ApplicationServices.DocumentClosedEventArgs.RecentDocument
This is RecentDocument, a member of class DocumentClosedEventArgs.