Autodesk.AutoCAD.EditorInput.PromptSelectionResult
This class represents the result of a prompt for a selection of objects.

Autodesk.AutoCAD.EditorInput.PromptSelectionResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptSelectionResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptSelectionResult.Status
Gets the status result of the prompt operation.

Autodesk.AutoCAD.EditorInput.PromptSelectionResult.Value
Gets the SelectionSet that the user selected.