Autodesk.AutoCAD.ApplicationServices.LispWillStartEventArgs
Provides data for the LispWillStart event of the Document.

Autodesk.AutoCAD.ApplicationServices.LispWillStartEventArgs.FirstLine
Accesses the first line of the lisp routine about to execute.