Autodesk.AutoCAD.EditorInput.PromptSelectionOptionsEventArgs
This class provides data for the PromptingForSelection event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptionsEventArgs.GetPoints
Gets the array of points associated with this selection operation.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptionsEventArgs.Options
Gets the input parameters of the prompt.

Autodesk.AutoCAD.EditorInput.PromptSelectionOptionsEventArgs.Filter
Gets the filer that is used with this selection.