Autodesk.AutoCAD.Runtime.CommandMethodAttribute
This class marks an instance or static function as a command.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String)
Constructs an object with a global name.
globalName:  Input global command name

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,Autodesk.AutoCAD.Runtime.CommandFlags)
Constructs an object with a global name and command flags.
globalName:  Input command global name
flags:  Input command flags

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags)
Constructs an object with a global name, command flags, and a group name.
groupName:  Input command group name
globalName:  Input command global name
flags:  Input command flags

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags)
Constructs an object with a global name, command flags, group name, and localized ID name.
groupName:  Input command group name
globalName:  Input command global name
localizedNameId:  Input command localized name Id
flags:  Input command flags

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags,System.Type)
Constructs an object with a global name, command flags, group name, localized ID name, and context menu flags.
groupName:  Input command group name
globalName:  Input command global name
localizedNameId:  Input command locaized name Id
flags:  Input command flags
contextMenuExtensionType:  Input context menu flags

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags,System.String)
Constructs an object with a global name, command flags, group name, localized ID name, and help topic.
groupName:  Input command group name
globalName:  Input command global name
localizedNameId:  Input command localized name Id
flags:  Input command flags
helpTopic:  Input help topic string

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.#ctor(System.String,System.String,System.String,Autodesk.AutoCAD.Runtime.CommandFlags,System.Type,System.String,System.String)
Constructs an object with a global name, command flags, group name, localized ID name, help topic, help file name, and context menu flags.
groupName:  Input command group name
globalName:  Input command global name
localizedNameId:  Input command localized name Id
flags:  Input command flags
contextMenuExtensionType:  Input context menu flags
helpFileName:  Input help file name
helpTopic:  Input help topic string

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.GlobalName
Returns the GlobalName property value.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.LocalizedNameId
Returns the LocalizedNameId property value.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.GroupName
Returns the GroupName property value.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.Flags
Returns the Flags property value.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.ContextMenuExtensionType
Returns the ContextMenuExtensionType property value.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.HelpFileName
Returns the HelpFileName property value.

Autodesk.AutoCAD.Runtime.CommandMethodAttribute.HelpTopic
Returns the HelpTopic property value.