Autodesk.AutoCAD.EditorInput.SelectionDetails
This class represents additional details about the selection.

Autodesk.AutoCAD.EditorInput.SelectionDetails.GetContainers
Returns an array of object IDs representing the containers of this nested entity.

Autodesk.AutoCAD.EditorInput.SelectionDetails.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.SelectionDetails.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.SelectionDetails.Transform
Gets the transformation matrix that is applied to the picked object by its containers.