Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs
This class provides data for the DocumentLockModeWillChange event of the DocumentCollection class.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.Document
Wraps the AcApDocManager::document() ObjectARX function, which returns the document that the input database belongs to.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.MyNewMode
Accesses the new lock mode being requested.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.MyCurrentMode
Accesses the current locks that this fiber has on the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.CurrentMode
Accesses the current lock mode of the document.

Autodesk.AutoCAD.ApplicationServices.DocumentLockModeWillChangeEventArgs.GlobalCommandName
Accesses the name of the command that is requesting the change.