Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs
This class provides data for the PromptForEntityEnding event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs.RemoveSelectedObject
Removes the selected object based on prompt selection.

Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs.ReplaceSelectedObject(Autodesk.AutoCAD.EditorInput.SelectedObject)
Replaces the selected object with newValue.
newValue:  Input new value

Autodesk.AutoCAD.EditorInput.PromptForEntityEndingEventArgs.Result
The result of the prompt operation.