Autodesk.AutoCAD.ApplicationServices.LongTransactionManager
This wraps the ObjectARX AcApLongTransactionManager class.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.CheckOut(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.IdMapping,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This .NET method wraps the ObjectARX AcApLongTransactionManager::checkOut() method.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.CheckIn(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.IdMapping,System.Boolean)
This .NET method wraps the ObjectARX AcApLongTransactionManager::checkIn() method.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.AbortLongTransaction(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This .NET method wraps the ObjectARX AcApLongTransactionManager::abortLongTransaction() method.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.CurrentLongTransactionFor(Autodesk.AutoCAD.ApplicationServices.Document)
This .NET method wraps the ObjectARX AcApLongTransactionManager::currentLongTransactionFor() method.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.AddClassFilter(Autodesk.AutoCAD.Runtime.RXClass)
This .NET method wraps the ObjectARX wraps the AcApLongTransactionManager::addClassFilter() method.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.IsFiltered(Autodesk.AutoCAD.Runtime.RXClass)
This wraps the ObjectARX AcApLongTransactionManager.isFiltered() method.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.CheckingOut
Event handler for checking out events.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.CheckedOut
Event handler for checked out events.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.CheckingIn
Event handler for checking in events.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.CheckedIn
Event handler for checked in events.

Autodesk.AutoCAD.ApplicationServices.LongTransactionManager.Aborted
Event handler for aborted events.