Autodesk.AutoCAD.PlottingServices.PlotConfig
This .NET class wraps the AcPlPlotConfig ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotConfig.SaveToPC3(System.String)
Saves the current plotter configuration to the specified PC3 file name.
name:  Input PC3 file name.

Autodesk.AutoCAD.PlottingServices.PlotConfig.RefreshMediaNameList
Refreshes the media information for the current device or PC3 file.

Autodesk.AutoCAD.PlottingServices.PlotConfig.GetMediaBounds(System.String)
Returns the media bounds (page size and printable bounds) corresponding to a canonical media name.
canonicalMediaName:  Input name of the driver for the device or PC3 file.

Autodesk.AutoCAD.PlottingServices.PlotConfig.GetLocalMediaName(System.String)
Returns the localized media name for the canonical media name that is passed in.
canonicalMediaName:  Input canonical name of the media size whose localized name is being requested.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DriverName
Returns DriverName property value.

Autodesk.AutoCAD.PlottingServices.PlotConfig.LocationName
Returns the localized media name for the canonical media name that is passed in.

Autodesk.AutoCAD.PlottingServices.PlotConfig.Comment
Returns a list of media sizes that are supported for the current device or the PC3 files.

Autodesk.AutoCAD.PlottingServices.PlotConfig.PortName
Returns the PortName property value.

Autodesk.AutoCAD.PlottingServices.PlotConfig.ServerName
Returns the ServerName property value.

Autodesk.AutoCAD.PlottingServices.PlotConfig.TagLine
Returns the TagLine property value.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DeviceName
Returns the device name or PC3 file name.

Autodesk.AutoCAD.PlottingServices.PlotConfig.FullPath
Returns the current device or PC3 file name.

Autodesk.AutoCAD.PlottingServices.PlotConfig.CanonicalMediaNames
Returns a list of media sizes that are supported for the current device or the PC3 files.

Autodesk.AutoCAD.PlottingServices.PlotConfig.IsPlotToFile
Returns true if the device is currently configured to plot to a file.

Autodesk.AutoCAD.PlottingServices.PlotConfig.DefaultFileExtension
Returns a character string containing the default file extensions for plot files created by this device (for example, ".DWF").

Autodesk.AutoCAD.PlottingServices.PlotConfig.PlotToFileCapability
Returns the device's inherent capabilities for plotting to a file.