Autodesk.AutoCAD.EditorInput.PromptStringOptions
This class represents optional parameters for a prompt for a string.

Autodesk.AutoCAD.EditorInput.PromptStringOptions.#ctor(System.String)
Constructor.
message:  Input.

Autodesk.AutoCAD.EditorInput.PromptStringOptions.AllowSpaces
Gets or sets whether the prompt should allow spaces.

Autodesk.AutoCAD.EditorInput.PromptStringOptions.DefaultValue
Returns the DefaultValue property value.

Autodesk.AutoCAD.EditorInput.PromptStringOptions.UseDefaultValue
Returns the UseDefaultValue property value.