Autodesk.AutoCAD.PlottingServices.Dwf3dOptions
This .NET class wraps the AcPl3DDwfOptions ObjectARX struct.

Autodesk.AutoCAD.PlottingServices.Dwf3dOptions.GroupByXrefHierarchy
Groups the DWF 3d object by Xref hierarchy.

Autodesk.AutoCAD.PlottingServices.Dwf3dOptions.PublishWithMaterials
Publishes the DWF 3d object with materials.