Autodesk.AutoCAD.EditorInput.PromptEntityOptions
This class represents optional parameters for a prompt for an entity.

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.SetRejectMessage(System.String)
This method sets message as the prompt that is posted if the type of a picked entity is not allowed for this selection.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.AddAllowedClass(System.Type,System.Boolean)
This method adds type to the internal list of classes allowed for the selection. If exactMatch is true, then only objects of the exact class type are allowed. Otherwise, objects of the specified type and of any derived types are allowed.
If type is already in the class list, the value of exactMatch is applied to the existing class entry.
type:  Input type of class
exactMatch:  Input boolean for exact type

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.RemoveAllowedClass(System.Type)
This method removes the class indicated by type from the internal list of classes allowed for this selection.
type:  Input type of class

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.AllowNone
Gets or sets whether the prompt accepts ENTER as sole input.

Autodesk.AutoCAD.EditorInput.PromptEntityOptions.AllowObjectOnLockedLayer
Gets or sets whether the prompt allows object on locked layer entities.