Autodesk.AutoCAD.EditorInput.PickPointSelectedObject
This class describes an object that was selected by a single pick.

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Constructor.
id:  Input object ID
method:  Input method of selection
gsMarker:  Input GS markers
descriptor:  Input pick point descriptor

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.#ctor(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64,Autodesk.AutoCAD.EditorInput.PickPointDescriptor)
Obsolete - Use the constructor overload taking IntPtr instead.
id:  Input object ID
method:  Input method of selection
gsMarker:  Input GS markers
descriptor:  Input pick point descriptor

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PickPointSelectedObject.PickPoint
Gets the pick point that was used to select the object.