Autodesk.AutoCAD.ApplicationServices.CommandEventArgs
This class provides data for various events of a Document.

Autodesk.AutoCAD.ApplicationServices.CommandEventArgs.#ctor
Default constructor.

Autodesk.AutoCAD.ApplicationServices.CommandEventArgs.GlobalCommandName
Accesses the name of the command that raised this event.