Autodesk.AutoCAD.GraphicsSystem.ViewEventArgs
This is a container for the Autodesk.AutoCAD.GraphicsSystem.View object.

Autodesk.AutoCAD.GraphicsSystem.ViewEventArgs.#ctor
Constructor.

Autodesk.AutoCAD.GraphicsSystem.ViewEventArgs.View
Returns the GraphicsSystem.View object contained in this class.