Autodesk.AutoCAD.EditorInput.PointMonitorEventArgs
This class provides data for the PointMonitor event.

Autodesk.AutoCAD.EditorInput.PointMonitorEventArgs.AppendToolTipText(System.String)
Appends tool tip text value to this event.
value:  Input item to be appended.

Autodesk.AutoCAD.EditorInput.PointMonitorEventArgs.Context
Gets an object that provides input data for this event.