Autodesk.AutoCAD.ApplicationServices.SystemVariableChangingEventArgs
Contains parameters related to system variable events.

Autodesk.AutoCAD.ApplicationServices.SystemVariableChangingEventArgs.Name
Accesses the system variable name being changed.