Autodesk.AutoCAD.EditorInput.PromptAngleOptionsEventArgs
This class provides data for the PromptingForAngle event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptAngleOptionsEventArgs.Options
Gets the input parameters of the prompt.