Autodesk.AutoCAD.EditorInput.PromptDoubleResult
This class holds the result of a prompt that returns a double as its primary result.

Autodesk.AutoCAD.EditorInput.PromptDoubleResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptDoubleResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptDoubleResult.Value
Gets the double that the user entered.