Autodesk.AutoCAD.Publishing.PublishUIEventArgs
This class provides data for the PublishUI event.

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.ReadPrivateSection(System.String)
Reads the private section.
sectionName:  Input section name to read from

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.IUnknown
Returns the IUnknown property value.

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.DsdData
.

Autodesk.AutoCAD.Publishing.PublishUIEventArgs.JobWillPublishInBackground
Returns the JobWillPublishInBackground property value.