Autodesk.AutoCAD.PlottingServices.PlotReactorManager
This .NET class wraps the AcPlPlotReactorMgr ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.BeginPlot
Called by the plotting framework when PlotEngine.BeginPlot() has been called by an application.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.BeginDocument
Called by the plotting framework when PlotEngine.BeginDocument() has been called by an application.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.BeginPage
Called by the plotting framework when PlotEngine.BeginPage() has been called by an application.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.EndPlot
Called by the plotting framework when PlotEngine.endPlot() has been called by an application.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.EndDocument
Called by the plotting framework when PlotEngine.EndDocument() has been called by an application.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.EndPage
Called by the plotting framework when PlotEngine.EndPage() has been called by an application.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.PlotCancelled
Called by the framework when the user has canceled the plot.

Autodesk.AutoCAD.PlottingServices.PlotReactorManager.PageCancelled
Called by the framework when the user has canceled the current page.