Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection
This is class Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection.

Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection.Remove(System.String)
This is Remove, a member of class RecentDocumentCollection.

Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection.DocumentClosed
This is DocumentClosed, a member of class RecentDocumentCollection.

Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection.DocumentPinStateChanged
This is DocumentPinStateChanged, a member of class RecentDocumentCollection.

Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection.Dispose
This is Dispose, a member of class RecentDocumentCollection.

Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection.Instance
This is Instance, a member of class RecentDocumentCollection.

Autodesk.AutoCAD.ApplicationServices.RecentDocumentCollection.UsePinnedItems
This is UsePinnedItems, a member of class RecentDocumentCollection.