Autodesk.AutoCAD.Publishing.EPlotPropertyBag
This .NET class corresponds to the AcDMMEPlotProperties ObjectARX class.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.#ctor
Default constructor.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.Id
Returns the Id property value.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.NamespaceUrl
Returns the NameSpaceUrl property value.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.NamespaceLocation
Returns the NameSpaceLocation property value.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.References
Returns the References property value.

Autodesk.AutoCAD.Publishing.EPlotPropertyBag.Properties
Accesses the Properties property value.