Autodesk.AutoCAD.Publishing.PublishEventArgs
This class provides data for the Publish event.

Autodesk.AutoCAD.Publishing.PublishEventArgs.DwfFileName
Returns the DwfFileName property value.

Autodesk.AutoCAD.Publishing.PublishEventArgs.TemporaryDwfFileName
Returns the TemporaryDwfFileName property value.

Autodesk.AutoCAD.Publishing.PublishEventArgs.DwfPassword
Returns the DwfPassword property value.

Autodesk.AutoCAD.Publishing.PublishEventArgs.IsMultiSheetDwf
Returns the IsMultiSheetDwf property value.