Autodesk.AutoCAD.Windows.Window
This class represents an operating system window.

Autodesk.AutoCAD.Windows.Window.FromHandle(System.IntPtr)
This is FromHandle, a member of class Window.

Autodesk.AutoCAD.Windows.Window.Close
Closes an active window.

Autodesk.AutoCAD.Windows.Window.Focus
This method sets focus to the window on which it is called.

Autodesk.AutoCAD.Windows.Window.UnmanagedWindow
This is UnmanagedWindow, a member of class Window.

Autodesk.AutoCAD.Windows.Window.Handle
Implements IWin32Window.Handle.

Autodesk.AutoCAD.Windows.Window.WindowState
Assesses whether a window is restored, minimized, or maximized.

Autodesk.AutoCAD.Windows.Window.Visible
Accesses the visible property value.

Autodesk.AutoCAD.Windows.Window.DeviceIndependentLocation
Accesses the device-independent location value.

Autodesk.AutoCAD.Windows.Window.DeviceIndependentSize
Accesses the device-independent size value.

Autodesk.AutoCAD.Windows.Window.Text
Accesses the text in the active window.