Autodesk.AutoCAD.Publishing.EPlotProperty
This .NET class corresponds to the AcDMMEPlotProperty ObjectARX class.

Autodesk.AutoCAD.Publishing.EPlotProperty.#ctor
Default constructor.

Autodesk.AutoCAD.Publishing.EPlotProperty.AddEplotAttribute(Autodesk.AutoCAD.Publishing.EPlotAttribute)
Adds a new XMLAttribute object to the internal vector of XML Attributes.
att:  Input XML attribute object to be added to the XML attributes vector.

Autodesk.AutoCAD.Publishing.EPlotProperty.AddEPlotAttribute(System.String,System.String,System.String,System.String)
Creates and adds a new XMLAttribute object to the internal vector of XML Attributes.
ns:  Input namespace name.
nsUrl:  Input the attribute's namespace location.
attName:  Input attribute name.
attValue:  Input attribute value.

Autodesk.AutoCAD.Publishing.EPlotProperty.Type
Returns the Type property value.

Autodesk.AutoCAD.Publishing.EPlotProperty.Units
Returns the Units property value.

Autodesk.AutoCAD.Publishing.EPlotProperty.Category
Returns the Category property value.

Autodesk.AutoCAD.Publishing.EPlotProperty.Name
Returns the Name property value.

Autodesk.AutoCAD.Publishing.EPlotProperty.Value
Returns the Value property value.

Autodesk.AutoCAD.Publishing.EPlotProperty.Attributes
Accesses the Attributes property value.