Autodesk.AutoCAD.PlottingServices.PlotEngine
This .NET class wraps the AcPlPlotEngine ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginPlot(Autodesk.AutoCAD.PlottingServices.PlotProgress,System.Object)
Call this function when not already plotting.
plotProgress:  Input plot progress
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndPlot(System.Object)
Closes a call to BeginPlot().
parameters:  Input caller-allocated PREVIEWENDPLOT structure.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndDocument(System.Object)
Closes a call to BeginDocument().
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginPage(Autodesk.AutoCAD.PlottingServices.PlotPageInfo,Autodesk.AutoCAD.PlottingServices.PlotInfo,System.Boolean,System.Object)
Call this function when plotting a document but not already in a page. Close by calling endPage().
The layout referenced in plotInfo must be active. The plotInfo object must be validated and must be document-compatible with the PlotInfo object passed to BeginDocument(). plotInfo may refer to the same object passed to BeginDocument().
pageInfo:  Input page information, modified in this call to reflect the pre-scan of the page.
plotInfo:  Input reference to the validated PlotInfo for this page.
lastPage:  Input indicating whether this is the last page in the document.
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndPage(System.Object)
Closes a call to BeginPage().
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.BeginGenerateGraphics(System.Object)
Call this function when plotting a page but not already generating graphics.
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.EndGenerateGraphics(System.Object)
Closes a call to BeginGenerateGraphics().
parameters:  Reserved for future use.

Autodesk.AutoCAD.PlottingServices.PlotEngine.Destroy
Destroys the plot engine and unlocks the plotting pipeline.

Autodesk.AutoCAD.PlottingServices.PlotEngine.IsBackgroundPackaging
Determines whether the engine is packaging for a background plot.