Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager
This class manages global, user profile, and dialog sections of the Windows registry for AutoCAD host applications.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.OpenGlobalSection
This method opens the product's root key in the HKEY_CURRENT_USER section of the registry.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.OpenCurrentProfile
This method attempts to open the registry section corresponding the current user profile.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.OpenDialogSection(System.Object)
This method attempts to open the registry section corresponding the input dialog name in the current user profile.
dialog:  Input System.Object object. Input dialog name whose registry entry is to be retrieved.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.CurrentProfileChanging
This event is fired when the current profile is changing.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.CurrentProfileChanged
This event is fired when the current profile has changed.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.CurrentProfileResetting
This event is fired when the current profile is resetting.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.CurrentProfileReset
This event is fired when the current profile has been reset.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.CurrentProfileSaving
This event is fired when the current profile is saving.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.CurrentProfileSaved
This event is fired when the current profile has saved.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.ProfileResetting
This event is fired when the profile is resetting.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.ProfileReset
This event is fired when the profile has been reset.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.ProfileSaving
This event is fired while the profile is saving.

Autodesk.AutoCAD.ApplicationServices.UserConfigurationManager.ProfileSaved
This event is fired when the profile has saved.