Autodesk.AutoCAD.ApplicationServices.Document
This class wraps the AcApDocument ObjectARX class.

Autodesk.AutoCAD.ApplicationServices.Document.Create(System.IntPtr)
Creates a new managed object from an unmanaged pointer.
unmanagedPointer:  Input unmanaged pointer

Autodesk.AutoCAD.ApplicationServices.Document.SendStringToExecute(System.String,System.Boolean,System.Boolean,System.Boolean)
Executes a particular string.
command:  Input document to send input to.
activate:  Input Boolean indicating whether to activate the target document.
wrapUpInactiveDoc:  Input Boolean indicating whether to queue current active document to complete in the next OnIdle() when switching active documents.
echoCommand:  Input Boolean indicating whether the sent string is echoed on the command line.

Autodesk.AutoCAD.ApplicationServices.Document.LockDocument
Locks the document.

Autodesk.AutoCAD.ApplicationServices.Document.LockDocument(Autodesk.AutoCAD.ApplicationServices.DocumentLockMode,System.String,System.String,System.Boolean)
Locks the document using a specific mode.
lockMode:  Input one of the locking modes from DocumentLockMode enum.
globalCommandName:  Input command name.Each time a document is locked, it is considered the beginning of a "command", or action in Acad. This name is passed back by the doc manager reactor as the name of the command doing the locking. It can be NULL.
localCommandName:  Input name that is displayed on the command line if or when this command is undone.It can be NULL.
promptIfFails:  If the document cannot be locked, due to a command already in progress in the target document, and if prompt is true, the standard prompt will be issued, and the user will be given an opportunity to complete the command in the target document and the lock will succeed.If the user chooses to cancel the lock request, or prompt is false, then the lock change will fail

Autodesk.AutoCAD.ApplicationServices.Document.LockMode(System.Boolean)
This function provides a way for an application to determine if it could have permission to set a lock on a document. One rule about locking is that an execution context can override any of its own locks. If this application's context has an Exclusive Write lock, it can still apply another lock to the document.
Returns the highest level lock set by other execution contexts if bIncludeMyLocks == false. If bIncludeMyLocks == true, then the function will return the highest level lock set by any execution context, include this application.
bIncludeMyLocks:  Input Boolean indicating whether to consider this application's locks or just look at other context's locks.

Autodesk.AutoCAD.ApplicationServices.Document.LockMode
This function provides a way for an application to determine if it could have permission to set a lock on a document.

Autodesk.AutoCAD.ApplicationServices.Document.UpgradeDocOpen
Converts the document status from read only to write, if possible.

Autodesk.AutoCAD.ApplicationServices.Document.DowngradeDocOpen(System.Boolean)
Converts the document status from writeable to read only.
If bPromptForSave is true and the drawing is modified (based on dbmod), the user is prompted to save the drawing. If bPromptForSave is false and the drawing has been modified, an error is returned.
bPromptForSave:  Input Boolean to determine if a save prompt is necessary

Autodesk.AutoCAD.ApplicationServices.Document.SetLispSymbol(System.String,System.Object)
This is SetLispSymbol, a member of class Document.

Autodesk.AutoCAD.ApplicationServices.Document.GetLispSymbol(System.String)
This is GetLispSymbol, a member of class Document.

Autodesk.AutoCAD.ApplicationServices.Document.UnknownCommand
Wraps the AcEditorReactor.unknownCommand() ObjectARX function.
This event allows applications to respond to users' attempts to execute commands that AutoCAD does not recognize.

Autodesk.AutoCAD.ApplicationServices.Document.CommandWillStart
Wraps the AcEditorReactor.commandWillStart() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.CommandEnded
Wraps the AcEditorReactor.commandEnded() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.CommandCancelled
Wraps the AcEditorReactor.commandcanceled() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.CommandFailed
Wraps the AcEditorReactor.commandFailed() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.LispWillStart
Wraps the AcEditorReactor.lispWillStart() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.LispEnded
Wraps the AcEditorReactor::lispEnded() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.LispCancelled
Wraps the AcEditorReactor.lispcanceled() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.BeginDocumentClose
Wraps the AcEditorReactor2.beginDocClose() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.CloseAborted
Wraps the AcEditorReactor2.docCloseAborted() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.CloseWillStart
Wraps the AcEditorReactor2.docCloseWillStart() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.ImpliedSelectionChanged
Wraps the AcEditorReactor2.pickfirstModified() ObjectARX function.

Autodesk.AutoCAD.ApplicationServices.Document.ViewChanged
This is ViewChanged, a member of class Document.

Autodesk.AutoCAD.ApplicationServices.Document.LayoutSwitched
This event is fired when the layout is switching.

Autodesk.AutoCAD.ApplicationServices.Document.LayoutSwitching
This event is fired when the layout is switched.

Autodesk.AutoCAD.ApplicationServices.Document.FormatForSave
The DocumentSaveFormat for the document.

Autodesk.AutoCAD.ApplicationServices.Document.Database
Wraps the AcApDocument.database() ObjectARX function, which returns the database object (Database) being used by this Document.

Autodesk.AutoCAD.ApplicationServices.Document.TransactionManager
Accesses the TransactionManager object for this Document.

Autodesk.AutoCAD.ApplicationServices.Document.UserData
Accesses the user data.

Autodesk.AutoCAD.ApplicationServices.Document.GraphicsManager
Accesses the graphics manager.

Autodesk.AutoCAD.ApplicationServices.Document.IsReadOnly
Accesses if the document is read-only or not.

Autodesk.AutoCAD.ApplicationServices.Document.IsActive
Assesses if the document is active or not.

Autodesk.AutoCAD.ApplicationServices.Document.IsNamedDrawing
Returns true if the drawing for this document is a named file on the disk (as opposed to a new drawing that has not yet been saved).

Autodesk.AutoCAD.ApplicationServices.Document.Editor
Accesses the Editor associated with this document.

Autodesk.AutoCAD.ApplicationServices.Document.Window
Accesses the window.

Autodesk.AutoCAD.ApplicationServices.Document.CommandInProgress
Accesses the command name string.

Autodesk.AutoCAD.ApplicationServices.Document.Name
Accesses the name of the document.