Autodesk.AutoCAD.Runtime.PerDocumentClassAttribute
This custom attribute class is used to mark a type so that an instance of that type will be instantiated for each document open/opened in AutoCAD.

Autodesk.AutoCAD.Runtime.PerDocumentClassAttribute.Type
This is Type, a member of class PerDocumentClassAttribute.