Autodesk.AutoCAD.Publishing.EPlotResource
This .NET class corresponds to the AcDMMResourceInfo ObjectARX class.

Autodesk.AutoCAD.Publishing.EPlotResource.#ctor
Default constructor.

Autodesk.AutoCAD.Publishing.EPlotResource.Role
Returns the Role property value.

Autodesk.AutoCAD.Publishing.EPlotResource.Mime
Returns the Mime property value.

Autodesk.AutoCAD.Publishing.EPlotResource.Path
Returns the Path property value.