Autodesk.AutoCAD.EditorInput.RolloverEventArgs
.

Autodesk.AutoCAD.EditorInput.RolloverEventArgs.Picked
Assesses the picked paths.

Autodesk.AutoCAD.EditorInput.RolloverEventArgs.Highlighted
Assesses the highlighted paths.