Autodesk.AutoCAD.EditorInput.PromptDoubleOptions
This class represents optional parameters for a prompt for a double.

Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input prompt message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.PromptDoubleOptions.DefaultValue
The default value to be used when the user presses ENTER without any other input.