Autodesk.AutoCAD.Runtime.SystemVariableEnumerator
This class provides a way to iterator over all of the public system variables and get their names, data type, range (if applicable), read-only status, and how they are stored.

Autodesk.AutoCAD.Runtime.SystemVariableEnumerator.#ctor
Constructor.

Autodesk.AutoCAD.Runtime.SystemVariableEnumerator.MoveNext
This method moves the iterator to the next sysvar and returns true if there are more sysvars after the one just moved to.

Autodesk.AutoCAD.Runtime.SystemVariableEnumerator.Reset
This method resets the enumerator to the first sysvar.

Autodesk.AutoCAD.Runtime.SystemVariableEnumerator.Current
Returns a Variable object containing the data of the current sysvar in the enumerator.