Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult
This class holds the result of a prompt that returns a nested entity as its primary result.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult.GetContainers
Gets an array of containers in which this entity is nested.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input for culture-specific format

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult.ToString
Returns an equivalent string representation of this object.

Autodesk.AutoCAD.EditorInput.PromptNestedEntityResult.Transform
Gets the transformation matrix that is applied to the picked object by its containers.