Autodesk.AutoCAD.EditorInput.PromptFileOptions
This is a base class for the File dialog options.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.Message
Returns the message prompt string.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.DialogCaption
Returns the dialog caption string.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.DialogName
Returns the dialog name string.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.Filter
Returns the filter string.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.FilterIndex
Returns the index point of filter.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.InitialFileName
Returns the initial file name string.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.InitialDirectory
Return the initial directory string.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.PreferCommandLine
Returns Boolean indicating whether command line is given the first preference.

Autodesk.AutoCAD.EditorInput.PromptFileOptions.AllowUrls
Returns true if urls are allowed in the prompt options.