Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject
This class encapsulates a subobject that is selected by the fence selection method.

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr,Autodesk.AutoCAD.EditorInput.PickPointDescriptor[])
Constructor.
path:  Input subentitiy path
method:  Input selection method
gsMarker:  Input GS marker
descriptors:  Input pick points

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64,Autodesk.AutoCAD.EditorInput.PickPointDescriptor[])
Obsolete - Use the constructor overload taking IntPtr instead.
path:  Input subentitiy path
method:  Input selection method
gsMarker:  Input GS marker
descriptors:  Input pick points

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.GetIntersectionPoints
Returns the point descriptor array.

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.EditorInput.FenceSelectedSubObject.ToString
Returns an equivalent string representation of this object.