Autodesk.AutoCAD.Runtime.JavaScriptClassAttribute
This is class Autodesk.AutoCAD.Runtime.JavaScriptClassAttribute.

Autodesk.AutoCAD.Runtime.JavaScriptClassAttribute.Type
This is Type, a member of class JavaScriptClassAttribute.