Autodesk.AutoCAD.EditorInput.SelectionFilter
This class describes the kind of filtering to be applied to the object during a selection prompt.

Autodesk.AutoCAD.EditorInput.SelectionFilter.#ctor(Autodesk.AutoCAD.DatabaseServices.TypedValue[])
Constructor.
value:  Input Autodesk.AutoCAD.DatabaseServices.TypedValue[] object.

Autodesk.AutoCAD.EditorInput.SelectionFilter.GetFilter
Returns an array of TypeValues that contains the filtering instructions.