Autodesk.AutoCAD.Publishing.EPlotAttributeCollection
This class contains a collection of Publishing.EPlotAttribute objects.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.CopyTo(System.Array,System.Int32)
Copies the entire collection to another zero-based array.
array:  Input target array.
index:  Input the zero-based index in array at which copying begins.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.Add(Autodesk.AutoCAD.Publishing.EPlotAttribute)
Adds this value to the attribute collection.
value:  Input object to be added.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.Clear
Deletes the attribute collection objects.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.IsSynchronized
Returns true if the EPlotAttributes are synchronized, esle false.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.SyncRoot
Returns SyncRoot property value.

Autodesk.AutoCAD.Publishing.EPlotAttributeCollection.Count
Number of EPlotAttributes in the collection.