Autodesk.AutoCAD.ApplicationServices.ConfigurationSectionNameAttribute
This class defines an attribute that is used to define and retrieve a configuration section name.

Autodesk.AutoCAD.ApplicationServices.ConfigurationSectionNameAttribute.#ctor(System.String)
Constructor.
name:  Input a System.String object which represents the name of the Configuration Section.

Autodesk.AutoCAD.ApplicationServices.ConfigurationSectionNameAttribute.Name
Accesses the name property value.