Autodesk.AutoCAD.Publishing.PublishEntityEventArgs
This class provides data for the PublishEntity event.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Flush
Forces the graphic pipeline to be flushed, to ensure synchronization.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Cancel
Cancels the entire plot operation.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetCurrentEntityNode(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Determines if this entity has already been assigned a node.
objIds:  Input collection holder

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetNextAvailableNode
Returns the next unused integer node number.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetEntityNode(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Looks up any entity ID in the map of ID-to-node to determine whether the node has already been assigned to a particular entity.
entityId:  Input object to look up.
objIds:  Input array of object IDs for each block that encloses this entity; may be an empty array if this entity is not part of a block.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.SetCurrentNode(System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
Determines which node is assigned to the current entity.
nodeId:  Input node ID to assign.
objIds:  Input array of object IDs for each block that encloses this entity; an empty array if this entity is not part of a block.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.SetNodeName(System.Int32,System.String)
Allows a client to change the node name but not the node number.
nodeId:  Input node ID on which to operate, which should exist in the map and should be greater than 0
nodeName:  Input node name to assign to the specified node.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.AddPropertyBag(Autodesk.AutoCAD.Publishing.EPlotPropertyBag)
Adds a property bag.
properties:  Input property bag to add

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.AddPropertiesIds(Autodesk.AutoCAD.Publishing.EPlotPropertyBag,Autodesk.AutoCAD.Publishing.DwfNode)
Assigns EPlot properties ID to a node.
properties:  Input property to add
node:  Input the node with which properties should be associated.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.AddNodeToMap(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Int32)
Assigns a node ID to any entity ID.
entityId:  Input object of the entity whose node ID is to be assigned.
objIds:  Input array of object IDs for each block that encloses this entity; an empty array if this entity is not part of a block.
nodeId:  Input the integer node ID to be assigned to the specified entity; should be greater than 0.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Add3DDwfProperty(System.String,System.String,System.String)
Call this method to add 3D DWF properties to entities when Reactor.OnBeginEntity notification is received.
category:  Input name of the category to which you want to add the property.
name:  Input property name.
value:  Input property value.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.GetGraphicIDs
Returns an array of graphic node IDs associated with this entity.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.getEntityBlockRefPath
Returns the block ref path for the current entity.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.PlotLogger
Accesses the PlotLogger property value.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.IsCancelled
Returns the Iscanceled property value.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.UniqueEntityId
Returns the UniqueEntityId property value.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.Entity
Accesses the Entity property value.

Autodesk.AutoCAD.Publishing.PublishEntityEventArgs.EffectiveBlockLayerId
Accesses the EffectiveBlockLayerId property value.