Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions
This is a base class for containers of input arguments for Jig sampling prompts that acquire geometric input.

Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.#ctor(System.String,System.String)
Constructor.
messageAndKeywords:  Input prompt message and keywords
globalKeywords:  Input global keywords

Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.#ctor(System.String)
Constructor.
message:  Input prompt message

Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.#ctor
Constructor.

Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.BasePoint
Returns the base point to be used by the prompt.

Autodesk.AutoCAD.EditorInput.JigPromptGeometryOptions.UseBasePoint
Returns a Boolean indicating whether the base point is to be used or not.