Autodesk.AutoCAD.ApplicationServices.LayoutSwitchedEventArgs
This is class Autodesk.AutoCAD.ApplicationServices.LayoutSwitchedEventArgs.

Autodesk.AutoCAD.ApplicationServices.LayoutSwitchedEventArgs.NewLayout
This is NewLayout, a member of class LayoutSwitchedEventArgs.