Autodesk.AutoCAD.PlottingServices.HostAppServices
This .NET class wraps the AcPlHostAppServices ObjectARX class.

Autodesk.AutoCAD.PlottingServices.HostAppServices.UpdatePlotJobStatus(Autodesk.AutoCAD.PlottingServices.AppPlotStatus,System.String)
Application implements this function to communicate plotting events, conditions, and results to the host application.
status:  Input Autodesk.AutoCAD.PlottingServices..AppPlotStatus object reflecting the state of the plot.
message:  Input for a plot message or DWF file name.

Autodesk.AutoCAD.PlottingServices.HostAppServices.PlotLogger
Applications implement this to return a PlotLogger object.