Autodesk.AutoCAD.EditorInput.PromptDoubleOptionsEventArgs
This class provides data for the PromptingForDouble event of the Editor class.

Autodesk.AutoCAD.EditorInput.PromptDoubleOptionsEventArgs.Options
Gets the input parameters of the prompt.