Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject
This class encapsulates a subobject that is selected by the crossing or window selection method.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.IntPtr)
Constructor.
path:  Input path of object
method:  Input method of selection
gsMarker:  Input any GS markers

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath,Autodesk.AutoCAD.EditorInput.SelectionMethod,System.Int64)
Obsolete - Use the constructor overload taking IntPtr instead.
path:  Input path of object
method:  Input method of selection
gsMarker:  Input any GS markers

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.GetPickPoints
Returns the list of pick points used to select the subobject.

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input culture-specific format

Autodesk.AutoCAD.EditorInput.CrossingOrWindowSelectedSubObject.ToString
Returns an equivalent string representation of this object.