Autodesk.AutoCAD.PlottingServices.PlotConfigInfo
This .NET class wraps the AcPlPlotConfigInfo ObjectARX class.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.#ctor
Default constructor.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.Clone
Clones PlotConfigInfo data and returns it.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.FullPath
Returns the current device or PC3 file name.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.DeviceName
Returns the device name or PC3 file name.

Autodesk.AutoCAD.PlottingServices.PlotConfigInfo.DeviceType
.