Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetUnderLinePoints
This function returns an array of two points that define the underline for this object, if any is defined.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetOverLinePoints
This function returns an array of two points that define the overline for this object, if any is defined.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.GetStrikethroughPoints
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.MTextFragment.Strikethrough
This wraps the AcDbMTextFragment::strikePoints[2].