Autodesk.AutoCAD.DatabaseServices.Surface.FilletEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
This .NET method wraps the ObjectARX method AcDbSurface::filletEdges Method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateExtrudedSurface(Autodesk.AutoCAD.DatabaseServices.Profile3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
This wraps: AcDbSurface::createExtrudedSurface (edSurface) method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateLoftedSurface(Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftOptions)
This wraps the ObjectARX AcDbLoftedSurface::createLoftedSurface ( ) method.

Autodesk.AutoCAD.DatabaseServices.Surface.CreateLoftedSurface(Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile[],Autodesk.AutoCAD.DatabaseServices.LoftProfile,Autodesk.AutoCAD.DatabaseServices.LoftOptions,System.Boolean)
This wraps the ObjectARX AcDbLoftedSurface::createLoftedSurface ( ) method.