Autodesk.AutoCAD.DatabaseServices.SectionViewStyle
.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.#ctor
This is SectionViewStyle, a member of class SectionViewStyle.

Autodesk.AutoCAD.DatabaseServices.SectionViewStyle.GetViewLabelPattern(Autodesk.AutoCAD.DatabaseServices.Field)
This method gets the pattern for view label.
field:  Input: a field object to be updated with the view label pattern master field.