Autodesk.AutoCAD.DatabaseServices.RasterImage.#ctor
The constructor for this class is declared protected, so it cannot be accessed directly by most other applications.

Autodesk.AutoCAD.DatabaseServices.RasterImage.ImageSize(System.Boolean)
the raw image size in pixels. (The image size is also available directly from the RasterImageDef object.)
Under certain rare conditions the cached value will temporarily be different from the value kept in the RasterImageDef object (for example, immediately after the image size has been changed by a raster edit operation but before the RasterImage entity cache is updated).
If bGetCachedValue is false (default), the image size request is forwarded to the associated RasterImageDef object. If that object can't be opened, then a locally cached value is used. If bGetCachedValue is true, the function is forced to return the cached value.
getCachedValue:  Input Boolean indicating whether the cached should be used