Autodesk.AutoCAD.DatabaseServices.PlotSettings.AddToPlotSettingsDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
This method adds plot settings to the dictionary.
toWhichDatabase:  Input database to which to add plot settings object

Autodesk.AutoCAD.DatabaseServices.PlotSettings.ShadePlotId
Accesses the ObjectId of the VisualStyle  or RenderSettings object referenced by this object.