Autodesk.AutoCAD.DatabaseServices.Vertex2d.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double,System.Double)
Constructor.
position:  Input Autodesk.AutoCAD.Geometry.Point3d object.
bulge:  Input System.Double object.
startWidth:  Input System.Double object.
endWidth:  Input System.Double object.
tangent:  Input System.Double object.

Autodesk.AutoCAD.DatabaseServices.Vertex2d.#ctor
Constructor.