Autodesk.AutoCAD.DatabaseServices.Solid.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.Solid.GetPointAt(System.Int16)
This function fills the output value of the desired point with the value of the point in the solid whose index is index.
index:  Input index (1-4) of the desired point in the solid

Autodesk.AutoCAD.DatabaseServices.Solid.SetPointAt(System.Int16,Autodesk.AutoCAD.Geometry.Point3d)
This function sets the index'th point in the solid to the pointValue.
index:  Input index (1-4) of the point to set in the solid
pointValue:  Input point value