Autodesk.AutoCAD.DatabaseServices.Viewport.ThawAllLayersInViewport
This function thaws, in this viewport only, all the layers currently frozen in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.GetFrozenLayers
This function returns a collection of the objectIds of all LayerTableRecords currently frozen in the viewport.

Autodesk.AutoCAD.DatabaseServices.Viewport.IsLayerFrozenInViewport(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function returns true if the LayerTableRecord with objectId layerId is frozen in the viewport.
layerId:  Input id of the LayerTableRecord in question

Autodesk.AutoCAD.DatabaseServices.Viewport.UpdateDisplay
This function updates the onscreen display to reflect any changes made to the viewport's view parameters.

Autodesk.AutoCAD.DatabaseServices.Viewport.GetUcs(Autodesk.AutoCAD.Geometry.Point3d&,Autodesk.AutoCAD.Geometry.Vector3d&,Autodesk.AutoCAD.Geometry.Vector3d&)
This function returns the origin, x-axis, and y-axis of the ucs for this viewport.
origin:  Input origin
: Input x-axis
y:  Input y-axis

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the UCS for this viewport.
userCoordinateSystemId:  Input reference to a valid UcsTableRecord object

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This function sets the UCS for this viewport as defined by origin, x, and y.
origin:  Input origin
: Input X axis
y:  Input Y axis

Autodesk.AutoCAD.DatabaseServices.Viewport.SetUcsToWorld
This function sets the ucs for this viewport to the world ucs.