Autodesk.AutoCAD.Colors.Color.FromColor(System.Windows.Media.Color)
This is FromColor, a member of class Color.

Autodesk.AutoCAD.Colors.Color.FromColor(System.Drawing.Color)
Returns a new color object using value.
value:  Input object to obtain color from