Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.IdentifierPlacement
The identifer placement flags relating to the detail view symbol boundary.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextStyleId
The id of the text style table record to be associated to the detial view label text.

Autodesk.AutoCAD.DatabaseServices.DetailViewStyle.ViewLabelTextColor
The color for detial view label text.