Autodesk.AutoCAD.DatabaseServices.ViewBorder.#ctor
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.GetSourceType
This method gets the SourceType of the model documentation view - undefined, Inventor, Fusion, or model space.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.GetViewStyleType
This method gets the style type of the model documentation view -- from the base view, wireframe with visible edges, wireframe with hidden edges, shaded with visible edges, or shaded with hidden edges.

Autodesk.AutoCAD.DatabaseServices.ViewBorder.ViewportId
This method returns the ObjectID of the associated model documentation view's Viewport entity
Autodesk.AutoCAD.DatabaseServices.ObjectId.