Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData.GetIdData(Autodesk.AutoCAD.DatabaseServices.ObjectId)
Obsolete - Use the GetIdDataPtr property instead.
id:  Object ID that data is associated with