Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.ActiveFileName
Returns the name of the file that this  underlay references.

Autodesk.AutoCAD.DatabaseServices.UnderlayDefinition.Loaded
Returns a Boolean value indicating whether  the underlay is currently loaded.