Autodesk.AutoCAD.Runtime.RXClass.Create
This function creates a new instance of the C++ class that this RxClass object represents.

Autodesk.AutoCAD.Runtime.RXClass.GetRuntimeType
This is GetRuntimeType, a member of class RXClass.