Autodesk.AutoCAD.DatabaseServices.Sun.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.Sun.Intensity
Returns the intensity of the Sun  object.

Autodesk.AutoCAD.DatabaseServices.Sun.Azimuth
For internal use only.

Autodesk.AutoCAD.DatabaseServices.Sun.Altitude
For internal use only.