Autodesk.AutoCAD.DatabaseServices.UnderlayReference
This .Net class wraps AcDbUnderlayReference ObjectARX class.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ContrastLowerLimit
Returns the lower limit of the legal  contrast values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.ContrastUpperLimit
Returns the upper limit of the legal  contrast values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.FadeLowerLimit
Returns the lower limit of the legal  fade values.

Autodesk.AutoCAD.DatabaseServices.UnderlayReference.FadeUpperLimit
Returns the upper limit of the legal  fade values.