Autodesk.AutoCAD.DatabaseServices.Solid3d
.

Autodesk.AutoCAD.DatabaseServices.Solid3d.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateBox(System.Double,System.Double,System.Double)
This method is used for creating a box solid primitive with centroid at world origin.
lengthAlongX:  Input value for length of the box
lengthAlongY:  Input value for width of the box
lengthAlongZ:  Input value for height of the box

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateFrustum(System.Double,System.Double,System.Double,System.Double)
This method is used for creating a cylinder or cone with the world origin being centered about its diameter and positioned at half of the height.
height:  Input height for the frustum
radiusAlongX:  Input radius for the frustum in X direction
radiusAlongY:  Input radius for the frustum in Y direction
topRadius:  Input radius for top end of the frustum

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSphere(System.Double)
This method is used for creating a sphere with centroid at world origin and radius radius.
radius:  Input radius for the sphere

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateTorus(System.Double,System.Double)
This method is used for creating a torus with centroid at the WCS origin and using the WCS Z axis as the axis of rotational symmetry for the torus.
majorRadius:  Input major radius for the torus
minorRadius:  Input minor radius for the torus

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateWedge(System.Double,System.Double,System.Double)
This method is used for creating a wedge solid with center at the WCS origin.
lengthAlongX:  Input length for the wedge
lengthAlongY:  Input width for the wedge
lengthAlongZ:  Input height for the wedge

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreatePyramid(System.Double,System.Int32,System.Double,System.Double)
This method is used for creating a pyramid with the world origin being centered about its base and positioned at half of the height.
height:  Input height for pyramid
sides:  Input number of sides for pyramid
radius:  Input radius for inscribed circle of bottom polygon
topRadius:  Input radius for inscribed circle of top polygon

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateRevolvedSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Create revolved solid by revolving an entity or face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateRevolvedSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,Autodesk.AutoCAD.DatabaseServices.RevolveOptions)
Create revolved solid by revolving an entity or face.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSweptSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Create swept solid by sweeping an entity or face along a path.

Autodesk.AutoCAD.DatabaseServices.Solid3d.CreateSweptSolid(Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.Entity,Autodesk.AutoCAD.DatabaseServices.SweepOptions)
Create swept solid by sweeping an entity or face along a path.

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSection(Autodesk.AutoCAD.Geometry.Plane)
This function creates an Region entity that represents the intersection of plane with the solid, and returns the region that represents the section.
plane:  Input plane to use as the section cutting plane

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyEdge(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This method copies the specified edge as an AutoCAD entity, which can be an Line, AcDbCircle, AcDbArc, Ellipse, or AcDbSpline.
subEntityId:  Input subentity ID of an edge in the Solid3d

Autodesk.AutoCAD.DatabaseServices.Solid3d.CopyFace(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This method copies the specified face as an AutoCAD entity, which can be an Region if the face is planar, or otherwise will be an Body.
subEntityId:  Input subentity ID of a face in the Solid3d

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[],System.Double,System.Double)
This method extrudes faces of a solid by a distance of height with a taper angle of taper.
subentityIds:  Input array of subentity IDs of faces to be extruded; these faces must be planar
height:  Input extrusion distance to be applied to the specified faces. Use a positive value to extrude in the direction of the face normals, which point outward from the solid. Use a negative value to extrude faces into the solid.
taper:  Input angle of tapering to be applied to the extrusion; the tapering is relative to the axis formed from the center of each face in the direction of the face normal when a positive height is used or in the opposite direction when a negative height is used; this value should be between half pi and half pi

Autodesk.AutoCAD.DatabaseServices.Solid3d.ExtrudeFacesAlongPath(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.DatabaseServices.Curve)
This method extrudes the given faces along the given path curve entity, which must be an Line, AcDbArc, Circle, AcDbEllipse, AcDbSpline, AcDb2dPolyline, or a non-spline fit 3dPolyline.
subentityIds:  Input array of subentity IDs of faces to be extruded; these faces must be planar
path:  Input a curve object to extrude along

Autodesk.AutoCAD.DatabaseServices.Solid3d.ImprintEntity(Autodesk.AutoCAD.DatabaseServices.Entity)
This method intersects the given entity with the solid and imprints their intersection graph onto the solid.
entity:  Input entity to be imprinted

Autodesk.AutoCAD.DatabaseServices.Solid3d.OffsetBody(System.Double)
This method offsets all faces of the solid by the given distance.
offsetDistance:  Input distance to offset each face

Autodesk.AutoCAD.DatabaseServices.Solid3d.RemoveFaces(Autodesk.AutoCAD.DatabaseServices.SubentityId[])
This method removes the given faces, growing the adjacent faces to fill the gaps.
subentityIds:  Input array of subentity IDs of faces to be removed

Autodesk.AutoCAD.DatabaseServices.Solid3d.SeparateBody
This method separates the solid into a list of solids representing the additional disjoint volumes.

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets a material on a specified subentity.
subEntityId:  Input subentity Id
materialId:  Input object Id of the material

Autodesk.AutoCAD.DatabaseServices.Solid3d.GetSubentityMaterial(Autodesk.AutoCAD.DatabaseServices.SubentityId)
This function returns the material of the specified subentity.
subEntityId:  Input subentity Id

Autodesk.AutoCAD.DatabaseServices.Solid3d.SetSubentityMaterialMapper(Autodesk.AutoCAD.DatabaseServices.SubentityId,Autodesk.AutoCAD.GraphicsInterface.Mapper)
This function sets an explicit material mapper on the specified subentity.
subEntityId:  Input subentity ID
mapper:  Input a Mapper object

Autodesk.AutoCAD.DatabaseServices.Solid3d.ConvertToBrepAtSubentPaths(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This method is used to convert individual history items from a parameterized type such as a box to a simple boundary-representation without its parameter or type information.
paths:  Input array of references to history items

Autodesk.AutoCAD.DatabaseServices.Solid3d.FilletEdges(Autodesk.AutoCAD.DatabaseServices.SubentityId[],Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection,Autodesk.AutoCAD.Geometry.DoubleCollection)
This method creates rounded fillets the edges of a solid.
subentityIds:  Input object ids of the edges where the fillet will be applied
radius:  Input radius at the corresponding edge
startSetback:  Input start setback at the corresponding edge
endSetback:  Input end setback at the corresponding edge

Autodesk.AutoCAD.DatabaseServices.Solid3d.Area
Returns the area set to the surface area  of the solid.

Autodesk.AutoCAD.DatabaseServices.Solid3d.NumChanges
Returns the number of changes that have  occurred to this solid since it was first created.

Autodesk.AutoCAD.DatabaseServices.Solid3d.ShowHistory
Returns whether items in the history should be drawn when the sysvar SHOWHIST is 1.