Autodesk.AutoCAD.DatabaseServices.Group.SetAnonymous
This method sets the group to be anonymous.

Autodesk.AutoCAD.DatabaseServices.Group.Append(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function appends the objects whose objectIds are in the ids collection to the group.
ids:  Input objectId collection containing the objectIds of the objects to be appended

Autodesk.AutoCAD.DatabaseServices.Group.Append(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function appends the object identified by id to the group.
id:  Input objectId of the object to be appended to group

Autodesk.AutoCAD.DatabaseServices.Group.Prepend(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function prepends the objects whose objectIds are in the ids collection to the group.
ids:  Input objectId collection containing the objectIds of the objects to be prepended

Autodesk.AutoCAD.DatabaseServices.Group.Prepend(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function prepends the object identified by id to the group.
id:  Input objectId of the object to be prepended to group

Autodesk.AutoCAD.DatabaseServices.Group.Replace(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function replaces the oldId entity with the newId entity in the group.
oldId:  Input objectId of the object to be removed from the group
newId:  Input objectId of the object to be added to the group in place of oldId

Autodesk.AutoCAD.DatabaseServices.Group.Clear
This methods resets or clears the contents of a group.

Autodesk.AutoCAD.DatabaseServices.Group.Has(Autodesk.AutoCAD.DatabaseServices.Entity)
This method returns true if entity is present in the group or false if entity is not part of the group.
entity:  Input the entity being looked up

Autodesk.AutoCAD.DatabaseServices.Group.Reverse
This method reverses the indices of all the objects in the group.

Autodesk.AutoCAD.DatabaseServices.Group.Description
Accesses the group description string Conditions.