Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.GetQueryBounds
This function is used to get the boundary area of this SpatialFilter object.

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.ClipVolumeIntersectsExtents(Autodesk.AutoCAD.DatabaseServices.Extents3d)
This function is used to determine whether an object with extents ext intersects this SpatialFilter object's clipping volume.
ext:  Input extents

Autodesk.AutoCAD.DatabaseServices.Filters.SpatialFilter.Inverted
This property controls whether or not the SpatialFilter filters out the contents outside of the clip boundary (not inverted) or inside the clip boundary (inverted).