Autodesk.AutoCAD.GraphicsSystem.Configuration.ShowConfigDialog(System.String)
This is ShowConfigDialog, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureEnabled(Autodesk.AutoCAD.UniqueString)
Returns Boolean indicating whether a hardware feature is enabled.
feature:  Input input feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureAvailable(Autodesk.AutoCAD.UniqueString)
Returns Boolean indicating whether a feature is available.
feature:  Input input feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.IsFeatureRecommended(Autodesk.AutoCAD.UniqueString)
Returns the hardware feature recommended status.
feature:  Input hardware feature to query.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetFeatureEnabled(Autodesk.AutoCAD.UniqueString,System.Boolean)
Enables or disables a particular hardware feature.
feature:  Input feature to be enabled.
enable:  Input Boolean to enable or disable the feature.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureUsedVal(Autodesk.AutoCAD.UniqueString)
This is GetFeatureUsedVal, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureAvailableVal(Autodesk.AutoCAD.UniqueString)
This is GetFeatureAvailableVal, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetFeatureRecommendedVal(Autodesk.AutoCAD.UniqueString)
This is GetFeatureRecommendedVal, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.SetFeatureUsedVal(Autodesk.AutoCAD.UniqueString,System.Int32)
This is SetFeatureUsedVal, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.setHardwareAcceleration(System.Boolean)
This is setHardwareAcceleration, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetCertificationData
This is GetCertificationData, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GetVirtualDeviceName
This is GetVirtualDeviceName, a member of class Configuration.

Autodesk.AutoCAD.GraphicsSystem.Configuration.DynamicTessellation
Returns true if dynamic tessellation is enabled; it returns alse if dynamic tesselation is disabled.

Autodesk.AutoCAD.GraphicsSystem.Configuration.GenerateVertexNormals
This is GenerateVertexNormals, a member of class Configuration.