Autodesk.AutoCAD.DatabaseServices.Database.XrefSubCommandEnd
This is XrefSubCommandEnd, a member of class Database.

Autodesk.AutoCAD.DatabaseServices.Database.GetVisualStyleList
This function returns a list containing the localized names of the visual styles defined in the visual style dictionary.

Autodesk.AutoCAD.DatabaseServices.Database.GetViewports(System.Boolean)
This function enumerates the Viewports in a drawing.
bGetPaperspaceVports:  Input flag indicating whether to return paperspace viewports associated with layouts

Autodesk.AutoCAD.DatabaseServices.Database.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
This function copies the dimension variable information in style into the database on which this method is called, making those dimension variable values current for the database.
style:  Input pointer to DimStyleTableRecord from which to copy dimension variable information

Autodesk.AutoCAD.DatabaseServices.Database.GetDimstyleData
This function copies the database dimension variable values into the DimStyleTableRecord.

Autodesk.AutoCAD.DatabaseServices.Database.GetDimensionStyleChildData(Autodesk.AutoCAD.Runtime.RXClass)
This function returns the DimStyleTableRecord referenced by the dimension.
classDescriptor:  Input object to check.

Autodesk.AutoCAD.DatabaseServices.Database.UpdateExt(System.Boolean)
This function iterates through all the entities in the database's Model Space and updates the database's Model Space extents variables EXTMAX and EXTMIN to the values determined during the iteration.
Setting the argument doBestFit to TRUE means that while traversing the database, any BlockReference entities found should have their geomExtentsBestFit() method called instead of geomExtents(). This will be slower but will generate a tighter bounding box (extents). Using the default argument of FALSE will be faster but may not produce the tightest bounding box.
doBestFit:  Determines whether to generate the tightest bounding box

Autodesk.AutoCAD.DatabaseServices.Database.LoadLineTypeFile(System.String,System.String)
This function loads the linetype specified by lineTypeName from the file specified by filename and stores it in the database on which this method is called.
lineTypeName:  Input linetype name string (wild cards may be used)
filename:  Input path/filename or URL of linetype file to load from (path is optional)

Autodesk.AutoCAD.DatabaseServices.Database.GetNearestLineWeight(System.Int32)
The getNearestLineWeight() method takes a lineweight and returns the nearest LineWeight enum value.
weight:  Input lineweight in hundredths of a millimeter

Autodesk.AutoCAD.DatabaseServices.Database.ReclaimMemoryFromErasedObjects(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This member function deletes the objects underneath the input object ids and performs some related cleanup.
ids:  A collection of object ids whose memory is to be reclaimed by deleting their objects. All object ids in the collection must correspond to erased objects, which must be entirely closed.

Autodesk.AutoCAD.DatabaseServices.Database.Purge(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function searches through the database to see if there are any hard references to objects with object ID entities in the ids array.
ids:  Input collection of object ID entities of objects

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,Autodesk.AutoCAD.DatabaseServices.DwgVersion)
This function creates an DXF file.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Number of bits of accuracy, from 0 to 16
version:  Sets the DWG version major and minor number

Autodesk.AutoCAD.DatabaseServices.Database.DxfOut(System.String,System.Int32,System.Boolean)
This function creates an DXF file.
Note
The precision may also be set to -1 to change the output format from the default ASCII DXF format to the binary DXF format.
fileName:  Input name or URL of the new DXF file to create (the .dxf extension is not added automatically)
precision:  Number of bits of accuracy, from 0 to 16
saveThumbnailImage:  Input Boolean indicating whether to save thumbnail

Autodesk.AutoCAD.DatabaseServices.Database.ResolveXrefs(System.Boolean,System.Boolean)
This function resolves existing xrefs in the working database.
If useThreadEngine is true, and other factors haven't disabled it, then the multi-thread engine is used for resolving the xrefs.
If doNewOnly is true, only unresolved xref records are processed. Existing resolved xref LayerTableRecords, LinetypeTableRecords, and BlockTableRecords are ignored. In this case, the useThreadEngine argument also is ignored, and the multi-thread engine is not used. Warning
No document locking is done by this function; the caller is responsible for locking the document.
This function is available to non-AutoCAD-based host applications.
useThreadEngine:  Input Boolean indicating whether to use the thread engine for xref resolution
doNewOnly:  Input Boolean indicating whether to process only newly added xrefs

Autodesk.AutoCAD.DatabaseServices.Database.DetachXref(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function detaches the xref in the database whose BlockTableRecord is specified by xrefId.
xrefId:  Input object ID of the xref block to detach

Autodesk.AutoCAD.DatabaseServices.Database.ReloadXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function reloads the xrefs whose BlockTableRecord ObjectIds are in xrefIds.
xrefIds:  Input collection of ObjectIds for the xref BlockTableRecords to unload

Autodesk.AutoCAD.DatabaseServices.Database.XBindXrefs(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection,System.Boolean)
This function binds the xref symbolTable records whose ObjectIds are in xrefSymbolIds. If insertBind is true, then the symbolTable record names will be changed from the xref naming convention to normal insert symbolTable record names.
The ObjectIds in xrefSymbolIds must all be from the working database and they must all be from resolved xrefs. xrefSymbolIds may contain ObjectIds for the following symbol table record types: BlockTableRecord, LayerTableRecord, LinetypeTableRecord, TextStyleTableRecord (if it does not represent a shape file), RegAppTableRecord, and DimStyleTableRecord.
xrefSymbolIds:  Input collection of ObjectIds of SymbolTableRecord objects to be bound.
insertBind:  Input bool to indicate whether or not to convert xref symbols to insert-like bind names.

Autodesk.AutoCAD.DatabaseServices.Database.LoadMlineStyleFile(System.String,System.String)
This function loads the MlineStyle specified by mlineStyleName from the file specified by fileName.
mlineStyleName:  Input MlineStyle name string (no wild cards)
fileName:  Input path/filename or URL of file to load from (path is optional)

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
This function creates a new block table record in the database executing this function. This new block table record is given the name pointed to by destinationBlockName. Then, each entity in the block table record whose name is sourceBlockName and which resides in the database pointed to by dataBase is copied into the new block table record.
The preserveSourceDatabase argument determines whether the source database dataBase is left intact. The default value of the argument is true. In that case, objects from the source database are copied to the destination database, and the source database is not changed. If the caller passes false for this argument, objects from the source database could be physically moved into the destination database. The latter runs faster, but it leaves the source database dependent on the destination database. The caller should make sure that the source database is deleted either immediately, or at least before the destination database is deleted.
Returns the object ID for the new block table record created by this function.
sourceBlockName:  Input name of the blockTableRecord
destinationBlockName:  Input name to be used by the new block table record created by this function
dataBase:  Input database from which to insert entities
preserveSourceDatabase:  Input bool to determine whether the source database is left intact

Autodesk.AutoCAD.DatabaseServices.Database.Insert(System.String,Autodesk.AutoCAD.DatabaseServices.Database,System.Boolean)
This function mimics the AutoCAD INSERT command. First a new block table record is created in the database executing this function. This new block table record is given the name pointed to by blockName. Then, all the Model Space entities in the database pointed to by dataBase are copied into the new block table record.
The preserveSourceDatabase argument determines whether the source database dataBase is left intact. The default value of the argument is true. In that case, objects from the source database are copied to the destination database, and the source database is not changed. If the caller passes false for this argument, objects from the source database could be physically moved into the destination database. The latter runs faster, but it leaves the source database dependent on the destination database. The caller should make sure that the source database is deleted either immediately, or at least before the destination database is deleted.
Returns the object ID for the new block table record created by this function.
blockName:  Input name to be used by the new block table record created by this function
dataBase:  Input database from which to insert entities
preserveSourceDatabase:  Input bool to determine whether the source database is left intact

Autodesk.AutoCAD.DatabaseServices.Database.Dimtfill
Accesses the dimension background color state, which can be one of the following values:
0 means the background color is disabled
1 means the use background color from dimtfillclr
2 means the use drawing's background color.