Autodesk.AutoCAD.DatabaseServices.Dimension.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
This function copies the dimension variable information in the DimStyleTableRecord identified by style into the database on which this method is called, making those dimension variable values current for the database.
style:  Input object ID of DimStyleTableRecord from which to copy dimension variable information

Autodesk.AutoCAD.DatabaseServices.Dimension.GetDimstyleData
This function copies the dimstyle information from the DimStyleTableRecord referenced by the current dimension.

Autodesk.AutoCAD.DatabaseServices.Dimension.RecomputeDimensionBlock(System.Boolean)
This function updates the block table record the dimension references to match any changes made to the dimension since the last time the block table record was updated.
If forceUpdate is true, then the block table record will be updated regardless of whether or not the dimension has had any changes since the last time the block table record was updated.
forceUpdate:  Boolean indicating whether or not to force an update on screen

Autodesk.AutoCAD.DatabaseServices.Dimension.GenerateLayout
This function will update the dimension according to the current dimension style.

Autodesk.AutoCAD.DatabaseServices.Dimension.FormatMeasurement(System.Double,System.String)
This method gives you access to the dimension classes' text assembly and formatting logic.
measurement:  Input measurement value.
dimensionText:  Input alternate value.