Autodesk.AutoCAD.DatabaseServices.Filters.LayerIndex.Compute(Autodesk.AutoCAD.DatabaseServices.LayerTable,Autodesk.AutoCAD.DatabaseServices.BlockTableRecord)
This function uses the layer table pointed to by pLT and the block table record pointed to by pBTR to compute the appropriate filter information.
pLT:  Input layer table of the Database
record:  Input block table record for which the filter should be generated