Autodesk.AutoCAD.DatabaseServices.SubDMesh.GetNumberOfSubDividedFacesAt(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[])
This .NET method wraps the ObjectARX AcDbSubDMesh::numOfSubDividedFacesAt Method.

Autodesk.AutoCAD.DatabaseServices.SubDMesh.ConvertToSurface(System.Boolean,Autodesk.AutoCAD.DatabaseServices.SubentityId)
This .NET method wraps the ObjectARX method
AcDbSubDMesh::convertToSurface(bool bConvertAsSmooth, const AcDbSubentId& id, AcDbSurface*& pSurface).