Autodesk.AutoCAD.DatabaseServices.Polyline2d.Straighten
This function removes all spline and curve-fit vertices from the polyline and sets all remaining vertices to be simple vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.SplineFit
This function removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.CurveFit
This function creates a smooth curve consisting of pairs of arcs joining each pair of vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline2d.NonDBAppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function appends the Vertex2d object to the vertex list of the polyline, establishes the polyline as the vertex's owner.
vertexToAppend:  Input the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline2d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function appends the Vertex2d object to the vertex list of the polyline, establishes the polyline as the vertex's owner, and adds the vertex the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
vertexToAppend:  Input the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline2d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function inserts the Vertex2d object pointed to by newVertex into the vertex list of the polyline just after indexVertex.
newVertex:  Input vertex to be inserted
indexVertex:  Input vertex in polyline after which the new vertex is to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline2d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.Vertex2d,Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function inserts the Vertex2d object pointed to by newVertex into the vertex list of the polyline just after the Vertex2d object with objectId vertexId, establishes the polyline as the vertex's owner, and adds the vertex to the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
newVertex:  Input pointer to vertex to be inserted
vertexId:  Input objectId of the vertex in the polyline after which the new vertex is to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline2d.VertexPosition(Autodesk.AutoCAD.DatabaseServices.Vertex2d)
This function returns the WCS coordinate position value of vert.
vertex:  Input vertex object to get the WCS coordinate for