Autodesk.AutoCAD.DatabaseServices.Hatch.#ctor
This is the default constructor for the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.LoopTypeAt(System.Int32)
This function returns the loop type of a selected hatch boundary loop from the hatch entity.
loopIndex:  Input index of the selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.GetLoopAt(System.Int32)
This function gets the loop definition data (polyline) of a selected hatch boundary loop from the hatch entity.
loopIndex:  Input index of selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function appends a new boundary loop (path or polyline) to the hatch entity.
loopType:  Input loop type
dbObjIds:  Input set of object IDs

Autodesk.AutoCAD.DatabaseServices.Hatch.AppendLoop(Autodesk.AutoCAD.DatabaseServices.HatchLoop)
This function appends a new boundary loop (polyline) to the hatch entity.
hatchLoop:  Input type of loop

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoopTypes,Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This function inserts a new boundary loop (path or polyline) to the hatch entity.
loopIndex:  Input index for the selected loop
loopType:  Input loop type
dbObjIds:  Input set of object IDs

Autodesk.AutoCAD.DatabaseServices.Hatch.InsertLoopAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.HatchLoop)
This function inserts a new boundary loop (path or polyline) to the hatch entity.
loopIndex:  Input index for the selected loop
hatchLoop:  Input loop type

Autodesk.AutoCAD.DatabaseServices.Hatch.RemoveLoopAt(System.Int32)
This function removes a loop and its data from the hatch entity.
loopIndex:  Input index for the selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.GetAssociatedObjectIdsAt(System.Int32)
This function gets the object IDs of the source boundary geometries associative to the selected loop.
loopIndex:  Input index for the selected loop

Autodesk.AutoCAD.DatabaseServices.Hatch.GetAssociatedObjectIds
This function gets all the object IDs of the source boundary geometries associative to the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.RemoveAssociatedObjectIds
This function removes all the object IDs of the source boundary geometries associative to the hatch entity.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetGradientColors
This method returns the colors and interpolation values describing how the gradient fill definition will be applied.

Autodesk.AutoCAD.DatabaseServices.Hatch.SetGradientColors(Autodesk.AutoCAD.DatabaseServices.GradientColor[])
This method provides the mechanism for defining the colors to be applied to the gradient definition.
value:  Input array of floats representing the interpolation values defining the gradient

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateGradientColorAt(System.Single)
This method provides a way to evaluate the interpolated color that the current gradient definition and colors will produce at a specified location along the gradient.
value:  Input normalized value, [0.0...1.0], at which to evaluate the gradient color

Autodesk.AutoCAD.DatabaseServices.Hatch.GetPatternDefinitionAt(System.Int32)
This function gets the pattern definition line data from the hatch entity at the selected pattern line.
index:  Input pattern index

Autodesk.AutoCAD.DatabaseServices.Hatch.EvaluateHatch(System.Boolean)
This function evaluates the hatch lines or solid fill for the hatch entity using the specified hatch pattern. For regular hatch patterns, except for solid, this function performs intersection calculations between pattern definition lines and hatch boundary curves to form hatch lines. For a solid fill hatch pattern, this function performs triangulation of the hatch area and fills in the triangular meshes with the given color. Note Be sure to call SetHatchPattern() before using this method in order to update the display.
underEstimateNumLines:  If true, underestimates the count before deciding to abort. That is, if Hatch::EvaluateHatch(true) is used, the function will abort if the count is in excess of 100,000.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetHatchLinesData
void Hatch.GetHatchLineDataAt(int index, Point2d* startPoint, Point2d* endPoint) { *startPoint = new Point2d(); *endPoint = new Point2d(); Interop.Check(GetImpObj()->getHatchLineDataAt(index,*(*startPoint)->GetImpObj(),*(*endPoint)->GetImpObj()));
} void Hatch.GetHatchLinesData(Point2dCollection** startPoint, Point2dCollection** endPoint) { *startPoint = new Point2dCollection(); *endPoint = new Point2dCollection(); Interop.Check(GetImpObj()->getHatchLinesData(*(*startPoint)->GetImpObj(),*(*endPoint)->GetImpObj()));.

Autodesk.AutoCAD.DatabaseServices.Hatch.GetHatchLineDataAt(System.Int32)
This function gets the hatch line data from the hatch entity.
index:  Input number at which the hatch line data will be returned