Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.GetContours
This function provides access to the curve boundary geometry for the boundaries on the surface.

Autodesk.AutoCAD.Geometry.ExternalBoundedSurface.BaseSurface
This function provides access to the unbounded surface geometry (that is, unbounded other than by the parametric bounds, if applicable, of the surface).