Autodesk.AutoCAD.Runtime.RuntimeSystem.Main(System.String)
Initializes the .NET Runtime using ICLRRuntimeHost.
pwzArgument:  Input System.String; argument is not used, it’s there to satisfy ExecuteInDefaultAppDomain which calls the method and loads the acdbmgd assembly.