Autodesk.AutoCAD.GraphicsSystem.Device.SetLogicalPalette(System.Drawing.Color[])
Used to communicate the logical palette used by the client when it makes use of SubEntityTraits.SetColor() method (for example, when the client specifies color with a palette index).
palette:  Input array of logical palette colors.

Autodesk.AutoCAD.GraphicsSystem.Device.SetPhysicalPalette(System.Drawing.Color[])
Specifies a physical palette.
palette:  Input array that constitutes the palette.