Autodesk.AutoCAD.DatabaseServices.Entity.Draw
This function queues up the entity's graphics and flushes the graphics queue, forcing the entity and anything else in the queue to be drawn or re-drawn on-screen.