Autodesk.AutoCAD.DatabaseServices.Shape.#ctor(Autodesk.AutoCAD.Geometry.Point3d,System.Double,System.Double,System.Double)
Constructor.
position:  Input insertion point of the shape, in WCS coordinates
size:  Input height of the shape
rotation:  Input rotation of the shape
widthFactor:  Input width factor of the shape

Autodesk.AutoCAD.DatabaseServices.Shape.#ctor
Constructor.