Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.Commit
This function commits the changes made in all the DBObjects opened during the OpenCloseTransaction, and then closes them.

Autodesk.AutoCAD.DatabaseServices.OpenCloseTransaction.TransactionManager
Accesses the associated transaction manager.