Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.addRequirement(Autodesk.AutoCAD.UniqueString)
Require support for a given capability.
^capability:  String describing the graphics capability

Autodesk.AutoCAD.GraphicsSystem.KernelDescriptor.supports(Autodesk.AutoCAD.UniqueString)
Query support for a given capability.
capability:  String describing the graphics capability.