Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertFrom(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
This fills the Polyline with data from the Polyline2d pointed to by entity. entity must point to a SimplePoly or FitCurvePoly type of Polyline2d object in a database. This function should be called from an Polyline that is not yet database-resident.
If transferId is true, the calling Polyline will become database-resident. The calling Polyline will assume the ObjectId and handle, plus any extended entity data (except data on vertices), the extension dictionary, and reactors of the Polyline2d entity entity. entity will then be deleted and set to NULL.
If transferId is false, entity will remain in the database as is and the caller must close it. The resulting Polyline will not be database-resident, and if not appended to a database, should be deleted.
entity:  Input pointer to the Polyline2d to copy from
transferId:  Input Boolean indicating whether or not to do a HandOverTo between the Polyline2d and the Polyline

Autodesk.AutoCAD.DatabaseServices.Polyline.ConvertTo(System.Boolean)
This function creates an Polyline2d from the Polyline and returns the newly created Polyline2d.
If transferId is true, the newly-created Polyline2d will become database-resident and will assume the ObjectId and handle, plus any extended entity data, extension dictionary, and reactors of the Polyline on which this method is called. The Polyline will then no longer be database-resident and can be deleted by the C++ delete operator.
If transferId is false, then the Polyline will remain in the database as is and the caller must close it. The resulting Polyline2d and all its vertices will not be database-resident, and if not appended to a database, should be deleted.
transferId:  Input Boolean indicating whether or not to do a handOverTo between the Polyline and the Polyline2d.

Autodesk.AutoCAD.DatabaseServices.Polyline.GetPoint3dAt(System.Int32)
This function returns the 3D location of the vertex index in World Coordinates.
value:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetSegmentType(System.Int32)
This function returns the type of segment (SegType) that is headed by the vertex index.
index:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.OnSegmentAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double)
This function determines whether or not pt2d (specified in the polyline's Entity Coordinate System) is on the segment of the polyline starting at vertex index.
index:  Input index (0 based) of the vertex
pt2d:  Input point (in polyline OCS coords) to check at vertex index
value:  Output parameter of at vertex index

Autodesk.AutoCAD.DatabaseServices.Polyline.AddVertexAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d,System.Double,System.Double,System.Double)
This function adds a vertex to the polyline.
index:  Input index (0 based) before which to insert the vertex
pt:  Input vertex location point
bulge:  Input bulge value for vertex
startWidth:  Input start width for vertex
endWidth:  Input end width for vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.RemoveVertexAt(System.Int32)
This function removes the vertex at index.
index:  Input index (0 based) of the vertex to remove

Autodesk.AutoCAD.DatabaseServices.Polyline.GetPoint2dAt(System.Int32)
This function returns the 2D location of the vertex index in the polyline's own object coordinate system (OCS).
index:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.SetPointAt(System.Int32,Autodesk.AutoCAD.Geometry.Point2d)
This sets pt (in polyline OCS coordinates) to be the location of the index vertex.
index:  Input index (0 based) of the vertex
pt:  Input location for the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetBulgeAt(System.Int32)
This function gets the bulge factor value at the index vertex.
index:  Input index (0 based) of the vertex for start of bulge

Autodesk.AutoCAD.DatabaseServices.Polyline.SetBulgeAt(System.Int32,System.Double)
This function sets bulge to be the bulge value for the index vertex.
index:  Input index (0 based) of the vertex
bulge:  Input bulge value for the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.GetStartWidthAt(System.Int32)
This returns the star width.
index:  Input index (0 based) of the vertex

Autodesk.AutoCAD.DatabaseServices.Polyline.SetStartWidthAt(System.Int32,System.Double)
This function sets the start width for vertex index.
index:  Input index (0 based) of the vertex
startWidth:  Input start width value for vertex index

Autodesk.AutoCAD.DatabaseServices.Polyline.SetEndWidthAt(System.Int32,System.Double)
This function sets the end width for vertex index.
index:  Input index (0 based) of the vertex
endWidth:  Input end width value for vertex index

Autodesk.AutoCAD.DatabaseServices.Polyline.MinimizeMemory
This function optimizes the memory usage of the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.MaximizeMemory
This function "decompresses" any memory compression that may currently be used by the polyline.

Autodesk.AutoCAD.DatabaseServices.Polyline.Reset(System.Boolean,System.Int32)
This function resets the polyline's vertex data.
If reuse is true, then the NumberOfVertices number of vertices are left intact and all vertices beyond that number are deleted.
If reuse is false, then NumberOfVertices is ignored and all existing vertex information will be deleted.
reuse:  Input Boolean indicating whether or not to retain some vertices
vertices:  Input number of vertices to retain