Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.IsUrl(System.String)
This method determines whether the string filePath refers to a valid URL; returns true if it is and false otherwise.
filePath:  Input string to be evaluated

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetUrl(System.String)
This method is the inverse of the isURL method.
localFile:  Input local file

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.GetRemoteFile(System.Uri,System.Boolean)
This method returns the resource (file) identified by the URL url. The Boolean argument ignoreCache determines whether the file should be downloaded even if it has already been transferred earlier in the session.
This method, if you implement it, should allow the user transparent access to files on remote servers on the Internet.
url:  Input URL
ignoreCache:  Input Boolean indicating whether to download the file even if it has be cached earlier in the session

Autodesk.AutoCAD.DatabaseServices.HostApplicationServices.PutRemoteFile(System.Uri,System.String)
This method uploads a local resource (file) identified by the pathname localFile to the remote location specified by the URL url.
url:  Input URL to which to upload file
localFile:  Input local file to upload