Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.LowerLeftCorner
This function returns an Point2d object containing the lower left corner of the viewport window.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UpperRightCorner
This function returns an Point2d object containing the upper right corner of the viewport window.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UcsFollowMode
This function returns true if the ViewportTableRecord is set to generate and display a plan view whenever the UCS changes in the viewport; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IconEnabled
This function returns true if the ViewportTableRecord is currently set to have the UCS icon display; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IconAtOrigin
This function returns true if the ViewportTableRecord is currently set to have the UCS icon follow the current UCS origin (as long as the origin is far enough within the viewport to allow the icon to display properly).

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapEnabled
This function returns true if snap mode is currently set on in the ViewportTableRecord; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.IsometricSnapEnabled
This function returns true if snap mode is currently set to isometric in the ViewportTableRecord; otherwise, returns false.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapPair
This function returns the snap IsoPair setting for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapAngle
This function returns the snap angle setting (in radians) for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapBase
This function returns the snap basepoint (in UCS coordinates) for the ViewportTableRecord.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.SnapIncrements
This function returns an Point2d in which the X value represents the X spacing of the snap grid and the Y value represents the Y spacing of the snap grid.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.UcsSavedWithViewport
This function returns the value of UCSVP for the viewport.

Autodesk.AutoCAD.DatabaseServices.ViewportTableRecord.ToneOperatorParameters
Accesses the tone operator paramters.