Autodesk.AutoCAD.GraphicsSystem.EffectStatus
This is class Autodesk.AutoCAD.GraphicsSystem.EffectStatus.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.EffectUniqueString
This is EffectUniqueString, a member of class EffectStatus.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.EffectName
This is EffectName, a member of class EffectStatus.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.Available
This is Available, a member of class EffectStatus.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.Recommended
This is Recommended, a member of class EffectStatus.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.Enabled
This is Enabled, a member of class EffectStatus.

Autodesk.AutoCAD.GraphicsSystem.EffectStatus.FeatureLevel
This is FeatureLevel, a member of class EffectStatus.