Autodesk.AutoCAD.DatabaseServices.IdMapping.Add(Autodesk.AutoCAD.DatabaseServices.IdPair)
This function adds pairToAdd to the IdMapping object's map.
pairToAdd:  Input IdPair to add

Autodesk.AutoCAD.DatabaseServices.IdMapping.Lookup(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function searches the IdMapping object's ID map for an IdPair that has a key that matches the key passed.
key:  Input key to look for

Autodesk.AutoCAD.DatabaseServices.IdMapping.Change(Autodesk.AutoCAD.DatabaseServices.IdPair)
This function searches the IDMapping object's map for the key contained in pairToChange and, if found, replaces the entry with a copy of pairToChange.

Autodesk.AutoCAD.DatabaseServices.IdMapping.Delete(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function searches the IdMapping ID map for an entry that has a key matching key.
key:  Input objectId which is the key of the ID pair to be deleted from the map

Autodesk.AutoCAD.DatabaseServices.IdMapping.Contains(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function searches the IdMapping object's ID map for an IdPair that has a key that matches the key passed.
key:  Input key to look for