Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnAt(System.Int32)
This function gets the column at the specified column index.
index:  Index of column

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnNameAt(System.Int32)
This function gets the name of the column at the specified column index.
index:  Column index

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnTypeAt(System.Int32)
This function gets the type of the column at the specified column index.
index:  Column index

Autodesk.AutoCAD.DatabaseServices.DataTable.GetColumnIndexAtName(System.String)
This function gets the index of the column with the specified column name.
name:  Name of column

Autodesk.AutoCAD.DatabaseServices.DataTable.RemoveColumnAt(System.Int32)
This function removes the specified column from the table.
index:  Index of column to remove

Autodesk.AutoCAD.DatabaseServices.DataTable.GetRowAt(System.Int32)
This function gets the row of data at the specified row index.
index:  Row index

Autodesk.AutoCAD.DatabaseServices.DataTable.SetRowAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
This function replaces the row at the specified index .
Set the validate parameter to true if the type of each cell in the new row should be validated against the type of each corresponding column and if the number of columns in the row should be validated with regard to the number of columns in the table.
index:  Row index of the row to be replaced
row:  New row of data
validate:  Validation flag

Autodesk.AutoCAD.DatabaseServices.DataTable.AppendRow(Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
This method appends a row to the end of the table.
Set the validate parameter to true if the type of each cell in the new row should be validated against the type of each corresponding column and if the number of columns in the row should be validated with regard to the number of columns in the table.
row:  Row being added
validate:  Validation flag

Autodesk.AutoCAD.DatabaseServices.DataTable.InsertRowAt(System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCellCollection,System.Boolean)
This function inserts a row of data into the table immediately before the row at the specified index.
index:  Row index of position at which to insert the row
row:  Row of data to insert
validate:  Validation flag

Autodesk.AutoCAD.DatabaseServices.DataTable.RemoveRowAt(System.Int32)
This function removes the specified row from the table.
index:  Index of row to remove

Autodesk.AutoCAD.DatabaseServices.DataTable.GetCellAt(System.Int32,System.Int32)
This function gets the cell at the specified row and column indexes.
row:  Row index of cell to access
col:  Column index of cell to access

Autodesk.AutoCAD.DatabaseServices.DataTable.SetCellAt(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.DataCell)
This function replaces the cell in the table at the specified row and column with the specified cell.
row:  Row index of the cell to be replaced
col:  Column index of the cell to be replaced
cell:  New cell