Autodesk.AutoCAD.DatabaseServices.TypedValue.ToString(System.IFormatProvider)
Returns an equivalent string representation of this object, in the culture-specific format defined by provider.
provider:  Input.