Autodesk.AutoCAD.DatabaseServices.PlotSettingsValidator.SetZoomToPaperOnUpdate(Autodesk.AutoCAD.DatabaseServices.PlotSettings,System.Boolean)
This method sets a flag on an Layout object to indicate that a zoom to the associated paper image represented by the underlying Layout be performed if the paper receives update notification. An update notification can occur in a number of ways, but the most explicit is to call the UpdateCurrentPaper() method on the Layout Manager. It doesn't get notification, however, merely by setting attributes on the Layout object.
plotSet:  Input
doZoom:  Input Boolean indicating whether to zoom