Autodesk.AutoCAD.DatabaseServices.RasterImageDef.Load
This function enables "lazy loading" of the image pixel data from the source image file (specified by RasterImageDef.SourceFileName) into an ATIL object.

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.CreateImageDictionary(Autodesk.AutoCAD.DatabaseServices.Database)
Call this function to create a new image dictionary if the function RasterImageDef.GetImageDictionary returns 0, indicating that no image dictionary exists.
database:  Input AutoCAD database in which to create the dictionary

Autodesk.AutoCAD.DatabaseServices.RasterImageDef.IsLoaded
Assesses if the image is loaded.