Autodesk.AutoCAD.DatabaseServices.LoftOptions.CheckPathCurve(Autodesk.AutoCAD.DatabaseServices.Entity,System.Boolean)
This function checks for valid combinations of options.
pathCurve:  Input path curve
displayErrorMessages:  Input Boolean whether or not to display error messages

Autodesk.AutoCAD.DatabaseServices.LoftOptions.ArcLengthParam
Accesses the arc length  parametrization.

Autodesk.AutoCAD.DatabaseServices.LoftOptions.Closed
.