Autodesk.AutoCAD.DatabaseServices.MText.CorrectSpelling
This function is intended to be used internally, and requires that additional speller initialization be performed before calling.

Autodesk.AutoCAD.DatabaseServices.MText.BackgroundScaleFactor
.