Autodesk.AutoCAD.DatabaseServices.Ellipse.#ctor(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d,System.Double,System.Double,System.Double)
This constructor is used to create an Ellipse using the values passed in.
center:  Input center of the ellipse
unitNormal:  Input vector specifying normal, which determines the plane of the ellipse
majorAxis:  Input vector which represents 1/2 the major axis of the ellipse
radiusRatio:  Input ratio of the major radius to the minor radius
startAngle:  Input start angle of the ellipse in radians
endAngle:  Input end angle of the ellipse in radians

Autodesk.AutoCAD.DatabaseServices.Ellipse.GetAngleAtParameter(System.Double)
This function returns the first period equivalent of the angle at the value location on the ellipse.
value:  Input parameter to evaluate