Autodesk.AutoCAD.DatabaseServices.Spline.ToPolyline(System.UInt32,System.Boolean,System.Boolean)
This .NET method wraps the ObjectARX method.
Generates a polyline to approximate a spline without using PLINETYPE and PLINECONVERTMODE. The resulting curve could be an Polyline or an 3dPolyline. If the spline is not planar, then the result will always be an AcDb3dPolyline and will always have line segments. If the spline is planar, then if bConvertAsArcs is truen, the resulting polyline will be arc segments, otherwise it will be line segments. And, if the spline is planar and bToLWPolyline is true, then the result will be an AcDbPolyline, otherwise it will be an AcDb2dPolyline.

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolyline(System.Boolean,System.Boolean)
This .NET method wraps the ObjectARX method.

Autodesk.AutoCAD.DatabaseServices.Spline.ToPolylineWithPrecision(System.Int32,System.Boolean,System.Boolean)
This .NET method wraps the ObjectARX method.
Generates a polyline to approximate a spline without using PLINETYPE and PLINECONVERTMODE. The resulting curve could be an AcDbPolyline, an AcDb2dPolyline, or an AcDb3dPolyline. If the spline is not planar, then the result will always be an AcDb3dPolyline and will always have line segments. If the spline is planar, then if bConvertAsArcs is truen, the resulting polyline will be arc segments, otherwise it will be line segments. And, if the spline is planar and bToLWPolyline is true, then the result will be an AcDbPolyline, otherwise it will be an AcDb2dPolyline.

Autodesk.AutoCAD.DatabaseServices.Spline.IsNull
Returns true if this Spline  object does not have an gelib object within it.

Autodesk.AutoCAD.DatabaseServices.Spline.IsRational
Returns true if and only if the  spline is rational.

Autodesk.AutoCAD.DatabaseServices.Spline.Degree
Returns the degree of the spline's  polynomial representation.

Autodesk.AutoCAD.DatabaseServices.Spline.NumControlPoints
Returns the number of control points  in the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.NumFitPoints
Returns the number of fit points associated with  the spline.

Autodesk.AutoCAD.DatabaseServices.Spline.StartFitTangent
Returns the  start point of tangent vector in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.Spline.HasFitData
Returns true if and only if the spline  has fit data associated with it.

Autodesk.AutoCAD.DatabaseServices.Spline.IsPlanar
Returns true if the object lies  completely within a plane.