Autodesk.AutoCAD.GraphicsSystem.View.FreezeLayer(System.Int64)
Obsolete - Use the FreezeLayer method that accepts an IntPtr value.
layerId:  Input Layer to be treated as frozen.

Autodesk.AutoCAD.GraphicsSystem.View.ThawLayer(System.Int64)
Obsolete - Use the ThawLayer method that accepts an IntPtr value.
layerId:  Input Layer to be treated as thawed.

Autodesk.AutoCAD.GraphicsSystem.View.Roll(System.Double)
Rotates the camera’s up vector about the eye vector by the specified amount in radians.
angle:  Input angular rotation about the eye vector in radians.

Autodesk.AutoCAD.GraphicsSystem.View.ExtentsInView(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Point3d)
Returns true if the bounding box defined by minPoint and maxPoint is at least partially visible in the view frustum of the current View object.
minPoint:  Input WCS point of the corner of the bounding box extents.
maxPoint:  Input WCS point of the corner of the bounding box extents.

Autodesk.AutoCAD.GraphicsSystem.View.ViewportObjectId
The Autodesk.AutoCAD.DatabaseServices.ObjectId of the viewport associated with the GS view.