Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Add(System.String)
This function will add the input layer to the set of layers within the filter object that define those entities that pass the filter test.
layer:  Input layer name to add

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.Remove(System.String)
This function will remove the input layer from the filter.
layer:  Input layer name to remove

Autodesk.AutoCAD.DatabaseServices.Filters.LayerFilter.GetAt(System.Int32,System.String)
This function finds the layer whose index is index and sets name to point to that layer's name.
index:  Input index of layer to get
name:  Input name of layer at index index