Autodesk.AutoCAD.DatabaseServices.Table.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.Table.GetColumnName(System.Int32)
Returns the columns name retrieved from the specified index.
index:  Input zero based index of the column

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnName(System.Int32,System.String)
Sets a column's name; it can be left blank.
index:  Input zero based index of the column
name:  Input column name to set. This can be an empty string.

Autodesk.AutoCAD.DatabaseServices.Table.GetToolTip(System.Int32,System.Int32)
Returns the tooltip string for cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.

Autodesk.AutoCAD.DatabaseServices.Table.SetToolTip(System.Int32,System.Int32,System.String)
Sets the tooltip string for cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
toolTip:  Input tool tip string to set

Autodesk.AutoCAD.DatabaseServices.Table.ColumnWidth(System.Int32)
Returns the column width at the specified column index in the table.
col:  Input zero-based column index

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnWidth(System.Double)
This function sets a uniform column width for all the columns in the table.
width:  Input uniform width to be used for all the columns in the table

Autodesk.AutoCAD.DatabaseServices.Table.SetColumnWidth(System.Int32,System.Double)
This function sets the column width at the specified column index in the table.
col:  Input zero-based column index
width:  Input width to be used for the specified column

Autodesk.AutoCAD.DatabaseServices.Table.RowHeight(System.Int32)
Returns the row height of the specified row in the table.
row:  Input zero-based row index

Autodesk.AutoCAD.DatabaseServices.Table.SetRowHeight(System.Double)
This function sets a uniform row height for all the rows in the table.
height:  Input height to be used for the specified row

Autodesk.AutoCAD.DatabaseServices.Table.SetRowHeight(System.Int32,System.Double)
This function sets the row height for the specified row index in the table.
row:  Input zero-based row index
height:  Input height to be used for the specified row

Autodesk.AutoCAD.DatabaseServices.Table.MinimumColumnWidth(System.Int32)
Returns the minimum column width at the specified column index in the table.
col:  Input zero-based column index

Autodesk.AutoCAD.DatabaseServices.Table.MinimumRowHeight(System.Int32)
Returns the minimum row height for the specified row in the table.
row:  Input zero-based row index

Autodesk.AutoCAD.DatabaseServices.Table.Alignment(System.Int32,System.Int32)
This function returns the alignment of the text or block in the specified cell of the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.IsBackgroundColorNone(System.Int32,System.Int32)
Returns true if the background color for the specified cell in the table is set to no color value.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColorNone(System.Int32,System.Int32,System.Boolean)
This function enables or disables the background color for the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
value:  Input indicating whether to enable the background color for the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBackgroundColorNone(System.Boolean,System.Int32)
This function enables or disables the background color for the specified row type. Different row types can be combined.
The possible row type values are DataRow, TitleRow, and HeaderRow. If no row type is specified, this function sets all the possible row types.
This method is deprecated and may be removed in a future release.
value:  Input indicating whether to enable the background color for the specified row type
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.BackgroundColor(System.Int32,System.Int32)
This function returns the background color of the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.ContentColor(System.Int32,System.Int32)
This function returns the color of the cell content for the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.TextStyle(System.Int32,System.Int32)
Returns the object ID of the text style of the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyle(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the table object to use the TextStyleTableRecord specified by id for the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
id:  Input TextStyleTableRecord object ID

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
This function sets the table object to use the TextStyleTableRecord specified by id for the specified row types.
id:  Input TextStyleTableRecord object ID
rowTypes:  Input row types for which to set the text style

Autodesk.AutoCAD.DatabaseServices.Table.TextHeight(System.Int32,System.Int32)
Returns the text height of the specified table cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Int32,System.Int32,System.Int32,System.Double)
Sets the text height of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
height:  Input text height

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Int32,System.Int32,System.Double)
This function sets the text height for the specified table cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
height:  Input text height

Autodesk.AutoCAD.DatabaseServices.Table.SetTextHeight(System.Double,System.Int32)
This function sets the text height for the specified row types.
height:  Input text height
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.Table.GridLineWeight(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
This function returns the grid lineweight of the specified edge of the cell.
row:  Input row index. This can be -1.
col:  Input column index. This can be -1.
edge:  Input integer specifying the edge index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.GridColor(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
This function returns the grid color of the specified edge of the cell.
row:  Input object specifying the zero-based row index for the cell
col:  Input object specifying the zero-based column index for the cell
edge:  Input object specifying the edge index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.GridVisibility(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellEdgeMasks)
This function returns the grid visibility of the specified edge of the cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
edge:  Input specifying the edge index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Int32,System.Int32,System.Int16,System.Boolean)
This function sets the grid visibility of the specified edge of the cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
edges:  Input specifying the edge index for the cell
value:  Input visibility to be used for the grid at the specified edge of the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
This function sets the grid visibility for a given grid line type and row type of the table object. Different grid line and row types can be combined.
The possible values of the grid line type are HorzTop, HorzInside, HorzBottom, VertLeft, VertInside, and VertRight.
The possible values of the row type are DataRow, TitleRow, and HeaderRow.
This method is deprecated and may be removed in a future release.
visible:  Input visibility
borders:  Input grid line type for which to set the visibility
rows:  Input row type for which to set the visibility

Autodesk.AutoCAD.DatabaseServices.Table.TableStyleOverrides
This function returns the table style overrides.

Autodesk.AutoCAD.DatabaseServices.Table.ClearTableStyleOverrides(System.Int32)
Clears the overrides used in a table and its cells.
options:  Input System.Int32 object.

Autodesk.AutoCAD.DatabaseServices.Table.SetCellType(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.TableCellType)
This function sets the cell type to be applied to the cell at the specified location in the table.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell
type:  Input enum value specifying the cell type

Autodesk.AutoCAD.DatabaseServices.Table.GetCellExtents(System.Int32,System.Int32,System.Boolean,Autodesk.AutoCAD.Geometry.Point3dCollection)
Gets the cell extents for the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell
isOuterCell:  Output System.Boolean object indicating whether the specified cell is an outer cell
pts:  Output Autodesk.AutoCAD.Geometry.Point3dCollection object; point collection containing the cell extents information

Autodesk.AutoCAD.DatabaseServices.Table.AttachmentPoint(System.Int32,System.Int32)
Returns the attachment point of the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.CellStyleOverrides(System.Int32,System.Int32)
Returns the cell overrides for the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.DeleteCellContent(System.Int32,System.Int32)
This function deletes the cell content for the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.RowType(System.Int32)
Returns the row type of the specified row in the table.
row:  Input zero-based row index

Autodesk.AutoCAD.DatabaseServices.Table.TextStringConst(System.Int32,System.Int32)
Returns a copy of the null-terminated text string in the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.TextString(System.Int32,System.Int32)
Returns a copy of the null-terminated text string in the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetTextString(System.Int32,System.Int32,System.Int32,System.String)
Sets the text for the first content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents
text:  Input null-terminated text string

Autodesk.AutoCAD.DatabaseServices.Table.SetTextString(System.Int32,System.Int32,System.String)
This function makes a copy of text and uses the copy as the value in the specified cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
value:  Input null-terminated text string

Autodesk.AutoCAD.DatabaseServices.Table.FieldId(System.Int32,System.Int32)
Returns the object ID of the Field in the specified cell.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetFieldId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the Field object ID for the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.
fieldId:  Input field id to set

Autodesk.AutoCAD.DatabaseServices.Table.TextRotation(System.Int32,System.Int32)
This function returns the rotation angle of the text in the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.IsAutoScale(System.Int32,System.Int32)
This function returns the status of the mBlockAutoFit flag at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetAutoScale(System.Int32,System.Int32,System.Boolean)
This function sets the auto fit flag, which determines whether to automatically fit the block into the specified cell. If autoFit is true, the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell.
This method is deprecated and may be removed in a future release.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
autoFit:  Input Boolean indicating whether to auto fit the block at the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.BlockTableRecordId(System.Int32,System.Int32)
Returns the object ID of the block table record at the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockTableRecordId(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the id of the block table record for the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
blockId:  Input block table record id to set
autoFit:  Input System.Boolean object indicating whether to auto fit the block into the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockTableRecordId(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
This function sets the object ID of the block table record at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
blockId:  Input BlockTableRecord object ID
autoFit:  Input indicating whether to auto fit the block into the specified cell

Autodesk.AutoCAD.DatabaseServices.Table.BlockScale(System.Int32,System.Int32)
This function returns the scale factor of the block reference at the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockScale(System.Int32,System.Int32,System.Double)
This function sets the scale factor of the block reference at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
scale:  Input scale factor

Autodesk.AutoCAD.DatabaseServices.Table.BlockRotation(System.Int32,System.Int32)
This function returns the rotation angle of the block reference at the specified cell in the table.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockRotation(System.Int32,System.Int32,System.Double)
This function sets the rotation angle of the block reference at the specified cell in the table.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
rotationalAngle:  Input rotation angle

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Gets the block attribute value if the content at the specified content index is a block with attributes.
row:  Input System.Int32 object specifying the zero-based row index for the cell
column:  Input System.Int32 object specifying the zero-based column index for the cell
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
attDefId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object.

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function gets the attribute value from the block cell using the specified object ID key.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell
attributeDefinitionId:  Input Autodesk.AutoCAD.DatabaseServices.ObjectId object.

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockAttributeValue(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Sets the block attribute value if the content at the specified content index is a block with attributes.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents
attDefId:  Input the object ID of the AttributeDefinition object
value:  Input character string specifying attribute value

Autodesk.AutoCAD.DatabaseServices.Table.SetBlockAttributeValue(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.String)
Sets the block attribute value if the content at the specified content index is a block with attributes.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
attributeDefinitionId:  Input the object ID of an of AttributeDefinition object
value:  Input character string specifying attribute v

Autodesk.AutoCAD.DatabaseServices.Table.DeleteColumns(System.Int32,System.Int32)
This function deletes the specified number of columns from the table at the column index col.
col:  Input System.Int32 object specifying the zero-based column index for the cell
columns:  Input System.Int32 object number of columns to delete

Autodesk.AutoCAD.DatabaseServices.Table.DeleteRows(System.Int32,System.Int32)
This function deletes the specified number of rows from the table at the row index row.
row:  Input System.Int32 object specifying the zero-based row index for the cell
rows:  Input System.Int32 object number of rows to delete

Autodesk.AutoCAD.DatabaseServices.Table.IsMergedCell(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellRange&)
This function returns true if the specified cell is within merged cells.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
range:  Output the range of merged cells

Autodesk.AutoCAD.DatabaseServices.Table.DataType(System.Int32,System.Int32)
Returns the data type and unit type of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.UnitType(System.Int32,System.Int32)
Returns the object ID of the unit type of the specified cell.
row:  Input the zero-based row index for the cell
col:  Input the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetDataType(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.DataTypeParameter)
Sets the data type of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
dataType:  Input data type to set

Autodesk.AutoCAD.DatabaseServices.Table.Format(System.Int32,System.Int32)
Returns the cell format based on the zero-based row and column index.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.SetFormat(System.Int32,System.Int32,System.String)
For internal use.
row:  Input System.Int32 object specifying the zero-based row index for the cell
col:  Input System.Int32 object specifying the zero-based column index for the cell
pFormat:  Input format string to set

Autodesk.AutoCAD.DatabaseServices.Table.SetFormat(System.String,System.Int32)
For internal use.
pFormat:  Input System.String object.
rowTypes:  Input System.Int32 object.

Autodesk.AutoCAD.DatabaseServices.Table.Value(System.Int32,System.Int32)
Returns the content type of the content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
col:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Int32,System.Object)
Sets the value of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
value:  Input value to be set

Autodesk.AutoCAD.DatabaseServices.Table.SetValue(System.Int32,System.Int32,System.Object)
Sets the value of the first content of a cell.
row:  Input specifying the zero-based row index for the cell
col:  Input specifying the zero-based column index for the cell
pValue:  Input value to set

Autodesk.AutoCAD.DatabaseServices.Table.ResetValue(System.Int32,System.Int32)
Resets the value in a particular cell.
row:  Input object specifying the zero-based row index for the cell
col:  Input object specifying the zero-based column index for the cell

Autodesk.AutoCAD.DatabaseServices.Table.CanInsertRow(System.Int32)
Checks if new rows can be inserted at the specified index.
index:  Input System.Int32 object to check if new row can be inserted.

Autodesk.AutoCAD.DatabaseServices.Table.CanInsertColumn(System.Int32)
Checks if new columns can be inserted at the specified index.
index:  Input System.Int32 object to check if new column can be inserted.

Autodesk.AutoCAD.DatabaseServices.Table.CanDeleteRows(System.Int32,System.Int32)
Checks if the row can be deleted from the specified index.
index:  Input System.Int32 object to check if a row can be deleted.
nCount:  Input number of rows to delete

Autodesk.AutoCAD.DatabaseServices.Table.CanDeleteColumns(System.Int32,System.Int32)
Checks if the column can be deleted from the specified index.
index:  Input System.Int32 object to check if a column can be deleted.
nCount:  Input number of columns to delete

Autodesk.AutoCAD.DatabaseServices.Table.GetEnumerator(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.TableEnumeratorOption)
Returns the enumerator object within the specified range based on the table enumeration option.
range:  Input range of cells to delete the contents
option:  Input enumerator option

Autodesk.AutoCAD.DatabaseServices.Table.GetEnumerator
Returns the enumerator object.

Autodesk.AutoCAD.DatabaseServices.Table.IsEmpty(System.Int32,System.Int32)
Checks if the content of the specified cell is empty
Returns true if the cell is empty, false if not.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetMergeRange(System.Int32,System.Int32)
Returns merge range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.IsContentEditable(System.Int32,System.Int32)
This function checks the cell state to determine if a cell content can be modified.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.IsFormatEditable(System.Int32,System.Int32)
This function checks the cell state to determine if a cell format can be modified.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetCellState(System.Int32,System.Int32)
Returns the cell state.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetCellState(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellStates)
Sets the cell state.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
cellState:  Input cell state to set. This will replace all the bits of the current state

Autodesk.AutoCAD.DatabaseServices.Table.CreateContent(System.Int32,System.Int32,System.Int32)
This function is called to create additional contents for a cell; one is created by default.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetNumberOfContents(System.Int32,System.Int32)
Returns the number of contents in the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.MoveContent(System.Int32,System.Int32,System.Int32,System.Int32)
Moves a content in a cell from one position to another position within the cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
fromIndex:  Input index of the content to move
toIndex:  Input get index to which the content should be moved

Autodesk.AutoCAD.DatabaseServices.Table.DeleteContent(Autodesk.AutoCAD.DatabaseServices.CellRange)
Deletes all the contents in a range of cells.
range:  Input range of cells to delete the contents

Autodesk.AutoCAD.DatabaseServices.Table.DeleteContent(System.Int32,System.Int32,System.Int32)
Deletes content from a cell from the specified index.
row:  Input row index. It should be more than or equal to 0 and less than the number of row.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.DeleteContent(System.Int32,System.Int32)
Deletes all the contents in a cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetContentTypes(System.Int32,System.Int32,System.Int32)
Returns the content type of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetContentTypes(System.Int32,System.Int32)
Returns the content type of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetValue(System.Int32,System.Int32,System.Int32)
Returns the value of the first content based on the specified contentIndex.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataFormat(System.Int32,System.Int32,System.Int32)
Returns the data format of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataFormat(System.Int32,System.Int32)
Returns the data format of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataFormat(System.Int32,System.Int32,System.Int32,System.String)
Sets the data format of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
format:  Input data format to set

Autodesk.AutoCAD.DatabaseServices.Table.SetDataFormat(System.Int32,System.Int32,System.String)
Sets the data format of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
format:  Input data format to set

Autodesk.AutoCAD.DatabaseServices.Table.GetTextString(System.Int32,System.Int32,System.Int32)
Returns the text for the first content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents

Autodesk.AutoCAD.DatabaseServices.Table.HasFormula(System.Int32,System.Int32,System.Int32)
Returns true if the content at the specified index is a formula.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetFormula(System.Int32,System.Int32,System.Int32)
Returns the formula if the content at the specified content index has a formula, otherwise returns empty string.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetFormula(System.Int32,System.Int32,System.Int32,System.String)
Sets the formula at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
formula:  Input formula to set.

Autodesk.AutoCAD.DatabaseServices.Table.GetFieldId(System.Int32,System.Int32,System.Int32)
Returns the id of the field at the specified index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetBlockTableRecordId(System.Int32,System.Int32,System.Int32)
Returns the id of the block table record for the content at the specified content index.
row:  Input System.Int32 object specifying the zero-based row index for the cell
column:  Input System.Int32 object specifying the zero-based column index for the cell
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetCustomData(System.Int32,System.Int32,System.String)
Gets the custom data value set in cell, row, or column as key-value pairs.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
key:  Input key to store the custom data

Autodesk.AutoCAD.DatabaseServices.Table.GetCustomData(System.Int32,System.Int32)
Returns the custom data value set in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.

Autodesk.AutoCAD.DatabaseServices.Table.SetCustomData(System.Int32,System.Int32,System.String,System.Object)
Sets the custom data value set in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
key:  Input key to use for the custom data
value:  Input custom data to set. If this is NULL, it deletes the custom data.

Autodesk.AutoCAD.DatabaseServices.Table.SetCustomData(System.Int32,System.Int32,System.Int32)
Sets the custom data value set in cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
data:  Input custom data to set. If this is NULL, it deletes the custom data.

Autodesk.AutoCAD.DatabaseServices.Table.GetCellStyle(System.Int32,System.Int32)
Returns the the cell style of a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.

Autodesk.AutoCAD.DatabaseServices.Table.SetCellStyle(System.Int32,System.Int32,System.String)
Sets the the cell style of a cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
styleName:  Input cell style to set. The cell style should exist in the table style set in this table.

Autodesk.AutoCAD.DatabaseServices.Table.GetMargin(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellMargins)
Returns the margin of cell, row, or column.
row:  Input row index. Pass the value -1 if you are only concerned with the column.
column:  Input row index. Pass the value -1 if you are only concerned with the row.
margin:  Input margin type to get

Autodesk.AutoCAD.DatabaseServices.Table.SetMargin(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellMargins,System.Double)
Sets the margin of cell, row, or column.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
margin:  Input margin type to set. Multiple margin types can be combined using OR
value:  Input margin value to set

Autodesk.AutoCAD.DatabaseServices.Table.GetContentColor(System.Int32,System.Int32,System.Int32)
Returns the color of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataType(System.Int32,System.Int32,System.Int32)
Returns the data type and unit type of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetTextStyleId(System.Int32,System.Int32,System.Int32)
Returns the text style of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetTextStyleId(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId)
Sets the text style of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
id:  Input text style

Autodesk.AutoCAD.DatabaseServices.Table.GetTextHeight(System.Int32,System.Int32,System.Int32)
Returns the text height of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.GetRotation(System.Int32,System.Int32,System.Int32)
Returns the rotation angle of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetRotation(System.Int32,System.Int32,System.Int32,System.Double)
Sets the rotation angle of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
angle:  Input angle in radians

Autodesk.AutoCAD.DatabaseServices.Table.GetIsAutoScale(System.Int32,System.Int32,System.Int32)
This function returns the status of the mBlockAutoFit flag at the specified cell in the table.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetIsAutoScale(System.Int32,System.Int32,System.Int32,System.Boolean)
This function returns the status of the autoFit flag at the specified cell in the table. If this flag is true, the Table object automatically computes the scale and insertion point for the block content in order to fit it into the specified cell.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
autoFit:  Input status of autofit flag

Autodesk.AutoCAD.DatabaseServices.Table.GetScale(System.Int32,System.Int32,System.Int32)
Returns the scale of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.

Autodesk.AutoCAD.DatabaseServices.Table.SetScale(System.Int32,System.Int32,System.Int32,System.Double)
Sets the scale of the content at the specified content index.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
contentIndex:  Input content index. It should be more than or equal to 0 and less than the number of contents.
scale:  Input angle in radians

Autodesk.AutoCAD.DatabaseServices.Table.GetContentLayout(System.Int32,System.Int32)
Returns the content layout of the first content.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetMergeAllEnabled(System.Int32,System.Int32)
Returns true if the merge-all flag is enabled in a row or column, else false.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetMergeAllEnabled(System.Int32,System.Int32,System.Boolean)
Enables the merge-all flag in a row or column.
row:  Input zero-based row index
column:  Input zero-based column index
enable:  Input status of merge all for the cell

Autodesk.AutoCAD.DatabaseServices.Table.GetOverrides(System.Int32,System.Int32,System.Int32)
Overloads for the Table.GetOverrides method.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
contentIndex:  Input content index.

Autodesk.AutoCAD.DatabaseServices.Table.SetOverrides(System.Int32,System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.CellProperties)
Sets the override in cell, row, column, or content.
row:  Input row index. This can be -1.
column:  Input column index. This can be -1.
contentIndex:  Input content index. This can be -1.
override:  Input override to set

Autodesk.AutoCAD.DatabaseServices.Table.RemoveAllOverrides(System.Int32,System.Int32)
Removes all the overrides in cell, row, or column.
row:  Input row index. Insert the value -1 if you are only concerned with a column.
column:  Input column index. Insert the value -1 if you are only concerned with a row.

Autodesk.AutoCAD.DatabaseServices.Table.IsLinked(System.Int32,System.Int32)
Checks if a cell is linked to a data source.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange)
Gets the data links set in the specified range.
range:  Input range to get the data links. If this is NULL it gets all the data links in the table.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLink(System.Int32,System.Int32)
Returns the id of the data link if the specified cell is linked to a data source using a data link.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataLink(Autodesk.AutoCAD.DatabaseServices.CellRange,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell.
If the specified cell is top-left cell of an existing linked range this will overwrite the current data link. If it is any other cell in a linked range the function will fail. This function does not automatically update the data; call updateDataLink() to update the data.
range:  Input range to get the data links. If this is NULL it gets all the data links in the table.
dataLinkId:  Output reference to an array to receive the data link IDs.
bUpdate:  Input true if the data link is to be updated after setting it, false if not.

Autodesk.AutoCAD.DatabaseServices.Table.SetDataLink(System.Int32,System.Int32,Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Boolean)
Sets the specified data link in a cell.
If the specified cell is top-left cell of an existing linked range this will overwrite the current data link. If it is any other cell in a linked range the function will fail. This function does not automatically update the data; call updateDataLink() to update the data.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.
dataLinkId:  Input the data link object
bUpdate:  Input true if the data link is to be updated after setting it, false if not.

Autodesk.AutoCAD.DatabaseServices.Table.GetDataLinkRange(System.Int32,System.Int32)
Returns the data link range if the specified cell is part of a linked range.
row:  Input row index. It should be more than or equal to 0 and less than the number of rows.
column:  Input column index. It should be more than or equal to 0 and less than the number of columns.

Autodesk.AutoCAD.DatabaseServices.Table.RemoveDataLink(System.Int32,System.Int32)
Removes the data link in the specified cell.
row:  Input row index. Insert the value -1 if you are only concerned with a column.
column:  Input column index. Insert the value -1 if you are only concerned with a row.

Autodesk.AutoCAD.DatabaseServices.Table.NumRows
Returns a non-negative integer representing the number of rows in the table.

Autodesk.AutoCAD.DatabaseServices.Table.NumColumns
Returns a non-negative integer representing the number of columns in the table.

Autodesk.AutoCAD.DatabaseServices.Table.Width
Returns the total width for the  table.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumTableWidth
Returns the minimum total width for  the table.

Autodesk.AutoCAD.DatabaseServices.Table.MinimumTableHeight
Returns the minimum total height for  the table.

Autodesk.AutoCAD.DatabaseServices.Table.HorizontalCellMargin
Returns the horizontal cell margin for the table.

Autodesk.AutoCAD.DatabaseServices.Table.VerticalCellMargin
Returns the vertical cell margin for the table.

Autodesk.AutoCAD.DatabaseServices.Table.IsTitleSuppressed
Returns true if the title row of the table is suppressed, or false if it is not.

Autodesk.AutoCAD.DatabaseServices.Table.IsHeaderSuppressed
Returns true if the header row of the table is suppressed, or false if it is not.

Autodesk.AutoCAD.DatabaseServices.Table.HasSubSelection
Returns true if the table has a  subselection set.