Autodesk.AutoCAD.DatabaseServices.SectionSettings.Reset
Resets the settings for the specified section type to defaults based on the section type nSecType whose settings are to be reset.
nSecType:  Input section type to be reset