Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetBlockReferenceIds(System.Boolean,System.Boolean)
This function returns a list of BlockReferences that either directly or indirectly, through block nesting, reference this block. It only returns those block references that are currently active. Use getErasedBlockReferenceIds() to get a list of erased references.
directOnly:  Input an indication that only those BlockReferences that directly refer to this BlockTableRecord should be included in the IDs. If this value is true and the block is nested, the parent block's references will not be included.
forceValidity:  Input an indication that older drawings which have been demand loaded should be loaded completely, in order to find their BlockReferenceIds. This is because older drawings did not store this information. This parameter is only applicable if directOnly is false.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetErasedBlockReferenceIds
This function returns a list of BlockReferences that directly reference this block.

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.GetXrefDatabase(System.Boolean)
This function returns the database that defines this block table record’s contents. If incrementUnresolved is true, then a database will be returned, even if the xref block table record is currently unresolved (for reasons other than that the xref drawing file could not be found).
incrementUnresolved:  Input an indication whether or not to return the database of an unresolved xref

Autodesk.AutoCAD.DatabaseServices.BlockTableRecord.AssumeOwnershipOf(Autodesk.AutoCAD.DatabaseServices.ObjectIdCollection)
This method causes the invoked block table record to assume the ownership of all the entities listed in the input entitiesToMove collection, and provides an optimized way of moving entities between block table records.
entitiesToMove:  Input a collection of entities to change ownership of