Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPoints
This function returns all the consecutive distinct corner points of the Fcf object.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetBoundingPolyline
This function returns a Point3dCollection as follows: ptArray[0] == top left corner of Fcf
ptArray[1] == top right corner of Fcf
ptArray[2] == bottom right corner of Fcf
ptArray[3] == bottom left corner of Fcf
All points are in WCS coordinates.

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.SetDimstyleData(Autodesk.AutoCAD.DatabaseServices.DimStyleTableRecord)
Sets a new dimension variable as determiend by style.
style:  Input objectId of the desired DimensionStyle to be used by the Fcf

Autodesk.AutoCAD.DatabaseServices.FeatureControlFrame.GetDimstyleData
This function copies and returns the DimStyle information from the DimensionStyleTableRecord referenced by this object.