Autodesk.AutoCAD.DatabaseServices.Filters.Index.RebuildFull(Autodesk.AutoCAD.DatabaseServices.Filters.IndexUpdateData)
This function completely rebuilds the index from the entities in the associated block table record.
indexData:  Input IndexUpdateData object for use during the index rebuild