Autodesk.AutoCAD.DatabaseServices.Polyline3d.Straighten
This function removes all spline and curve-fit vertices from the polyline or mesh and sets all remaining vertices to be simple vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.SplineFit
This function removes any existing spline or curve-fit vertices, converts all remaining vertices to spline-control vertices, and generates a new set of spline-fit vertices.

Autodesk.AutoCAD.DatabaseServices.Polyline3d.AppendVertex(Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
This function appends the PolylineVertex3d object pointed to by vertexToAppend to the vertex list of the polyline and establishes the polyline as the vertex's owner.
vertexToAppend:  Input pointer to the vertex to add to the polyline

Autodesk.AutoCAD.DatabaseServices.Polyline3d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.ObjectId,Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
This function inserts the PolylineVertex3d object pointed to by newVertex into the vertex list of the polyline just after the PolylineVertex3d object pointed to by indexVertexId and establishes the polyline as the vertex's owner.
indexVertexId:  Input vertex in polyline after which the new vertex is to be inserted
newVertex:  Input vertex to be inserted

Autodesk.AutoCAD.DatabaseServices.Polyline3d.InsertVertexAt(Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d,Autodesk.AutoCAD.DatabaseServices.PolylineVertex3d)
This function inserts the PolylineVertex3d object pointed to by newVertex into the vertex list of the polyline just after the PolylineVertex3d object with objectId indexVertId, establishes the polyline as the vertex's owner, and adds the vertex to the Database that contains the polyline (the polyline must be database-resident for this function to succeed).
indexVertex:  Input objectId of the vertex in the polyline after which the new vertex is to be inserted
newVertex:  Input vertex to be inserted