Autodesk.AutoCAD.DatabaseServices.Transaction.GetAllObjects
This function returns all the objects currently open in the transaction.

Autodesk.AutoCAD.DatabaseServices.Transaction.Commit
This function commits the changes made in all the DBObjects opened during the Transaction, and then closes them.