Autodesk.AutoCAD.GraphicsInterface.Context.IsPostScriptOut
Returns true if the regen is for the purposes of PostScript out; otherwise, returns false.

Autodesk.AutoCAD.GraphicsInterface.Context.IsNesting
Returns true if the system is regenerating a.

Autodesk.AutoCAD.GraphicsInterface.Context.SupportsTrueTypeText
Returns true if the current implementation of  supports True type font elaboration.