Autodesk.AutoCAD.GraphicsInterface.Geometry.PushScaleTransform(Autodesk.AutoCAD.GraphicsInterface.ScaleBehavior,Autodesk.AutoCAD.Geometry.Point2d)
This method places scale transform behavior onto the current transform stack.
behavior:  Input scale transformation behavior
extents:  Input new scale values

Autodesk.AutoCAD.GraphicsInterface.Geometry.PushScaleTransform(Autodesk.AutoCAD.GraphicsInterface.ScaleBehavior,Autodesk.AutoCAD.Geometry.Point3d)
This method places scale transform behavior onto the current transform stack.
behavior:  Input scale transformation behavior
extents:  Input new scale values

Autodesk.AutoCAD.GraphicsInterface.Geometry.PolyPolyline(Autodesk.AutoCAD.GraphicsInterface.PolylineCollection)
This .NET method wraps the ObjectARX method AcGiGeometry::polyPolyline().
polylineCollection:  Input a PolylineCollection object

Autodesk.AutoCAD.GraphicsInterface.Geometry.RowOfDots(System.Int32,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d)
This method draws a row of dots.
count:  Input the number of dots
start:  Input the start point for the row of dots
step:  Input the step among the row of dots

Autodesk.AutoCAD.GraphicsInterface.Geometry.OwnerDraw(Autodesk.AutoCAD.GraphicsInterface.GdiDrawObject,Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
The method draws a GDI owner draw object.
gdiDrawObject:  Input GDI owner draw object.
position:  Input start or insertion point for the GDI owner draw object.
u:  Input orientation and magnitude of width.
v:  Input orientation and magnitude of height.

Autodesk.AutoCAD.GraphicsInterface.Geometry.Edge(Autodesk.AutoCAD.Geometry.Curve2dCollection)
This is Edge, a member of class Geometry.