Autodesk.AutoCAD.DatabaseServices.SweptSurface.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.SweepEntity
Returns the  sweep entity that describes this surface.

Autodesk.AutoCAD.DatabaseServices.SweptSurface.ProfileRotation
Specifies angle sweep of profile  object.