Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.DatabaseServices.ObjectId)
This function sets the UCS for the view or viewport table record.
id:  Input the object which references a UcsTableRecord.

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcs(Autodesk.AutoCAD.Geometry.Point3d,Autodesk.AutoCAD.Geometry.Vector3d,Autodesk.AutoCAD.Geometry.Vector3d)
This function sets the UCS for the view or viewport table record.
origin:  Input the object to act as an origin
y:  Input the object to act as a Y-coordinate

Autodesk.AutoCAD.DatabaseServices.AbstractViewTableRecord.SetUcsToWorld
This function sets the UCS for the view or viewport table record to the world UCS.