Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.IsShapeFile
This returns true when the text font file is interpreted as a shape record, otherwise it returns false when it is interpreted as a text record.

Autodesk.AutoCAD.DatabaseServices.TextStyleTableRecord.XScale
This property returns the width factor (also referred to as the relative X-scale factor) for the TextStyleTableRecord.