Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextStyle(Autodesk.AutoCAD.DatabaseServices.ObjectId,System.Int32)
This function sets the table object to use the TextStyleTableRecord specified by ID for the specified row types.
id:  Input TextStyleTableRecord object ID
rowTypes:  Input row types

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetTextHeight(System.Double,System.Int32)
This function sets the text height for the specified row types.
height:  Input value indicating the new text height
rowTypes:  Input row types for which to set the text height

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetBackgroundColorNone(System.Boolean,System.Int32)
This function enables or disables the background color for the specified row types. Different row types can be OR'd.
value:  Input Boolean indicating whether to enable the background color for the specified row type
rowTypes:  Input row types for which to enable or disable the background color

Autodesk.AutoCAD.DatabaseServices.TableStyle.SetGridVisibility(System.Boolean,System.Int32,System.Int32)
This function sets the grid visibility for the specified grid line types and row types. Different grid line and row types can be OR'd.
visible:  Input visibility value
gridLineTypes:  Input grid line types for which to set the visibility
rowTypes:  Input row types for which to set the visibility