Autodesk.AutoCAD.DatabaseServices.Section.#ctor
Constructor.

Autodesk.AutoCAD.DatabaseServices.Section.GetVertices(Autodesk.AutoCAD.Geometry.Point3dCollection)
This function returns all section plane vertices in the pts array.
pts:  Output reference to receive vertices

Autodesk.AutoCAD.DatabaseServices.Section.SetHeight(Autodesk.AutoCAD.DatabaseServices.SectionHeight,System.Double)
Overloads for the Section.SetHeight method.
nHeightType:  Input one of the Height enum val
fHeight:  Input height Sets the height of the section plane above or below the section line. The height is the indicator height when the section plane type is plane or boundary, since the cuts extends infinitely in the vertical direction for these two types.

Autodesk.AutoCAD.DatabaseServices.Section.GenerateSectionGeometry(Autodesk.AutoCAD.DatabaseServices.Entity,System.Array&,System.Array&,System.Array&,System.Array&,System.Array&)
This function generates 2D or 3D section geometry.
pEnt:  Input sectionable entity
pIntFillEnts:  Return array containing intersection boundary geometry
pBackgroundEnts:  Return array containing intersection fill annotation geometry
pForegroundEnts:  Return array containing background geometry
pFurveTangencyEnts:  Return array containing foreground geometry
pCurveTangencyEnts:  Return array containing curve tangency geometry

Autodesk.AutoCAD.DatabaseServices.Section.Normal
Returns the normal  vector.

Autodesk.AutoCAD.DatabaseServices.Section.Vertices
Returns the 3d vertices of the section plane.

Autodesk.AutoCAD.DatabaseServices.Section.Settings
Returns  the setting property value.

Autodesk.AutoCAD.DatabaseServices.Section.IsLiveSectionEnabled
Returns true if live sectioning is  enabled in the section plane.