Autodesk.AutoCAD.Windows.DocumentWindow
Wrapper (wraps AcApDocWindow).

Autodesk.AutoCAD.Windows.DocumentWindow.Close
Closes the document window.

Autodesk.AutoCAD.Windows.DocumentWindow.Activate
Activates the document window.

Autodesk.AutoCAD.Windows.DocumentWindow.DocumentWindowLoaded
This event will be sent when the document for the document window is ready.

Autodesk.AutoCAD.Windows.DocumentWindow.DocumentWindowUpdated
This is DocumentWindowUpdated, a member of class DocumentWindow.

Autodesk.AutoCAD.Windows.DocumentWindow.Title
Gets or sets the title of the document window.

Autodesk.AutoCAD.Windows.DocumentWindow.Document
Gets the document attached to the document window.

Autodesk.AutoCAD.Windows.DocumentWindow.CanUpdate
This is CanUpdate, a member of class DocumentWindow.