Autodesk.AutoCAD.Windows.StatusBar
This .NET class wraps the AcApStatusBar ObjectARX class.

Autodesk.AutoCAD.Windows.StatusBar.GetDefaultPane(Autodesk.AutoCAD.Windows.DefaultPane)
Returns the specified default pane or null if the specified pane is not found in the status bar.
pane:  Input one of the valid values from DefaultPane enumeration.

Autodesk.AutoCAD.Windows.StatusBar.RemoveDefaultPane(Autodesk.AutoCAD.Windows.DefaultPane)
Removes one or more default panes from the status bar.
pane:  Input Autodesk.AutoCAD.Windows.DefaultPane object. Input bitwise union of one or more of the valid DefaultPane enums.

Autodesk.AutoCAD.Windows.StatusBar.CloseBubbleWindows
Closes the bubble window.

Autodesk.AutoCAD.Windows.StatusBar.Update
Updates all panes and tray items in the status bar.

Autodesk.AutoCAD.Windows.StatusBar.Panes
Gets the collection of Panes in the status bar.

Autodesk.AutoCAD.Windows.StatusBar.TrayItems
Gets the collection of TrayItems in the status bar.

Autodesk.AutoCAD.Windows.StatusBar.Window
Accesses the window of the status bar.