Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor
This .NET class wraps the ObjectARX AcEdInplaceTextEditor class.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Invoke(Autodesk.AutoCAD.DatabaseServices.MText,Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings)
This wraps AcEdInplaceTextEditor::invoke(AcDbMText* pMtext, const AcEdInplaceTextEditorSettings* pSettings).

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Undo
This wrapsAcEdInplaceTextEditor::undo().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Redo
This wrapsAcEdInplaceTextEditor::redo().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Cut
This wraps AcEdInplaceTextEditor::cut().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Copy
This wraps AcEdInplaceTextEditor::copy().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Paste
This wraps AcEdInplaceTextEditor::paste().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.PasteWithoutFormats
This wraps AcEdInplaceTextEditor::pasteWithoutFormats().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ReplaceAllMatches(System.Int32,System.String,System.String)
This wraps AcEdInplaceTextEditor::replaceAllMatchItems().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ReplaceCurrentMatch(System.Int32,System.String,System.String)
This wraps AcEdInplaceTextEditor::replaceCurrentMatchItem().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.FindMatchItem(System.Int32,System.String)
This wraps AcEdInplaceTextEditor::findMatchItem().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.DrawHightlight
This wraps AcEdInplaceTextEditor::drawHighlight().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.RemoveHightlight
This wrapsAcEdInplaceTextEditor::removeHightlight().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.InsertFile(System.String)
This wraps AcEdInplaceTextEditor::insertFile().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.OtherSymbol
This wraps AcEdInplaceTextEditor::otherSymbol().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ParagraphDialog
This wrapsAcEdInplaceTextEditor::invokeParagraphDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.WipeoutDialog
This wrapsAcEdInplaceTextEditor::invokeWipeoutDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ColumnsDialog(System.Int32)
This .NET method wraps the ObjectARX AcEdInplaceTextEditor::invokeColumnsDialog method.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.FindAndReplaceDialog
This wraps AcEdInplaceTextEditor::invokeFindReplaceDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ImportTextDialog
This wrapsAcEdInplaceTextEditor::invokeImportTextDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.FieldDialog(Autodesk.AutoCAD.DatabaseServices.Field)
This wraps AcEdInplaceTextEditor::invokeFieldDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.SpellSettingDialog
This wraps AcEdInplaceTextEditor::invokeSpellSettingDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.SpellDictionaryDialog
This wraps AcEdInplaceTextEditor::invokeSpellerDictionaryDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.HightlightColorDialog
This wraps AcEdInplaceTextEditor::invokeHightlightColorDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.HelpDialog
This wraps AcEdInplaceTextEditor::invokeHelpDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.NewFeatureWorkShop
This wraps AcEdInplaceTextEditor::invokeNewFeatureWorkshop().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.StackPropertyDialog
This wraps AcEdInplaceTextEditor::invokeStackPropertyDialog().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ColumnMenus(System.Drawing.Point,Autodesk.AutoCAD.Windows.Window)
This .NET method wraps the ObjectARX AcEdInplaceTextEditor::columnMenusInput method.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.AttachmentMenus(System.Drawing.Point,Autodesk.AutoCAD.Windows.Window)
This .NET method wraps the ObjectARX AcEdInplaceTextEditor::attachmentMenusInput method.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.LineSpaceMenus(System.Drawing.Point,Autodesk.AutoCAD.Windows.Window)
This wraps AcEdInplaceTextEditor::lineSpaceMenusInput().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.NumberingMenus(System.Drawing.Point,Autodesk.AutoCAD.Windows.Window)
This wrapsAcEdInplaceTextEditor::numberingMenusInput().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.SymbolMenus(System.Drawing.Point,Autodesk.AutoCAD.Windows.Window)
This wraps AcEdInplaceTextEditor::symbolMenusInput().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ContextMenus(System.Drawing.Point,Autodesk.AutoCAD.Windows.Window)
This .NET method wraps the ObjectARX AcEdInplaceTextEditor::contextMenusInput method.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.SetStaticColumnsWithCount(System.Int32)
This is SetStaticColumnsWithCount, a member of class InplaceTextEditor.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Current
This wraps AcEdInplaceTextEditor::current().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanUndo
This wraps AcEdInplaceTextEditor::canUndo().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanRedo
This wrapsAcEdInplaceTextEditor::canRedo().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Annotative
This wraps the ObjectARX AcEdInplaceTextEditor::annotative() and AcEdInplaceTextEditor::setAnnotative() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.TableCell
This wrapsAcEdInplaceTextEditor::isTableCell().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.SimpleMText
This wraps AcEdInplaceTextEditor::isSimpleMtext().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Text
This wraps AcEdInplaceTextEditor::isText().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.MultiAttribute
This wraps AcEdInplaceTextEditor::isMultiAttribute().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ParagraphSupported
This wraps AcEdInplaceTextEditor::isParagraphSupported().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.SpellerEnabled
This wraps the ObjectARX AcEdInplaceTextEditor::spellerEnabled() and AcEdInplaceTextEditor::toggleSpelling() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.RulerSupported
This wraps AcEdInplaceTextEditor::rulerSupported().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.RulerHidden
This wraps the ObjectARX AcEdInplaceTextEditor::rulerHidden() and AcEdInplaceTextEditor::setRulerHidden() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.OpaqueBackground
This wraps the ObjectARX AcEdInplaceTextEditor::opaqueBackground() and AcEdInplaceTextEditor::setOpaqueBackground() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ForcedOpaqueBackground
This wraps the ObjectARX AcEdInplaceTextEditor::forcedOpaqueBackground().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ToolbarHidden
This wraps the ObjectARX AcEdInplaceTextEditor::toolbarHidden() and AcEdInplaceTextEditor::setToolbarHidden() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.ToolbarOptionHidden
This wraps the ObjectARX AcEdInplaceTextEditor::toolbarOptionHidden() and AcEdInplaceTextEditor::setToolbarOptionHidden() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanExitEditor
This wraps the ObjectARX AcEdInplaceTextEditor::canExitInplaceEditor() and AcEdInplaceTextEditor::setCanExitInplaceEditor() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.LayerColor
This wraps AcEdInplaceTextEditor::layerColor().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.alginment
This wraps AcEdInplaceTextEditor::getAlignmentFromAttachment().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.Wysiwyg
This wraps AcEdInplaceTextEditor::wysiwyg() and AcEdInplaceTextEditor::enableWysiwyg() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.UndoRecordingDisabled
This wraps AcEdInplaceTextEditor::undoRecordingDisabled(), AcEdInplaceTextEditor::setUndoRecordingDisable() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanCut
This wraps AcEdInplaceTextEditor::canCut().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanCopy
This wraps AcEdInplaceTextEditor::canCopy().

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditor.CanPaste
This wraps AcEdInplaceTextEditor::canPaste().