Autodesk.AutoCAD.Windows.LineWeightDialog
This class represents a dialog box that allows the user to choose a lineweight.

Autodesk.AutoCAD.Windows.LineWeightDialog.ShowDialog
Shows line weight dialog box.

Autodesk.AutoCAD.Windows.LineWeightDialog.IncludeByBlockByLayer
True if meta lineweights are to be included, otherwise false.

Autodesk.AutoCAD.Windows.LineWeightDialog.LineWeight
Accesses the lineweight value.