Autodesk.AutoCAD.Windows.SaveFileDialog
This class represents a dialog box that allows the user to choose a file.

Autodesk.AutoCAD.Windows.SaveFileDialog.ShowDialog
Shows save file dialog box.

Autodesk.AutoCAD.Windows.SaveFileDialog.Filename
The filename chosen by the user.