Autodesk.AutoCAD.Windows.InfoCenter
This class manages the InfoCenter Manager and connects it with the InfoCenter toolbar.

Autodesk.AutoCAD.Windows.InfoCenter.LaunchSubAwareModule(System.Int16,System.String,System.String)
Description to come.
resReqid:  Input.
strCourseId:  Input.
strModuleId:  Input.

Autodesk.AutoCAD.Windows.InfoCenter.InvokeToolbarMoveEvent
Invokes the toolbar to be moved.

Autodesk.AutoCAD.Windows.InfoCenter.InvokeToolbarResizeEvent(System.Int32)
Invokes the toolbar to be resized.
width:  Input width

Autodesk.AutoCAD.Windows.InfoCenter.Visible
InfoCenter toolbar's visibility property value.

Autodesk.AutoCAD.Windows.InfoCenter.KeepFocus
Indicates whether the InfoCenter toolbar should retain focus or return it to the Application.

Autodesk.AutoCAD.Windows.InfoCenter.SubAwareClientInfo
Returns the client information.

Autodesk.AutoCAD.Windows.InfoCenter.UPIXMLData
This is UPIXMLData, a member of class InfoCenter.