Autodesk.AutoCAD.Windows.PaletteAddContextMenuEventArgs
This class provides data for the PaletteAddContextMenu event.

Autodesk.AutoCAD.Windows.PaletteAddContextMenuEventArgs.MenuItems
Accesses the a collection of the menu items.

Autodesk.AutoCAD.Windows.PaletteAddContextMenuEventArgs.RemoveMenuItems
Accesses a list of the removed menu items.

Autodesk.AutoCAD.Windows.PaletteAddContextMenuEventArgs.HitFlag
Location within the palette set of the event that triggered the context menu.

Autodesk.AutoCAD.Windows.PaletteAddContextMenuEventArgs.RightClickTab
Accesses the palette tab of the tab for which the context menu is being displayed.