Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs
This class provides data for the PaletteActivated event.

Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs.#ctor(Autodesk.AutoCAD.Windows.Palette,Autodesk.AutoCAD.Windows.Palette)
Constructs a new event argument.
activated:  Input palette to display when activated
deactivated:  Input palette to display when deactivated

Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs.Activated
Returns the Activated property value.

Autodesk.AutoCAD.Windows.PaletteActivatedEventArgs.Deactivated
Returns the Deactivated property value.