Autodesk.AutoCAD.ApplicationServices.DocumentExtension
.

Autodesk.AutoCAD.ApplicationServices.DocumentExtension.FromAcadDocument(System.Object)
Converts an object into a Document.
acadDocument:  Input the object to be converted