Autodesk.AutoCAD.Windows.Visuals
This class represents various reusable visuals of the AutoCAD editor.

Autodesk.AutoCAD.Windows.Visuals.ApplicationIcon
Represents the application icon, which is a small bitmap image used to represent an object.

Autodesk.AutoCAD.Windows.Visuals.PickSetBitmap
Sets the bitmap image property value.

Autodesk.AutoCAD.Windows.Visuals.PickBitmap
Picks the bitmap image property value.