Autodesk.AutoCAD.Windows.LinetypeDialog
This class represents a dialog box that allows the user to choose a linetype.

Autodesk.AutoCAD.Windows.LinetypeDialog.ShowDialog
Shows line type dialog box.

Autodesk.AutoCAD.Windows.LinetypeDialog.IncludeByBlockByLayer
True if meta linetypes are to be included, otherwise false.

Autodesk.AutoCAD.Windows.LinetypeDialog.Linetype
A linetype value.