Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute
This class encapsulates properties of IPerPropertyBrowsing objects implemented for a tool palette.

Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.ProgId
Returns the ProgId property value.

Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.LefIconResource
Returns the LefIconResource property value.

Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.LeftIconType
Returns the LeftIconType property value.

Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.EllipsisBmpResource
Returns the EllipsisBmpResource property value.

Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.EllipsisBmpType
Returns the EllipsisBmpType property value.

Autodesk.AutoCAD.Windows.ToolPalette.PerPropertyBrowsingEntryAttribute.IsFullView
Returns the IsFullView property value.