Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute
This class contains a tool's name and the name of its image.

Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute.#ctor(System.String,System.String)
Constructor.
toolName:  Input tool name
toolImage:  Input tool image location

Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute.ToolName
Returns the ToolName property value.

Autodesk.AutoCAD.Windows.ToolPalette.ToolAttribute.ToolImage
Returns the ToolImage property value.