Autodesk.AutoCAD.EditorInput.LivePreviewEventArgs
This is class Autodesk.AutoCAD.EditorInput.LivePreviewEventArgs.

Autodesk.AutoCAD.EditorInput.LivePreviewEventArgs.#ctor
This is LivePreviewEventArgs, a member of class LivePreviewEventArgs.

Autodesk.AutoCAD.EditorInput.LivePreviewEventArgs.LockDocument
This is LockDocument, a member of class LivePreviewEventArgs.

Autodesk.AutoCAD.EditorInput.LivePreviewEventArgs.Document
This is Document, a member of class LivePreviewEventArgs.

Autodesk.AutoCAD.EditorInput.LivePreviewEventArgs.Parameters
This is Parameters, a member of class LivePreviewEventArgs.

Autodesk.AutoCAD.EditorInput.LivePreviewEventArgs.CommandParameter
This is CommandParameter, a member of class LivePreviewEventArgs.