Autodesk.AutoCAD.Windows.PlotStyleDialog
This class represents a dialog box that allows the user to choose a plot style.

Autodesk.AutoCAD.Windows.PlotStyleDialog.ShowDialog
Shows plot style dialog box.

Autodesk.AutoCAD.Windows.PlotStyleDialog.IncludeByBlockByLayer
True if meta plotstyles are to be included, otherwise false.

Autodesk.AutoCAD.Windows.PlotStyleDialog.PlotStyle
Accesses the plotstyle value.