Autodesk.AutoCAD.Windows.MenuItemCollection
This collection contains MenuItem objects.

Autodesk.AutoCAD.Windows.MenuItemCollection.#ctor(Autodesk.AutoCAD.Windows.Menu)
Constructs a new collection.
owner:  Input the parent for this object

Autodesk.AutoCAD.Windows.MenuItemCollection.GetEnumerator
Returns an enumerator object for this collection.

Autodesk.AutoCAD.Windows.MenuItemCollection.RemoveAt(System.Int32)
Removes the object whose index in the collection is index.
index:  Input index of item to remove.

Autodesk.AutoCAD.Windows.MenuItemCollection.Clear
Removes all objects from the collection.

Autodesk.AutoCAD.Windows.MenuItemCollection.CopyTo(Autodesk.AutoCAD.Windows.MenuItem[],System.Int32)
Copies this collection or a portion of it to a one-dimensional array.
array:  Input one-dimensional array that is the destination of the elements copied from this collection; the array must have zero-based indexing.
index:  Input the zero-based index in array at which copying begins.

Autodesk.AutoCAD.Windows.MenuItemCollection.Insert(System.Int32,Autodesk.AutoCAD.Windows.MenuItem)
Inserts an element into the MenuItemCollection at the specified index.
index:  Input the zero-based index at which value should be inserted.
value:  Input the MenuItem to insert. The value can be a null reference.

Autodesk.AutoCAD.Windows.MenuItemCollection.Remove(Autodesk.AutoCAD.Windows.MenuItem)
Removes the first occurrence of a specific object from the collection.
value:  Input the MenuItem to remove from the collection; the value can be a null reference.

Autodesk.AutoCAD.Windows.MenuItemCollection.Contains(Autodesk.AutoCAD.Windows.MenuItem)
Determines whether an element is in the MenuItemCollection.
value:  Input the MenuItem to locate in this collection; the value can be a null reference.

Autodesk.AutoCAD.Windows.MenuItemCollection.IndexOf(Autodesk.AutoCAD.Windows.MenuItem)
Searches for the specified MenuItem and returns the zero-based index of the first occurrence of value within the entire collection, if found; otherwise, returns -1.
value:  Input the MenuItem to locate in the collection; the value can be a null reference.

Autodesk.AutoCAD.Windows.MenuItemCollection.Add(Autodesk.AutoCAD.Windows.MenuItem)
Adds an object to the end of the MenuItemCollection.
value:  Input the MenuItem to be added to the end of this collection; the value can be a null reference.

Autodesk.AutoCAD.Windows.MenuItemCollection.Count
Returns the number of elements actually contained in the MenuItemCollection.

Autodesk.AutoCAD.Windows.MenuItemCollection.IsFixedSize
Gets a value indicating whether the MenuItemCollection has a fixed size.

Autodesk.AutoCAD.Windows.MenuItemCollection.IsReadOnly
Gets a value indicating whether the MenuItemCollection is read-only.