Autodesk.AutoCAD.Windows.PaletteEnterSizeMoveEventArgs
This is class Autodesk.AutoCAD.Windows.PaletteEnterSizeMoveEventArgs.

Autodesk.AutoCAD.Windows.PaletteEnterSizeMoveEventArgs.#ctor(System.Boolean)
This is PaletteEnterSizeMoveEventArgs, a member of class PaletteEnterSizeMoveEventArgs.

Autodesk.AutoCAD.Windows.PaletteEnterSizeMoveEventArgs.EnterSizeMove
This is EnterSizeMove, a member of class PaletteEnterSizeMoveEventArgs.