Autodesk.AutoCAD.Windows.PaletteSetDockSite
This is class Autodesk.AutoCAD.Windows.PaletteSetDockSite.

Autodesk.AutoCAD.Windows.PaletteSetDockSite.Uninitialize
This is Uninitialize, a member of class PaletteSetDockSite.

Autodesk.AutoCAD.Windows.PaletteSetDockSite.Dock(Autodesk.AutoCAD.Windows.PaletteSet)
This is Dock, a member of class PaletteSetDockSite.