Autodesk.AutoCAD.EditorInput.ConstraintUtilities
This is class Autodesk.AutoCAD.EditorInput.ConstraintUtilities.

Autodesk.AutoCAD.EditorInput.ConstraintUtilities.ShowConstraintBar(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath[],System.Boolean)
This function is used to show or hide the constraint bars for all or a given set of constrained entities.
subentityPaths:  Array of full sub-entity paths of entities for which constraint bars are to be shown or hidden. If this array is empty, the show/hide action will then be applied to all constrained entities in the active document.
bToShow:  Set this to true to show constraint bars, set to false to hide constraint bars.