Autodesk.AutoCAD.Windows.Pane
This .NET class wraps the AcPane ObjectARX class.

Autodesk.AutoCAD.Windows.Pane.#ctor
Default constructor.

Autodesk.AutoCAD.Windows.Pane.Text
Returns the text displayed in the pane.

Autodesk.AutoCAD.Windows.Pane.Style
Returns the current pane style.

Autodesk.AutoCAD.Windows.Pane.MinimumWidth
Returns the new minimum width for the pane (in logical units).

Autodesk.AutoCAD.Windows.Pane.MaximumWidth
Returns the maximum width for the pane, in logical units.