Autodesk.AutoCAD.Windows.PaletteSetStateEventArgs
This class provides data for the PaletteSetState event.

Autodesk.AutoCAD.Windows.PaletteSetStateEventArgs.#ctor(Autodesk.AutoCAD.Windows.StateEventIndex)
COnstructs a new event argument with a given state.
state:  Input event index state

Autodesk.AutoCAD.Windows.PaletteSetStateEventArgs.NewState
Returns the NewState property value.