Autodesk.AutoCAD.Windows.PaletteSet
This .NET class wraps the AduiPaletteSet ObjectARX class.

Autodesk.AutoCAD.Windows.PaletteSet.#ctor(System.String)
Constructs a new palette set with the given name.
name:  Input name of palette set

Autodesk.AutoCAD.Windows.PaletteSet.EnableTransparency(System.Boolean)
This function is equivalent to CAdUiPaletteSet::SetAllowTransparency().
Sets whether to enable or disable transparency for the palette set.
A return of true indicates the function was successful.
value:  Input true to enable transparency

Autodesk.AutoCAD.Windows.PaletteSet.Activate(System.Int32)
Activates palette set window based on the index specified.
index:  Input index to activate

Autodesk.AutoCAD.Windows.PaletteSet.GetThemedIcon(System.Boolean)
Returns either the small (16x16) or large icon (32x32) of the palette set for the current theme.

Autodesk.AutoCAD.Windows.PaletteSet.SetThemedIcon(System.Drawing.Icon,Autodesk.AutoCAD.Internal.ColorThemeEnum)
A convenience method for setting the large and small icon for the given theme of the palette.
value:  icon to be set
theme:  theme to be applied to

Autodesk.AutoCAD.Windows.PaletteSet.Add(System.String,System.Uri)
This is Add, a member of class PaletteSet.

Autodesk.AutoCAD.Windows.PaletteSet.Add(System.String,System.Windows.Forms.Control)
Adds palette set window.
name:  Input palette name
control:  Input palette control

Autodesk.AutoCAD.Windows.PaletteSet.AddVisual(System.String,System.Windows.Media.Visual,System.Boolean)
This is AddVisual, a member of class PaletteSet.

Autodesk.AutoCAD.Windows.PaletteSet.AddVisual(System.String,System.Windows.Media.Visual)
Adds a visual window.
name:  Input palette name
control:  Input visual control

Autodesk.AutoCAD.Windows.PaletteSet.FloatControl(System.Windows.Rect)
Floats the PaletteSet with area position and size specified by the Rectangle.
value:  Rectangle specifying the position and size of the floating PaletteSet

Autodesk.AutoCAD.Windows.PaletteSet.FloatControl(System.Windows.Point)
Makes the PaletteSet floating.
pointOnScreen:  Top left positon on the screen where PaletteSet will be positioned.

Autodesk.AutoCAD.Windows.PaletteSet.Remove(System.Int32)
Removes palette set window based on the index specified.
index:  Input index of item to remove

Autodesk.AutoCAD.Windows.PaletteSet.CopyTo(Autodesk.AutoCAD.Windows.Palette[],System.Int32)
Copies the palette in this palette set to the array starting from the specified index.
array:  Input target array
index:  Input first index to copy elements to

Autodesk.AutoCAD.Windows.PaletteSet.GetEnumerator
Returns the IEnumerator interface to enumerate the elements of the collection.

Autodesk.AutoCAD.Windows.PaletteSet.Load
Occurs when the palette set data is loaded from XML.

Autodesk.AutoCAD.Windows.PaletteSet.Save
Occurs when the palette set data is saved to XML.

Autodesk.AutoCAD.Windows.PaletteSet.StateChanged
Occurs when a detail of the palette set's state has changed.

Autodesk.AutoCAD.Windows.PaletteSet.Focused
This is Focused, a member of class PaletteSet.

Autodesk.AutoCAD.Windows.PaletteSet.SizeChanged
Occurs when the palette set size changes.

Autodesk.AutoCAD.Windows.PaletteSet.PaletteActivated
Occurs when the palette set data is activated.

Autodesk.AutoCAD.Windows.PaletteSet.PaletteAddContextMenu
Occurs when the palette is given a context menu.

Autodesk.AutoCAD.Windows.PaletteSet.PaletteSetHostMoved
Occurs after a palette has changed locations.

Autodesk.AutoCAD.Windows.PaletteSet.PaletteSetEnterSizeMove
Occurs when the user clicks and holds the mouse button over the bottom right corner of a palette and begins to resize the palette.

Autodesk.AutoCAD.Windows.PaletteSet.Style
Returns the palette set style.

Autodesk.AutoCAD.Windows.PaletteSet.DockEnabled
Controls if the palette set can be docked by the user.

Autodesk.AutoCAD.Windows.PaletteSet.AutoRollUp
Returns the AutoRollUp property value.

Autodesk.AutoCAD.Windows.PaletteSet.RolledUp
Returns the RolledUp property value.

Autodesk.AutoCAD.Windows.PaletteSet.Name
Name of the palette set window.

Autodesk.AutoCAD.Windows.PaletteSet.Count
Returns the Count property value.

Autodesk.AutoCAD.Windows.PaletteSet.Opacity
Opacity of the palette set window.

Autodesk.AutoCAD.Windows.PaletteSet.TitleBarLocation
Location of the palette set window title bar.

Autodesk.AutoCAD.Windows.PaletteSet.KeepFocus
Gets or sets whether the palette set will keep the input focus even when AutoCAD requests the focus.

Autodesk.AutoCAD.Windows.PaletteSet.Dock
Returns the Dock property value.

Autodesk.AutoCAD.Windows.PaletteSet.LightThemedIcon
Provides access to the 16x16 palette set icon used when the light theme is active.

Autodesk.AutoCAD.Windows.PaletteSet.LargeLightThemedIcon
Provides access to the 32x32 palette set icon used when the light theme is active.

Autodesk.AutoCAD.Windows.PaletteSet.DarkThemedIcon
Provides access to the 16x16 palette set icon used when the dark theme is active.

Autodesk.AutoCAD.Windows.PaletteSet.LargeDarkThemedIcon
Provides access to the 32x32 palette set icon used when the dark theme is active.

Autodesk.AutoCAD.Windows.PaletteSet.Visible
True if the palette set window is visible; otherwise false.

Autodesk.AutoCAD.Windows.PaletteSet.DeviceIndependentSize
This is DeviceIndependentSize, a member of class PaletteSet.

Autodesk.AutoCAD.Windows.PaletteSet.DeviceIndependentLocation
This is DeviceIndependentLocation, a member of class PaletteSet.

Autodesk.AutoCAD.Windows.PaletteSet.DeviceIndependentMinimumSize
This is DeviceIndependentMinimumSize, a member of class PaletteSet.

Autodesk.AutoCAD.Windows.PaletteSet.MinimumSize
Minimum size of the palette set window.

Autodesk.AutoCAD.Windows.PaletteSet.Anchored
Returns the Anchored property value.

Autodesk.AutoCAD.Windows.PaletteSet.Size
Actual size of the palette set window.

Autodesk.AutoCAD.Windows.PaletteSet.Location
Location of the palette set window.

Autodesk.AutoCAD.Windows.PaletteSet.Icon
This is Icon, a member of class PaletteSet.