Autodesk.AutoCAD.EditorInput.LivePreviewContextParameter
This is class Autodesk.AutoCAD.EditorInput.LivePreviewContextParameter.

Autodesk.AutoCAD.EditorInput.LivePreviewContextParameter.Type
This is Type, a member of class LivePreviewContextParameter.

Autodesk.AutoCAD.EditorInput.LivePreviewContextParameter.Value
This is Value, a member of class LivePreviewContextParameter.

Autodesk.AutoCAD.EditorInput.LivePreviewContextParameter.LivePreview
This is LivePreview, a member of class LivePreviewContextParameter.