Autodesk.AutoCAD.ApplicationServices.DocumentWindowActivatedEventArgs
Used in DocumentWindowActivated event as event args<.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowActivatedEventArgs.DocumentWindow
Identify which document window is activated.