Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase
This abstract class defines a general custom tool that can be used to implement any type of tool supported by tool palettes.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.DropCallback(Autodesk.AutoCAD.DatabaseServices.Entity)
Determines the application's response when a user drops entities on the Tool Palettes window from the AutoCAD editor.
entity:  Input entity

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateStockTool(System.String)
Returns the StockTool associated with the tool.
catalogName:  Input catalog name

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreatePalette(Autodesk.AutoCAD.Windows.ToolPalette.Catalog,System.String)
Creates a Palette, and adds it to the catalog passed in.
catalogName:  Input catalog name
paletteName:  Input palette name

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateTool
Creates the tool object.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateFlyoutTool(Autodesk.AutoCAD.Windows.ToolPalette.Package,Autodesk.AutoCAD.Windows.ToolPalette.Package,System.String)
Creates a Flyout tool, which can contain packages of other tools.
palette:  Input palette
shapePackage:  Input shape package
toolNameOverride:  Input tool name override

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CreateShapeCatalog(System.String)
Returns the singleton shape catalog, which contains the shape packages.
shapeName:  Input shape name

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetStockTool
Returns the StockTool pointer associated with the tool, and returns NULL if the stock tool is not found.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.BeginEdit
Called by the framework before displaying the dialog to edit the tool properties.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.New
The framework calls this method to create a new tool.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetDropTarget
The framework calls this method to get the IDropTarget interface from the tool.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ValidateEditChanges
Called by the framework when a tool is edited in the framework's default tool properties editor and the user presses OK.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.GetToolProperties
Gets the IUnknown of IAcadToolProperties.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.DragLeave
Called by the framework on a stock tool when a dragged object leaves a palette containing tools.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ToolGuid
Returns the ToolGuid property value.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ToolName
Returns the ToolName property value.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.ToolImage
Returns the ToolImage property value.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.FlayoutPackageID
Returns the FlayoutPackageID property value.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.CurrentShapeId
Returns the CurrentShapeId property value.

Autodesk.AutoCAD.Windows.ToolPalette.CustomToolBase.EditMode
Returns the EditMode property value.