Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension
This class contains information necessary to extend a tabbed dialog.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.Control
Accesses the control that fills the client area of the tab.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnOk
Accesses the event handler that is called when the user clicks the OK button in the main dialog to apply changes and dismiss the dialog.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnCancel
Accesses the event handler that is called when the main dialog is canceled.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnHelp
Accesses the event handler that is called when the user clicks the Help button in the main dialog.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension.OnApply
Accesses the event handler that is called when the user clicks the Apply button in the main dialog to apply changes.