Autodesk.AutoCAD.Windows.MenuItem
This class holds information related to a menu item.

Autodesk.AutoCAD.Windows.MenuItem.#ctor(System.String,System.Drawing.Icon)
Constructs a new menu item with a given icon.
value:  Input new item name
icon:  Input new icon

Autodesk.AutoCAD.Windows.MenuItem.#ctor(System.String)
Constructs a new menu item.
value:  Input new item

Autodesk.AutoCAD.Windows.MenuItem.Click
Occurs when the menu item is clicked by the user.

Autodesk.AutoCAD.Windows.MenuItem.Text
String displayed by the MenuItem.

Autodesk.AutoCAD.Windows.MenuItem.Enabled
True if the MenuItem is enabled otherwise false.

Autodesk.AutoCAD.Windows.MenuItem.Visible
True if the MenuItem is visible otherwise false.

Autodesk.AutoCAD.Windows.MenuItem.Checked
True if the MenuItem is checked otherwise false.

Autodesk.AutoCAD.Windows.MenuItem.Icon
Returns the Icon property value.