Autodesk.AutoCAD.EditorInput.LivePreviewCommand
This is class Autodesk.AutoCAD.EditorInput.LivePreviewCommand.

Autodesk.AutoCAD.EditorInput.LivePreviewCommand.#ctor(System.String)
This is LivePreviewCommand, a member of class LivePreviewCommand.

Autodesk.AutoCAD.EditorInput.LivePreviewCommand.Execute
This is Execute, a member of class LivePreviewCommand.