Autodesk.AutoCAD.Windows.TrayItemCollection
This class represents a collection of TrayItem objects.

Autodesk.AutoCAD.Windows.TrayItemCollection.GetEnumerator
Returns an IEnumerator for this collection.

Autodesk.AutoCAD.Windows.TrayItemCollection.RemoveAt(System.Int32)
Removes the item in the collection at position index.
index:  Input index to remove at

Autodesk.AutoCAD.Windows.TrayItemCollection.Clear
Clears or reset tray item collection.

Autodesk.AutoCAD.Windows.TrayItemCollection.CopyTo(Autodesk.AutoCAD.Windows.TrayItem[],System.Int32)
Copies this collection or a portion of it to a one-dimensional array.
array:  Input Autodesk.AutoCAD.Windows.TrayItem object. One-dimensional array that is the destination of the elements copied from TrayItemCollection; the array must have zero-based indexing.
index:  Input. The zero-based index in array at which copying begins.

Autodesk.AutoCAD.Windows.TrayItemCollection.Insert(System.Int32,Autodesk.AutoCAD.Windows.TrayItem)
Inserts value at position index in the collection.
index:  Input index to insert at
value:  Input value to insert

Autodesk.AutoCAD.Windows.TrayItemCollection.Remove(Autodesk.AutoCAD.Windows.TrayItem)
Removes tray item from the status bar.
value:  Input value to remove

Autodesk.AutoCAD.Windows.TrayItemCollection.Contains(Autodesk.AutoCAD.Windows.TrayItem)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input value to check for

Autodesk.AutoCAD.Windows.TrayItemCollection.IndexOf(Autodesk.AutoCAD.Windows.TrayItem)
Returns the zero-based index of the collection item that matches value.
value:  Input value to retrieve the index of

Autodesk.AutoCAD.Windows.TrayItemCollection.Add(Autodesk.AutoCAD.Windows.TrayItem)
Adds the object represented by value to this collection.
value:  Input value to add

Autodesk.AutoCAD.Windows.TrayItemCollection.Count
Accesses the number of elements actually contained in the TrayItemCollection.

Autodesk.AutoCAD.Windows.TrayItemCollection.IsFixedSize
True if the TrayItemCollection has a fixed size; otherwise, false.

Autodesk.AutoCAD.Windows.TrayItemCollection.IsReadOnly
True if the TrayItemCollection is read-only; otherwise, false.