Autodesk.AutoCAD.Windows.TrayItemBubbleWindowClosedEventArgs
This class provides data for the TrayItemBubbleWindow.Closed event.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindowClosedEventArgs.CloseReason
Accesses the close reason property.