Autodesk.AutoCAD.Windows.StatusBarItem
This .NET class wraps the AcStatusBarItem ObjectARX class.

Autodesk.AutoCAD.Windows.StatusBarItem.MouseDown
Wraps the following functions:
1.

Autodesk.AutoCAD.Windows.StatusBarItem.Deleted
This callback function is invoked when a pane or tray item is removed from the status bar.

Autodesk.AutoCAD.Windows.StatusBarItem.PointToClient(System.Drawing.Point)
Wraps AcStatusBarItem.ScreenToClient.
p:  Input or POINT structure that contains the screen coordinates to be converted.

Autodesk.AutoCAD.Windows.StatusBarItem.PointToScreen(System.Drawing.Point)
Wraps AcStatusBarItem.ClientToScreen.
p:  Input or POINT structure that contains the client coordinates to be converted.

Autodesk.AutoCAD.Windows.StatusBarItem.Icon
Returns the icon object representing the icon displayed for the pane or tray item in the status bar.

Autodesk.AutoCAD.Windows.StatusBarItem.ToolTipText
Returns the pane's or tray item's tooltip text.

Autodesk.AutoCAD.Windows.StatusBarItem.Enabled
This enables or disables the status bar item, which is a pane or a tray item.

Autodesk.AutoCAD.Windows.StatusBarItem.Visible
Hides or shows the pane or tray item.