Autodesk.AutoCAD.EditorInput.LivePreviewPropertySetting
This is class Autodesk.AutoCAD.EditorInput.LivePreviewPropertySetting.

Autodesk.AutoCAD.EditorInput.LivePreviewPropertySetting.#ctor(System.ComponentModel.PropertyDescriptor,System.Object,System.Object)
This is LivePreviewPropertySetting, a member of class LivePreviewPropertySetting.

Autodesk.AutoCAD.EditorInput.LivePreviewPropertySetting.Execute
This is Execute, a member of class LivePreviewPropertySetting.