Autodesk.AutoCAD.EditorInput.LivePreviewContextProxy
This is class Autodesk.AutoCAD.EditorInput.LivePreviewContextProxy.

Autodesk.AutoCAD.EditorInput.LivePreviewContextProxy.Dispose
This is Dispose, a member of class LivePreviewContextProxy.