Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs
This class provides event parameters related to the mouse-down events in the status bar area.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.X
X mouse screen coordinate.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.Y
Y mouse screen coordinate.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.DoubleClick
Returns true if the mouse event is a double click; otherwise, returns false.

Autodesk.AutoCAD.Windows.StatusBarMouseDownEventArgs.Button
Returns the Button property value.