Autodesk.AutoCAD.Windows.OpenFileDialog
This class represents a dialog box that allows the user to choose a file.

Autodesk.AutoCAD.Windows.OpenFileDialog.ShowDialog
Shows open file dialog box.

Autodesk.AutoCAD.Windows.OpenFileDialog.GetFilenames
Gets the file names chosen by the user when multiple selection is allowed.

Autodesk.AutoCAD.Windows.OpenFileDialog.Filename
The filename chosen by the user.