Autodesk.AutoCAD.ApplicationServices.TabbedDialogEventArgs
This class contains parameters and operations related to tabbed dialog related events.

Autodesk.AutoCAD.ApplicationServices.TabbedDialogEventArgs.AddTab(System.String,Autodesk.AutoCAD.ApplicationServices.TabbedDialogExtension)
Add user defined page to the tabbed dialog firing this event.
name:  Input the name of the newly created tab.
extension:  Input a TabeddedDialogExtension that is responsible for the client area of the new tab.