Autodesk.AutoCAD.EditorInput.LivePreviewAction
This is class Autodesk.AutoCAD.EditorInput.LivePreviewAction.

Autodesk.AutoCAD.EditorInput.LivePreviewAction.Execute
This is Execute, a member of class LivePreviewAction.