Autodesk.AutoCAD.Windows.ContextMenuExtension
This type allows users to extend various context (shortcut) menus in AutoCAD.

Autodesk.AutoCAD.Windows.ContextMenuExtension.Popup
Occurs when the ContextMenuExtension object is displayed by AutoCAD.

Autodesk.AutoCAD.Windows.ContextMenuExtension.Title
Returns a string representing title.