Autodesk.AutoCAD.Windows.WPFDocumentWindow
Class used for creating WPF based document window.

Autodesk.AutoCAD.Windows.WPFDocumentWindow.#ctor(System.Windows.Media.Visual)
Constructor, using a WPF visual to create a WPF document window.
wpfVisual:  WPF visual to be used to create WPF document window as a sub-window of AutoCAD