Autodesk.AutoCAD.Windows.TrayItem
This .NET class wraps the AcTrayItem ObjectARX class.

Autodesk.AutoCAD.Windows.TrayItem.#ctor
Default constructor.

Autodesk.AutoCAD.Windows.TrayItem.ShowBubbleWindow(Autodesk.AutoCAD.Windows.TrayItemBubbleWindow)
Wraps AcTrayItem.ShowBubbleWindow.
bubble:  Input bubble to show

Autodesk.AutoCAD.Windows.TrayItem.CloseBubbleWindows
Wraps AcTrayItem.CloseAllBubbleWindows.