Autodesk.AutoCAD.Windows.DropTarget
Applications derive from this class to implement custom drag-and-drop behavior in AutoCAD.

Autodesk.AutoCAD.Windows.DropTarget.OnDragLeave
See the Microsoft .NET API documentation for details.