Autodesk.AutoCAD.Windows.TrayItemBubbleWindow
This .NET class wraps the AcTrayItemBubbleWindowControl ObjectARX class.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Closed
Wraps the following functions: AcTrayItemBubbleWindowControl.SetCallback, AcTrayItemBubbleWindowControl.GetCallbackDataAcTrayItemBubbleWindowControl.SetCallback sets the callback function and callback data for the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.IconType
Wraps the following functions: AcTrayItemBubbleWindowControl.GetIconType, AcTrayItemBubbleWindowControl.SetIconType
This property accesses the bubble window icon type that is displayed in the upper-left corner of the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Title
Accesses the title string that is displayed in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Text
Accesses the descriptive text that is displayed in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.HyperText
Accesses the hyperlink text that is displayed in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.HyperLink
Accesses the URL string that is invoked when the user selects the hyperlink text in the bubble window.

Autodesk.AutoCAD.Windows.TrayItemBubbleWindow.Text2
Accesses the descriptive text that is displayed below the hypertext( if there is any) in the bubble window.