Autodesk.AutoCAD.EditorInput.LivePreviewActionBase
This is class Autodesk.AutoCAD.EditorInput.LivePreviewActionBase.

Autodesk.AutoCAD.EditorInput.LivePreviewActionBase.Execute
This is Execute, a member of class LivePreviewActionBase.

Autodesk.AutoCAD.EditorInput.LivePreviewActionBase.OnAborted
This is OnAborted, a member of class LivePreviewActionBase.