Autodesk.AutoCAD.EditorInput.LivePreviewDelegate
This is class Autodesk.AutoCAD.EditorInput.LivePreviewDelegate.

Autodesk.AutoCAD.EditorInput.LivePreviewDelegate.#ctor(Autodesk.AutoCAD.EditorInput.LivePreviewCallback,Autodesk.AutoCAD.EditorInput.LivePreviewCallback)
This is LivePreviewDelegate, a member of class LivePreviewDelegate.

Autodesk.AutoCAD.EditorInput.LivePreviewDelegate.#ctor(Autodesk.AutoCAD.EditorInput.LivePreviewCallback)
This is LivePreviewDelegate, a member of class LivePreviewDelegate.

Autodesk.AutoCAD.EditorInput.LivePreviewDelegate.Execute
This is Execute, a member of class LivePreviewDelegate.

Autodesk.AutoCAD.EditorInput.LivePreviewDelegate.OnAborted
This is OnAborted, a member of class LivePreviewDelegate.