Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection
Wrapper (wraps AcApDocWindowManager).

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.LookupDocumentWindow(AcApDocWindow*)
This is LookupDocumentWindow, a member of class DocumentWindowCollection.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.GetEnumerator
Get the enumerator used to iterate document windows inside document window collection.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.MoveDocumentWindow(Autodesk.AutoCAD.Windows.DocumentWindow,System.Int32)
Change the order of document windows.
documentWindow:  Document window to be moved
newIndex:  New index for where to put the document window moved as the new position, the range for this parameter should be between 0 and Count-1

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.AddDocumentWindow(System.String,System.Uri)
Add a web page as a document window to the document window collection.
title:  Title of the document window which will be shown in the file tab
htmlPage:  URI of the web page

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.AddDocumentWindow(Autodesk.AutoCAD.Windows.DocumentWindow)
Add the document to the document window collection.
documentWindow:  document window to be added into document window collection

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.DocumentWindowActivated
Event triggered when a document window is activated.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.CopyTo(System.Array,System.Int32)
This is CopyTo, a member of class DocumentWindowCollection.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.ArrangeIcons
Arrange icons for MDI child windows.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.TileVertically
Tile vertically for MDI child windows.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.TileHorizontally
Tile horizontally for MDI child windows.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.Cascade
Cascade for MDI child windows.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.Dispose
This is Dispose, a member of class DocumentWindowCollection.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.Count
Gets the count of all the document windows.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.ActiveDocumentWindow
Gets which document window is currently activated.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.SyncRoot
This is SyncRoot, a member of class DocumentWindowCollection.

Autodesk.AutoCAD.ApplicationServices.DocumentWindowCollection.IsSynchronized
This is IsSynchronized, a member of class DocumentWindowCollection.