Autodesk.AutoCAD.ApplicationServices.Application
The Application object is the root object of the AutoCAD .NET API.

Autodesk.AutoCAD.ApplicationServices.Application.AddDefaultContextMenuExtension(Autodesk.AutoCAD.Windows.ContextMenuExtension)
Adds a default mode context (shortcut) menu.
menuExtension:  Input Autodesk.AutoCAD.Windows.ContextMenuExtension object. The context (shortcut) menu to be displayed as part of the default context menu.

Autodesk.AutoCAD.ApplicationServices.Application.RemoveDefaultContextMenuExtension(Autodesk.AutoCAD.Windows.ContextMenuExtension)
Removes a mode context (shortcut) menu for a given class.
menuExtension:  Input Autodesk.AutoCAD.Windows.ContextMenuExtension object. The context (shortcut) menu to be removed as part of the default context menu.

Autodesk.AutoCAD.ApplicationServices.Application.AddObjectContextMenuExtension(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Windows.ContextMenuExtension)
Adds a context (shortcut) menu for a given class.
runtimeClass:  Input Autodesk.AutoCAD.Runtime.RXClass object. The runtime class of the object that has the context (shortcut) menu.
menuExtension:  Input Autodesk.AutoCAD.Windows.ContextMenuExtension object. The context (shortcut) menu to be displayed as part of the object selection context menu.

Autodesk.AutoCAD.ApplicationServices.Application.RemoveObjectContextMenuExtension(Autodesk.AutoCAD.Runtime.RXClass,Autodesk.AutoCAD.Windows.ContextMenuExtension)
Removes a mode context (shortcut) menu for a given class.
runtimeClass:  Input Autodesk.AutoCAD.Runtime.RXClass object. The runtime class of the object that has the context (shortcut) menu.
menuExtension:  Input Autodesk.AutoCAD.Windows.ContextMenuExtension object. The context (shortcut) menu to be removed as part of the object selection context (shortcut) menu.

Autodesk.AutoCAD.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32,System.String)
Calls context help with a set prefix.
window:  Input window.
contextId:  Input context ID.
helpPrefix:  Input help prefix.

Autodesk.AutoCAD.ApplicationServices.Application.InvokeContextHelp(System.IntPtr,System.Int32)
Calls the context help with a null helpPrefix.
window:  Input window.
contextId:  Input context ID.

Autodesk.AutoCAD.ApplicationServices.Application.InvokeHelp(System.String,System.String)
Calls the help document with a specific topic.
fileName:  Input name of help file.
topic:  Input topic to open.

Autodesk.AutoCAD.ApplicationServices.Application.InvokeHelpForExternal(System.String)
This .NET method wraps the ObjectARX acedHelpForExternal function.

Autodesk.AutoCAD.ApplicationServices.Application.LoadPartialMenu(System.String)
Adds (loads) a partial menu to the current main menu.
filename:  The menu filename. Can be provided with or without a path, though if provided without a path, it is expected that the file is located on the current support files search path. The method call is rejected if the string is null, empty, or "." .

Autodesk.AutoCAD.ApplicationServices.Application.UnloadPartialMenu(System.String)
Removes (unloads) a partial menu from the current main menu.
filename:  The menu filename. Can be provided with or without a path, though there is a better chance of success if provided without a path.

Autodesk.AutoCAD.ApplicationServices.Application.LoadMainMenu(System.String)
Changes the currently loaded main menu.
filename:  The menu filename. Can be provided with or without a path, though if provided without a path, it is expected that the file is located on the current support files search path. The method call is rejected if null or the empty string; to unload the main menu, supply "." .

Autodesk.AutoCAD.ApplicationServices.Application.SetCurrentWorkspace(System.String)
Sets the current workspace.
workspaceName:  The name of a workspace to make current.

Autodesk.AutoCAD.ApplicationServices.Application.ReloadAllMenus
Updates the User Interface in AutoCAD to reflect any changes made to the currently loaded menus.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalWindow(System.Uri)
Launches a modal dialog with the specified URI.
htmlPage:  URI of the page to be loaded into the modal window.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalWindow(System.IntPtr,System.Uri)
Launches a modal dialog with the specified URI.
owner:  Owner Window.
htmlPage:  URI of the page to be loaded into the modal window.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModalWindow(System.IntPtr,System.Uri,System.Boolean)
Launches a modal dialog with the specified URI. The window hosts a browser window which displays the html page.
owner:  Owner Window.
htmlPage:  URI of the page to be loaded into the modal window.
persistSizeAndPosition:  Saves the current size and position of the window if set to true.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessWindow(System.Uri)
Launches a modeless dialog with the specified URI.
htmlPage:  URI of the page to be loaded into the modeless window.

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessWindow(System.IntPtr,System.Uri)
Launches a modeless dialog with the specified URI.
owner:  Owner Window
htmlPage:  URI of the page to be loaded into the modeless window

Autodesk.AutoCAD.ApplicationServices.Application.ShowModelessWindow(System.IntPtr,System.Uri,System.Boolean)
Launches a modeless dialog with the specified URI. The window hosts a browser window which displays the html page.
owner:  Owner Window
htmlPage:  URI of the page to be loaded into the modeless window.
persistSizeAndPosition:  Saves the current size and position of the window if set to true.

Autodesk.AutoCAD.ApplicationServices.Application.ToSystemDrawingPoint(System.Windows.Point)
This is ToSystemDrawingPoint, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Application.ToSystemDrawingSize(System.Windows.Size)
This is ToSystemDrawingSize, a member of class Application.

Autodesk.AutoCAD.ApplicationServices.Application.AcadApplication
Accesses the AcadApplication.

Autodesk.AutoCAD.ApplicationServices.Application.DocumentWindowCollection
Accesses the collection of DocumentWindow objects.

Autodesk.AutoCAD.ApplicationServices.Application.StatusBar
Accesses the status bar.

Autodesk.AutoCAD.ApplicationServices.Application.Preferences
Accesses the preferences.

Autodesk.AutoCAD.ApplicationServices.Application.MenuBar
Accesses the menu bar.

Autodesk.AutoCAD.ApplicationServices.Application.MenuGroups
Returns the menu groups.

Autodesk.AutoCAD.ApplicationServices.Application.InfoCenter
Accesses the InfoCenter property.

Autodesk.AutoCAD.ApplicationServices.Application.IsSteelInstalled
This is IsSteelInstalled, a member of class Application.