Autodesk.AutoCAD.Windows.PaneCollection
This class represents a collection of panes.

Autodesk.AutoCAD.Windows.PaneCollection.GetEnumerator
Returns an IEnumerator for the collection.

Autodesk.AutoCAD.Windows.PaneCollection.RemoveAt(System.Int32)
Removes the value based on the index specified.
index:  Input index of item to remove

Autodesk.AutoCAD.Windows.PaneCollection.Clear
Clears the object represented by value from this collection.

Autodesk.AutoCAD.Windows.PaneCollection.CopyTo(Autodesk.AutoCAD.Windows.Pane[],System.Int32)
Copies the PaneCollection class or a portion of it to a one-dimensional array.
array:  Input one-dimensional array that is the destination
index:  Input zero-based index in array at which copying begins.

Autodesk.AutoCAD.Windows.PaneCollection.Insert(System.Int32,Autodesk.AutoCAD.Windows.Pane)
Inserts value at position index in the collection.
index:  Input index to insert at
value:  Input to insert

Autodesk.AutoCAD.Windows.PaneCollection.Remove(Autodesk.AutoCAD.Windows.Pane)
Removes the object represented by value from this collection.
value:  Input pane to remove

Autodesk.AutoCAD.Windows.PaneCollection.Contains(Autodesk.AutoCAD.Windows.Pane)
Returns a value indicating whether the collection contains an object that matches value.
value:  Input object to check for

Autodesk.AutoCAD.Windows.PaneCollection.IndexOf(Autodesk.AutoCAD.Windows.Pane)
Returns the zero-based index of the collection item that matches value.
value:  Input object to retrieve index of

Autodesk.AutoCAD.Windows.PaneCollection.Add(Autodesk.AutoCAD.Windows.Pane)
Adds the object represented by value to this collection.
value:  Input object to add

Autodesk.AutoCAD.Windows.PaneCollection.Count
Gets the number of elements contained in the PaneCollection object.

Autodesk.AutoCAD.Windows.PaneCollection.IsFixedSize
Gets a value indicating whether the PaneCollection has a fixed size.

Autodesk.AutoCAD.Windows.PaneCollection.IsReadOnly
Gets a value indicating whether the PaneCollection is read-only.