Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings
This wraps the ObjectARX AcEdInplaceTextEditorSettings class.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.#ctor
Constructor.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.Flags
This wraps the ObjectARX AcEdInplaceTextEditorSettings::editFlags() and AcEdInplaceTextEditorSettings::setEditFlags() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.Type
This wraps the ObjectARX AcEdInplaceTextEditorSettings::sourceEntityType() and AcEdInplaceTextEditorSettings::setSourceEntityType() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.TabSupported
This wraps the ObjectARX AcEdInplaceTextEditorSettings::tabSupported() and AcEdInplaceTextEditorSettings::setSupportTab() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.SimpleMText
This wraps the ObjectARX AcEdInplaceTextEditorSettings::simpleMText() and AcEdInplaceTextEditorSettings::setSimpleMText() methods.

Autodesk.AutoCAD.ApplicationServices.InplaceTextEditorSettings.DefinedHeight
This wraps the ObjectARX AcEdInplaceTextEditorSettings::definedHeight() and AcEdInplaceTextEditorSettings::setDefinedHeight() methods.