Autodesk.AutoCAD.Windows.PaletteSetSizeEventArgs
This class provides event parameters related to the size-setting events in the palette set.

Autodesk.AutoCAD.Windows.PaletteSetSizeEventArgs.#ctor(System.Int32,System.Int32,System.Double,System.Double)
This constructs an object with information for pixel and device-independent units.
cx:  Input pixel width
cy:  Input pixel height
dx:  Input device-independent width
dy:  Input device-independent height

Autodesk.AutoCAD.Windows.PaletteSetSizeEventArgs.Width
Accesses the width of the palette set.

Autodesk.AutoCAD.Windows.PaletteSetSizeEventArgs.Height
Accesses the height of the palette set.

Autodesk.AutoCAD.Windows.PaletteSetSizeEventArgs.DeviceIndependentWidth
Accesses the device independent width value.

Autodesk.AutoCAD.Windows.PaletteSetSizeEventArgs.DeviceIndependentHeight
Accesses the device independent height value.