Autodesk.AutoCAD.Windows.ColorDialog
This class represents a dialog box that allows the user to choose a color.

Autodesk.AutoCAD.Windows.ColorDialog.ShowDialog
Shows color dialog box.

Autodesk.AutoCAD.Windows.ColorDialog.IncludeByBlockByLayer
Gets or sets whether meta colors are to be included.

Autodesk.AutoCAD.Windows.ColorDialog.Color
Accesses the color that the user chooses or sets as default.