Autodesk.AutoCAD.Windows.Palette
This .NET class wraps the CAdUiPalette ObjectARX class.

Autodesk.AutoCAD.Windows.Palette.Name
Accesses the name of the palette.

Autodesk.AutoCAD.Windows.Palette.PaletteSet
Accesses the palette set this palette is a part of.