Autodesk.AutoCAD.Windows.PalettePersistEventArgs
This class provides data for the PalettePersist event.

Autodesk.AutoCAD.Windows.PalettePersistEventArgs.#ctor(Autodesk.AutoCAD.ApplicationServices.IConfigurationSection)
Constructor.
configurationSection:  Input configuration section

Autodesk.AutoCAD.Windows.PalettePersistEventArgs.ConfigurationSection
Returns the ConfigurationSection property value.